
 make.py started: 2020-03-07 17:37:00 C:\Users\dgentil1\Desktop\aborto_uru_repo\Aborto-Uruguay\derived\Time_state_age_panel\code 




Execute:  "C:\Program Files (x86)\Stata14\StataSE-64.exe" /e do "./create_time_dpto_age_panel.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401406206058
         Licensed to:  CIS Department
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./create_time_dpto_age_panel.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata14\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata14\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main 
  1.     create_year_dpto_age_panel
  2. end

. 
. program create_year_dpto_age_panel
  1.     use ../../../base/Population/output/by_anio_dpto_agebin_fertile_women_
> population.dta, clear
  2.     save_data ../output/year_dpto_age_panel.dta, key(anio dpto age_min) re
> place
  3. end

. 
. * EXECUTE
. main
(data already sorted by anio dpto age_min)
  (0 bytes saved)
===============================================================================
> ===================
File: ../output/year_dpto_age_panel.dta
Key: anio dpto age_min
===============================================================================
> ===================
  2850:5(19433):3173531516:3424861508

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        anio |      2,850        2008    7.212368       1996       2020
        dpto |      2,850          10    5.478187          1         19
     age_min |      2,850        27.5    8.540624         15         40
     age_max |      2,850        31.5    8.540624         19         44
fertile_wo~p |      2,850      6354.9    11207.49   715.6553   62659.04




(note: file ../output/year_dpto_age_panel.dta not found)
file ../output/year_dpto_age_panel.dta saved

. 
end of do-file

 make.py ended: 2020-03-07 17:37:01
