
 make.py started: 2020-03-22 08:32:53 C:\Users\diegog\Desktop\Diego\Aborto-Uruguay\derived\Vitals\code 




Execute:  StataMP-64 /e do "./assign_treatment.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./assign_treatment.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main 
  1.     import_treatment_dates
  2.     assign_treatment
  3.     
.     save_data ../temp/vital_birth_records.dta, key(birth_id) replace
  4. end

. 
. program import_treatment_dates
  1.     import excel ../../../raw/timeline_implementation.xlsx, clear firstrow
>  cellrange(D1:E14)
  2.     keep if !mi(impl_date)
  3.     
.     bys dpto: egen impl_date_dpto = min(impl_date)
  4.     gen IS_impl_date = impl_date_dpto
  5.     format %td IS_impl_date
  6. 
.     keep dpto IS_impl_date
  7.     duplicates drop
  8.     save_data ../temp/timeline_implementation.dta, key(dpto) replace
  9. 
.     import excel ../../../raw/control_impl_dates.xlsx, clear firstrow
 10.     keep dpto impl_date
 11.     save_data ../temp/timeline_control_implementation.dta, key(dpto) repla
> ce
 12. end

. 
. program assign_treatment
  1.     use ../../../base/Vitals/output/vital_birth_records.dta, clear
  2.     merge m:1 dpto using ../temp/timeline_implementation.dta, ///
>         keepusing(IS_impl_date)
  3.     gen montevideo = (dpto == 1)        
  4.     gen treated = (_merge == 3 & dpto != 1)
  5.     drop _merge
  6.     merge m:1 dpto using ../temp/timeline_control_implementation.dta, ///
>         keepusing(impl_date)
  7.     replace IS_impl_date = impl_date if _merge == 3
  8.     gen control = (_merge == 3)
  9.     drop impl_date _merge
 10.     gen treated_or_control = (treated == 1 | control == 1)
 11.     
.     relative_time, event_date(IS_impl_date) time(anio_qtr) time_fun(qofd) win
> dow(12)
 12.     relative_time, event_date(IS_impl_date) time(anio_sem) time_fun(hofd) 
> window(6)
 13.     relative_time, event_date(IS_impl_date) time(anio) time_fun(yofd) wind
> ow(4)
 14. 
.     /*gen VTP_impl_date = td(01jan2013)
>     format %td VTP_impl_date*/
. end

. 
. program relative_time
  1.     syntax, event_date(str) time(str) time_fun(str) window(int) 
  2.   
.     gen rel_t_`time' = `time' - `time_fun'(`event_date') if !missing(IS_impl_
> date)
  3.     bysort dpto: gen post_`time' = (`time' >= `time_fun'(`event_date'))   
>  
  4.     replace rel_t_`time' = -1000    if rel_t_`time' < -`window' & !missing
> (IS_impl_date)
  5.     replace rel_t_`time' = 1000 if rel_t_`time' >  `window' & !missing(IS_
> impl_date)
  6.     replace rel_t_`time' = rel_t_`time' + `window' + 1 if ///
>         (rel_t_`time' != -1000 & rel_t_`time' != 1000 & !missing(IS_impl_date
> )) ///
>         
  7.     replace rel_t_`time' = 0 if rel_t_`time' == -1000 & !missing(IS_impl_d
> ate)
  8.     assert !mi(rel_t_`time') if !missing(IS_impl_date)
  9.     tab rel_t_`time', m
 10. end

. 
. * EXECUTE
. main
(3 observations deleted)

Duplicates in terms of all variables

(5 observations deleted)
(data already sorted by dpto)
  variable IS_impl_date was float now int
  (10 bytes saved)
===============================================================================
> ===================
File: ../temp/timeline_implementation.dta
Key: dpto
===============================================================================
> ===================
  5:2(47831):3244004639:1048402393

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        dpto |          5         8.2    6.379655          1         16
IS_impl_date |          5     17373.2    865.7868      16162      18414




(note: file ../temp/timeline_implementation.dta not found)
file ../temp/timeline_implementation.dta saved
(data now sorted by dpto)
  (0 bytes saved)
===============================================================================
> ===================
File: ../temp/timeline_control_implementation.dta
Key: dpto
===============================================================================
> ===================
  4:2(32042):140096628:1429260735

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        dpto |          4        4.75    2.217356          2          7
   impl_date |          4     18079.5    386.2473      17745      18414




(note: file ../temp/timeline_control_implementation.dta not found)
file ../temp/timeline_control_implementation.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       302,531
        from master                   302,531  (_merge==1)
        from using                          0  (_merge==2)

    matched                           531,983  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                       770,379
        from master                   770,379  (_merge==1)
        from using                          0  (_merge==2)

    matched                            64,135  (_merge==3)
    -----------------------------------------
(64,135 real changes made)
(238,396 missing values generated)
(130,821 real changes made)
(249,793 real changes made)
(215,504 real changes made)
(130,821 real changes made)

rel_t_anio_ |
        qtr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    130,821       15.68       15.68
          1 |      8,968        1.07       16.75
          2 |      9,239        1.11       17.86
          3 |      8,693        1.04       18.90
          4 |      9,151        1.10       20.00
          5 |      8,683        1.04       21.04
          6 |      9,058        1.09       22.12
          7 |      8,995        1.08       23.20
          8 |      8,930        1.07       24.27
          9 |      8,656        1.04       25.31
         10 |      8,635        1.03       26.34
         11 |      8,669        1.04       27.38
         12 |      8,549        1.02       28.41
         13 |      8,457        1.01       29.42
         14 |      8,443        1.01       30.43
         15 |      8,563        1.03       31.46
         16 |      8,469        1.01       32.47
         17 |      8,165        0.98       33.45
         18 |      8,310        1.00       34.45
         19 |      8,225        0.99       35.43
         20 |      8,515        1.02       36.45
         21 |      8,356        1.00       37.45
         22 |      8,446        1.01       38.47
         23 |      8,552        1.02       39.49
         24 |      8,564        1.03       40.52
         25 |      8,213        0.98       41.50
       1000 |    249,793       29.93       71.43
          . |    238,396       28.57      100.00
------------+-----------------------------------
      Total |    834,514      100.00
(238,396 missing values generated)
(122,257 real changes made)
(249,367 real changes made)
(224,494 real changes made)
(122,257 real changes made)

rel_t_anio_ |
        sem |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    122,257       14.65       14.65
          1 |     18,012        2.16       16.81
          2 |     17,900        2.14       18.95
          3 |     17,854        2.14       21.09
          4 |     18,087        2.17       23.26
          5 |     17,512        2.10       25.36
          6 |     17,340        2.08       27.44
          7 |     16,921        2.03       29.46
          8 |     17,140        2.05       31.52
          9 |     16,581        1.99       33.51
         10 |     16,559        1.98       35.49
         11 |     16,795        2.01       37.50
         12 |     17,058        2.04       39.55
         13 |     16,735        2.01       41.55
       1000 |    249,367       29.88       71.43
          . |    238,396       28.57      100.00
------------+-----------------------------------
      Total |    834,514      100.00
(238,396 missing values generated)
(84,669 real changes made)
(200,328 real changes made)
(311,121 real changes made)
(84,669 real changes made)

 rel_t_anio |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     84,669       10.15       10.15
          1 |     36,604        4.39       14.53
          2 |     36,000        4.31       18.85
          3 |     35,863        4.30       23.14
          4 |     34,917        4.18       27.33
          5 |     34,016        4.08       31.40
          6 |     33,179        3.98       35.38
          7 |     33,844        4.06       39.44
          8 |     33,104        3.97       43.40
          9 |     33,594        4.03       47.43
       1000 |    200,328       24.01       71.43
          . |    238,396       28.57      100.00
------------+-----------------------------------
      Total |    834,514      100.00
(data now sorted by birth_id)
  variable montevideo was float now byte
  variable treated was float now byte
  variable control was float now byte
  variable treated_or_control was float now byte
  variable rel_t_anio_qtr was float now int
  variable post_anio_qtr was float now byte
  variable rel_t_anio_sem was float now int
  variable post_anio_sem was float now byte
  variable rel_t_anio was float now int
  variable post_anio was float now byte
  (22,531,878 bytes saved)
===============================================================================
> ===================
File: ../temp/vital_birth_records.dta
Key: birth_id
===============================================================================
> ===================
  834514:38(11275):3917687799:1416264686

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    birth_id |    834,514      417285      240940          1     834645
        anio |    834,514    2006.836    4.961379       1999       2015
   tipoestab |    834,514    1.799739    1.020027          1          9
       edadm |    834,514     27.4226    9.631511         10         99
        dpto |    834,514    5.506037     5.88674          1         19
-------------+---------------------------------------------------------
dpto_resid~e |    832,780    5.966962    5.836088          1         19
     married |    782,635    .3598433    .4799546          0          1
 not_married |    782,635    .6401567    .4799546          0          1
     partner |    782,635     .759368    .4274675          0          1
  no_partner |    782,635     .240632    .4274675          0          1
-------------+---------------------------------------------------------
      single |    782,635    .3239134    .4679677          0          1
 prim_school |    834,514    .6215306    .4850058          0          1
 high_school |    834,514    .1595719    .3662088          0          1
    anio_qtr |    834,514    188.8337    19.87613        156        223
    anio_sem |    834,514    94.16913    9.935076         78        111
-------------+---------------------------------------------------------
recomm_pre~s |    823,603    .8037525    .3971581          0          1
recomm_pre~t |    781,877    .5469351    .4977925          0          1
no_prenata~e |    823,603    .0390139    .1936283          0          1
first_preg~y |    829,325    .3745793    .4840144          0          1
 kids_before |    829,325    .6254207    .4840144          0          1
-------------+---------------------------------------------------------
lowbirthwe~t |    829,581    .0821342    .2745693          0          1
  apgar1_low |    825,436     .046029    .2095481          0          1
  apgar2_low |    825,418    .0100422    .0997063          0          1
preg_preterm |    820,722    .0921883    .2892918          0          1
       young |    834,514    .6725304    .4692905          0          1
-------------+---------------------------------------------------------
       adult |    834,514     .302255    .4592354          0          1
   age_group |    797,779    26.63889    6.314238         18         38
IS_impl_date |    596,118    16627.27    806.6899      16162      18414
  montevideo |    834,514    .5088746    .4999215          0          1
     treated |    834,514    .1286018    .3347589          0          1
-------------+---------------------------------------------------------
     control |    834,514    .0768531    .2663584          0          1
treated_or~l |    834,514    .2054549    .4040339          0          1
rel_t_anio~r |    596,118    423.6634    489.5107          0       1000
post_anio_~r |    834,514    .4302756    .4951149          0          1
rel_t_anio~m |    596,118    420.9162     491.092          0       1000
-------------+---------------------------------------------------------
post_anio_~m |    834,514    .4399639    .4963829          0          1
  rel_t_anio |    596,118    338.6194    470.5398          0       1000
   post_anio |    834,514    .4410531    .4965134          0          1




(note: file ../temp/vital_birth_records.dta not found)
file ../temp/vital_birth_records.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./create_vitals_panels.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./create_vitals_panels.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main
  1.     use ../temp/vital_birth_records.dta, clear
  2. 
.     sample_restrictions
  3.     gen_vars    
  4.     save ../temp/vital_birth_records.dta, replace
  5.     create_main_panels
  6. end

. 
. program sample_restrictions
  1.     keep if inrange(edad, 16, 45)
  2.     drop if inlist(dpto,20,99)
  3. end

. 
. program gen_vars
  1.     gen public_health = (tipoestab == 1)
  2.     drop tipoestab
  3. end

. 
. program create_main_panels
  1.     use ../temp/vital_birth_records.dta, clear
  2. 
.     preserve
  3.     keep if treated_or_control == 1
  4.     drop treated_or_control control montevideo
  5.     save_data ../output/main_vitals_panel.dta, key(birth_id) replace
  6.     restore
  7. 
.     keep if montevideo == 1
  8.     drop treated_or_control treated control montevideo
  9.     save_data ../output/main_vitals_panel_mvd.dta, key(birth_id) replace
 10. end

. 
. * EXECUTE
. main
(21,042 observations deleted)
(0 observations deleted)
file ../temp/vital_birth_records.dta saved
(647,497 observations deleted)
(data already sorted by birth_id)
  variable public_health was float now byte
  (497,925 bytes saved)
===============================================================================
> ===================
File: ../output/main_vitals_panel.dta
Key: birth_id
===============================================================================
> ===================
  165975:35(81927):214756636:3137607741

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    birth_id |    165,975    402954.6    240783.4          1     834379
        anio |    165,975    2006.612    4.940414       1999       2015
       edadm |    165,975    26.35178    6.539697         16         45
        dpto |    165,975    6.693851    4.738198          2         16
dpto_resid~e |    165,342    6.764168    4.827353          1         19
-------------+---------------------------------------------------------
     married |    159,780     .355251    .4785908          0          1
 not_married |    159,780     .644749    .4785908          0          1
     partner |    159,780    .7240018    .4470173          0          1
  no_partner |    159,780    .2759982    .4470173          0          1
      single |    159,780    .3554888    .4786627          0          1
-------------+---------------------------------------------------------
 prim_school |    165,975    .6876457    .4634548          0          1
 high_school |    165,975    .1212894    .3264642          0          1
    anio_qtr |    165,975    187.9293    19.79064        156        223
    anio_sem |    165,975    93.71744    9.892564         78        111
recomm_pre~s |    164,447    .8005193    .3996112          0          1
-------------+---------------------------------------------------------
recomm_pre~t |    157,033    .4778168    .4995093          0          1
no_prenata~e |    164,447    .0325576    .1774762          0          1
first_preg~y |    165,286    .3384921    .4731982          0          1
 kids_before |    165,286    .6615079    .4731982          0          1
lowbirthwe~t |    165,051    .0615991    .2404268          0          1
-------------+---------------------------------------------------------
  apgar1_low |    163,852    .0351964    .1842765          0          1
  apgar2_low |    163,856    .0086661    .0926882          0          1
preg_preterm |    163,733    .0731068    .2603126          0          1
       young |    165,975    .7247357    .4466487          0          1
       adult |    165,975    .2752643    .4466487          0          1
-------------+---------------------------------------------------------
   age_group |    162,786    26.07216     6.26045         18         38
IS_impl_date |    165,975    17777.69    631.0345      16892      18414
     treated |    165,975    .6279741    .4833467          0          1
rel_t_anio~r |    165,975    230.0041    415.4681          0       1000
post_anio_~r |    165,975    .4066215    .4912045          0          1
-------------+---------------------------------------------------------
rel_t_anio~m |    165,975    225.4741    414.8475          0       1000
post_anio_~m |    165,975    .4186293    .4933359          0          1
  rel_t_anio |    165,975    147.6591    351.1947          0       1000
   post_anio |    165,975    .4239193    .4941793          0          1
public_hea~h |    165,975    .5029312    .4999929          0          1




(note: file ../output/main_vitals_panel.dta not found)
file ../output/main_vitals_panel.dta saved
(397,265 observations deleted)
(data already sorted by birth_id)
  variable public_health was float now byte
  (1,248,621 bytes saved)
===============================================================================
> ===================
File: ../output/main_vitals_panel_mvd.dta
Key: birth_id
===============================================================================
> ===================
  416207:34(101475):717096976:3601981273

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    birth_id |    416,207    423451.9    242920.6          6     834638
        anio |    416,207    2007.001    4.972277       1999       2015
       edadm |    416,207    27.44559    6.538166         16         45
        dpto |    416,207           1           0          1          1
dpto_resid~e |    415,610    1.989553    2.848992          1         19
-------------+---------------------------------------------------------
     married |    377,776    .3880342    .4873031          0          1
 not_married |    377,776    .6119658    .4873031          0          1
     partner |    377,776    .7902752    .4071127          0          1
  no_partner |    377,776    .2097248    .4071127          0          1
      single |    377,776    .3008185    .4586145          0          1
-------------+---------------------------------------------------------
 prim_school |    416,207    .5595365    .4964433          0          1
 high_school |    416,207    .1847614    .3881044          0          1
    anio_qtr |    416,207    189.5002     19.9193        156        223
    anio_sem |    416,207     94.5013    9.956513         78        111
recomm_pre~s |    410,226    .8046053    .3965047          0          1
-------------+---------------------------------------------------------
recomm_pre~t |    387,639    .5947673    .4909377          0          1
no_prenata~e |    410,226    .0450264    .2073623          0          1
first_preg~y |    412,677    .3870315    .4870715          0          1
 kids_before |    412,677    .6129685    .4870715          0          1
lowbirthwe~t |    414,113    .0962901    .2949891          0          1
-------------+---------------------------------------------------------
  apgar1_low |    412,715    .0552536    .2284749          0          1
  apgar2_low |    412,746    .0110383    .1044818          0          1
preg_preterm |    410,738    .1025593    .3033828          0          1
       young |    416,207    .6565795    .4748509          0          1
       adult |    416,207    .3434205    .4748509          0          1
-------------+---------------------------------------------------------
   age_group |    407,884    27.16144    6.325338         18         38
IS_impl_date |    416,207       16162           0      16162      16162
rel_t_anio~r |    416,207    504.6808     495.402          0       1000
post_anio_~r |    416,207    .6834147    .4651447          0          1
rel_t_anio~m |    416,207    502.6473    497.4097          0       1000
-------------+---------------------------------------------------------
post_anio_~m |    416,207    .6974222    .4593746          0          1
  rel_t_anio |    416,207    418.4349    490.7078          0       1000
   post_anio |    416,207    .6974222    .4593746          0          1
public_hea~h |    416,207     .342815    .4746508          0          1




(note: file ../output/main_vitals_panel_mvd.dta not found)
file ../output/main_vitals_panel_mvd.dta saved

. 
end of do-file

 make.py ended: 2020-03-22 08:33:05
