
 make.py started: 2020-03-07 17:36:47 C:\Users\dgentil1\Desktop\aborto_uru_repo\Aborto-Uruguay\derived\Time_panel\code 




Execute:  "C:\Program Files (x86)\Stata14\StataSE-64.exe" /e do "./create_time_panels.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401406206058
         Licensed to:  CIS Department
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./create_time_panels.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata14\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata14\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main 
  1.     create_year_panel
  2. end

. 
. program create_year_panel
  1.     use ../../ECH/output/main_ECH_panel.dta, clear
  2.     collapse (mean) share_women_public_health = public_health [aw = pesoan
> ], by(anio)
  3. 
.     merge 1:1 anio using ../../../base/Aggregate_Births/output/total_aggregat
> e_births.dta, ///
>         nogen keepusing(nat_level nat_rate population)
  4.     merge 1:1 anio using ../../../base/Mortality_Brazil/output/brasil_mm_d
> ata.dta, ///
>         nogen keepusing(mm_ratio ma_mm_ratio)
  5.     rename (mm_ratio ma_mm_ratio) (mm_ratio_brazil ma_mm_ratio_brazil)
  6.     merge 1:1 anio using ../../../base/Mortality_Uruguay/output/uruguay_mm
> _data.dta, ///
>         nogen keepusing(mm_ratio ma_mm_ratio)
  7.     merge 1:1 anio using ../../../base/Population/output/by_year_populatio
> n.dta, ///
>         nogen keepusing(women_pop fertile_women pop)
  8.     save_data ../output/year_panel.dta, key(anio) replace
  9. end

. 
. * EXECUTE
. main

    Result                           # of obs.
    -----------------------------------------
    not matched                             5
        from master                         0  
        from using                          5  

    matched                                15  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         0  
        from using                          1  

    matched                                20  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                            12
        from master                         1  
        from using                         11  

    matched                                20  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                            15
        from master                        11  
        from using                          4  

    matched                                21  
    -----------------------------------------
(data now sorted by anio)
  (0 bytes saved)
===============================================================================
> ===================
File: ../output/year_panel.dta
Key: anio
===============================================================================
> ===================
  36:12(94048):1245971717:1613908884

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        anio |         36      2002.5    10.53565       1985       2020
share_wome~h |         15    .4727022    .0776633    .355994   .5738567
   nat_level |         20     50287.1    3504.758      46712      58718
    nat_rate |         20    14.95363    1.241755   13.68795   18.02159
  population |         20     3366300    53666.75    3258203    3467054
-------------+---------------------------------------------------------
mm_ratio_b~l |         21    .0260007    .0019504   .0234586   .0314342
ma_mm_rati~l |         21    .0260923    .0011031   .0250474   .0282617
    mm_ratio |         31    .0140873    .0054469    .004896    .028083
 ma_mm_ratio |         31    .0139923    .0032246   .0085059   .0208528
         pop |         25     3394195     74761.3    3258203    3530912
-------------+---------------------------------------------------------
   women_pop |         25     1751327    39389.47    1675750    1819421
fertile_wo~p |         25    724458.6    16454.17   700596.4   751188.8




(note: file ../output/year_panel.dta not found)
file ../output/year_panel.dta saved

. 
end of do-file

 make.py ended: 2020-03-07 17:36:48
