
 make.py started: 2018-05-13 12:28:27 C:\Users\cravizza\GitHub\Aborto-Uruguay\derived\code 




Execute:  "C:\Program Files (x86)\Stata15\StataSE-64.exe" /e do "./homogeneize_geo_vars.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./homogeneize_geo_vars.do 

. clear all

. set more off

. adopath + ../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../library/stata/gslab_misc/ado"

. 
. program main_homogeneize_geo_vars 
  1.         use ..\..\base\output\clean_1998_2016, clear
  2.         
.         fix_98_05
  3.         fix_2007
  4.         fix_2008
  5.         save ../temp/98_2011_loc_homo.dta, replace
  6.         
.         import excel ../../raw/lista_homogen_codes_geo.xlsx, sheet("Sheet1") 
> ///
>             cellrange(B1:F100) firstrow clear
  7.         rename (codigodpto localidad codigo98_2005 codigo_2006_2011 codigo
> _2012_2014) ///
>             (dpto nomloc2 loc98_05 loc loc12_14)
  8.     save ../temp/loc_xwalk.dta, replace
  9.         
.     homogeneize_loc_to_2012_2014
 10.                 
.         drop if missing(anio)
 11.         
.         replace ccz = ccz04 if anio == 2012
 12.         drop ccz04 ccz10
 13.         
.         tostring dpto, gen(dpto_string)
 14.         gen loc_code = dpto_string + loc
 15.         drop dpto_string
 16.         drop if substr(loc_code, -3,.) == "900" 
 17.         
.         destring loc_code, replace
 18.                 
.         save ..\temp\clean_loc_1998_2016.dta, replace
 19. end

. 
. program fix_98_05
  1.     * Montevideo
.         replace loc = "010" if inrange(anio, 1998, 2005) & loc == "0101"
  2. 
.         * Artigas
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0201"
  3.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "0202"
  4.         
.         * Canelones
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0302"
  5.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "0301"
  6.         replace loc = "023" if inrange(anio, 1998, 2005) & loc == "0303"  
>       
  7.         replace loc = "024" if inrange(anio, 1998, 2005) & loc == "0304"
  8.         replace loc = "422" if inrange(anio, 1998, 2005) & loc == "0305"
  9.         
.         * Cerro Largo
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0401"
 10.         replace loc = "522" if inrange(anio, 1998, 2005) & loc == "0402"
 11. 
.     * Colonia
.         replace loc = "320" if inrange(anio, 1998, 2005) & loc == "0501"
 12.         replace loc = "321" if inrange(anio, 1998, 2005) & loc == "0502"
 13.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "0503"  
>       
 14.         replace loc = "022" if inrange(anio, 1998, 2005) & loc == "0504"
 15.         replace loc = "023" if inrange(anio, 1998, 2005) & loc == "0505"
 16. 
.         * Durazno
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0601"
 17.         replace loc = "421" if inrange(anio, 1998, 2005) & loc == "0602"
 18. 
.         * Flores
.         replace loc = "320" if inrange(anio, 1998, 2005) & loc == "0701"
 19. 
.         * Florida
.         replace loc = "220" if inrange(anio, 1998, 2005) & loc == "0801"
 20.         replace loc = "421" if inrange(anio, 1998, 2005) & loc == "0802"
 21. 
.         * Lavalleja
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0901"
 22.         replace loc = "522" if inrange(anio, 1998, 2005) & loc == "0902"
 23. 
.     * Maldonado
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1001"
 24.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "1002"
 25.         replace loc = "022" if inrange(anio, 1998, 2005) & loc == "1003"  
>       
 26.         replace loc = "023" if inrange(anio, 1998, 2005) & loc == "1004"
 27.         replace loc = "024" if inrange(anio, 1998, 2005) & loc == "1005"
 28. 
.         * Paysandu
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1101"
 29.         replace loc = "521" if inrange(anio, 1998, 2005) & loc == "1102"
 30. 
.         * Rio Negro
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1201"
 31.         replace loc = "421" if inrange(anio, 1998, 2005) & loc == "1202"
 32.         
.     *Rivera
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1301"
 33.         replace loc = "522" if inrange(anio, 1998, 2005) & loc == "1302"
 34.         
.     *Rocha
.         replace loc = "320" if inrange(anio, 1998, 2005) & loc == "1401"
 35.         replace loc = "422" if inrange(anio, 1998, 2005) & loc == "1403"
 36.         replace loc = "521" if inrange(anio, 1998, 2005) & loc == "1404"
 37.         
.         * Salto
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1501"
 38. 
.     *San Jose
.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "1601"
 39.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1602"
 40.         replace loc = "022" if inrange(anio, 1998, 2005) & loc == "1603"
 41. 
.     *Soriano
.         replace loc = "220" if inrange(anio, 1998, 2005) & loc == "1701"
 42.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "1702"
 43. 
.     *Tacuarembo
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1801"
 44.         replace loc = "321" if inrange(anio, 1998, 2005) & loc == "1802"
 45. 
.     *Treinta y Tres
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1901"
 46. end

. 
. program fix_2007        
  1.     replace loc = substr(loc, 3, 3) if anio == 2007
  2.         
.         * Montevideo
.         replace loc = "010" if anio == 2007 & loc == "020" & dpto == 1
  3. 
.         * Artigas
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 2
  4.         replace loc = "021" if anio == 2007 & loc == "621" & dpto == 2
  5.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 2
  6. 
.         * Canelones
.         replace loc = "020" if anio == 2007 & loc == "121" & dpto == 3
  7.         replace loc = "022" if anio == 2007 & loc == "222" & dpto == 3
  8.         replace loc = "023" if anio == 2007 & loc == "323" & dpto == 3
  9.         replace loc = "000" if anio == 2007 & loc == "528" & dpto == 3
 10.         
.         * Cerro Largo
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 4
 11.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 4
 12. 
.     * Colonia
.         replace loc = "021" if anio == 2007 & loc == "421" & dpto == 5
 13.         replace loc = "023" if anio == 2007 & loc == "323" & dpto == 5
 14.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 5
 15.         
.         * Durazno
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 6
 16.         replace loc = "000" if anio == 2007 & loc == "721" & dpto == 6
 17. 
.         * Flores
.         replace loc = "000" if anio == 2007 & loc == "721" & dpto == 7
 18. 
.         * Florida
.         replace loc = "000" if anio == 2007 & loc == "622" & dpto == 8
 19. 
.         * Lavalleja
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 9
 20.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 9
 21. 
.     * Maldonado
.         replace loc = "020" if anio == 2007 & loc == "320" & dpto == 10
 22.         replace loc = "021" if anio == 2007 & loc == "321" & dpto == 10
 23.         replace loc = "023" if anio == 2007 & loc == "523" & dpto == 10
 24.         replace loc = "024" if anio == 2007 & loc == "524" & dpto == 10
 25.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 10
 26. 
.         * Paysandu
.         replace loc = "020" if anio == 2007 & loc == "120" & dpto == 11
 27.         replace loc = "021" if anio == 2007 & loc == "822" & dpto == 11
 28.         replace loc = "000" if anio == 2007 & loc == "621" & dpto == 11
 29.         
.         * Rio Negro
.         replace loc = "020" if anio == 2007 & loc == "320" & dpto == 12
 30.         replace loc = "000" if anio == 2007 & loc == "621" & dpto == 12
 31.         
.     *Rivera
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 13
 32.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 13
 33.         
.     *Rocha
.         replace loc = "000" if anio == 2007 & loc == "722" & dpto == 14
 34.         
.         * Salto
.         replace loc = "020" if anio == 2007 & loc == "120" & dpto == 15
 35.         replace loc = "000" if anio == 2007 & loc == "522" & dpto == 15
 36. 
.     *San Jose
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 16
 37.         replace loc = "021" if anio == 2007 & loc == "321" & dpto == 16
 38.         replace loc = "022" if anio == 2007 & loc == "421" & dpto == 16
 39.         replace loc = "000" if anio == 2007 & loc == "621" & dpto == 16
 40. 
.     *Soriano
.         replace loc = "021" if anio == 2007 & loc == "321" & dpto == 17
 41.         replace loc = "091" if anio == 2007 & loc == "521" & dpto == 17
 42.         replace loc = "000" if anio == 2007 & loc == "622" & dpto == 17
 43. 
.     *Tacuarembo
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 18
 44.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 18
 45.         
.     *Treinta y Tres
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 19
 46.         replace loc = "000" if anio == 2007 & loc == "790" & dpto == 19
 47.         
.         fill_missing_loc, dest_year(2007) ren_var(nomloc)
 48.         
.         merge m:1 anio dpto loc using ../temp/loc_2006.dta, nogen
 49.         
.         replace nomloc = nomloc2 if anio == 2007
 50.         drop nomloc2
 51. end

. 
. program fix_2008
  1.         fill_missing_loc, dest_year(2008) ren_var(loc)
  2.         
.         merge m:1 anio dpto nomloc using ../temp/loc_2006, nogen
  3.         
.         replace loc = loc2 if anio == 2008
  4.         drop loc2
  5. end

. 
. program fill_missing_loc
  1.     syntax, dest_year(str) ren_var(str)
  2.     
.         preserve 
  3.         keep if anio == 2006
  4.         keep anio dpto loc nomloc
  5.         duplicates drop anio dpto loc, force
  6.         replace anio = `dest_year'
  7.         rename `ren_var' `ren_var'2
  8.         save ../temp/loc_2006, replace
  9.         restore
 10. end

. 
. program homogeneize_loc_to_2012_2014
  1.         use ../temp/98_2011_loc_homo.dta, clear
  2.         
.         merge m:1 dpto loc using ../temp/loc_xwalk.dta
  3.         
.         replace loc = "000" if missing(loc)
  4.         
.         replace loc = loc12_14 if _merge == 3
  5.         replace nomloc = nomloc2
  6.         
.         drop _merge nomloc2 loc12_14 loc98_05
  7.         
.         replace loc = "000" if length(loc) < 5
  8.     
.     merge m:1 dpto loc using ../temp/loc_xwalk.dta
  9.     
.         replace loc = loc12_14 if _merge == 3
 10.         replace nomloc = nomloc2
 11.         
.         drop _merge nomloc2 loc12_14 loc98_05
 12. end

. 
. main_homogeneize_geo_vars
(238,595 real changes made)
(7,863 real changes made)
(3,840 real changes made)
(12,718 real changes made)
(30,695 real changes made)
(6,467 real changes made)
(3,652 real changes made)
(1,126 real changes made)
(6,487 real changes made)
(2,709 real changes made)
(5,940 real changes made)
(2,568 real changes made)
(680 real changes made)
(431 real changes made)
(2,116 real changes made)
(4,603 real changes made)
(1,235 real changes made)
(4,025 real changes made)
(3,824 real changes made)
(1,478 real changes made)
(6,127 real changes made)
(221 real changes made)
(10,192 real changes made)
(4,344 real changes made)
(1,535 real changes made)
(333 real changes made)
(167 real changes made)
(11,982 real changes made)
(173 real changes made)
(3,605 real changes made)
(2,718 real changes made)
(11,257 real changes made)
(1,302 real changes made)
(7,098 real changes made)
(1,330 real changes made)
(205 real changes made)
(12,609 real changes made)
(5,481 real changes made)
(3,786 real changes made)
(1,649 real changes made)
(6,279 real changes made)
(2,877 real changes made)
(7,321 real changes made)
(1,842 real changes made)
(5,415 real changes made)
(143,185 real changes made)
(57,520 real changes made)
(1,190 real changes made)
(452 real changes made)
(1,293 real changes made)
(3,155 real changes made)
(1,816 real changes made)
(1,171 real changes made)
(999 real changes made)
(1,982 real changes made)
(651 real changes made)
(774 real changes made)
(767 real changes made)
(620 real changes made)
(1,861 real changes made)
(555 real changes made)
(212 real changes made)
(688 real changes made)
(2,024 real changes made)
(272 real changes made)
(2,508 real changes made)
(999 real changes made)
(310 real changes made)
(437 real changes made)
(380 real changes made)
(3,344 real changes made)
(9 real changes made)
(553 real changes made)
(1,295 real changes made)
(486 real changes made)
(3,037 real changes made)
(462 real changes made)
(651 real changes made)
(3,667 real changes made)
(576 real changes made)
(3,077 real changes made)
(1,853 real changes made)
(778 real changes made)
(482 real changes made)
(776 real changes made)
(242 real changes made)
(408 real changes made)
(2,404 real changes made)
(416 real changes made)
(1,777 real changes made)
(250 real changes made)
(1,755,020 observations deleted)

Duplicates in terms of anio dpto loc

(256,765 observations deleted)
(96 real changes made)
(note: file ../temp/loc_2006.dta not found)
file ../temp/loc_2006.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,870,334
        from master                 1,870,319  
        from using                         15  

    matched                           141,562  
    -----------------------------------------
(141,577 real changes made)
(1,755,035 observations deleted)

Duplicates in terms of anio dpto loc

(256,765 observations deleted)
(96 real changes made)
file ../temp/loc_2006.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,867,335
        from master                 1,867,320  
        from using                         15  

    matched                           144,576  
    -----------------------------------------
(144,591 real changes made)
(note: file ../temp/98_2011_loc_homo.dta not found)
file ../temp/98_2011_loc_homo.dta saved
(note: file ../temp/loc_xwalk.dta not found)
file ../temp/loc_xwalk.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       383,151
        from master                   383,151  (_merge==1)
        from using                          0  (_merge==2)

    matched                         1,628,760  (_merge==3)
    -----------------------------------------
(358 real changes made)
(1,628,760 real changes made)
(838,922 real changes made)
(2,549 real changes made)

    Result                           # of obs.
    -----------------------------------------
    not matched                     2,009,090
        from master                 2,009,004  (_merge==1)
        from using                         86  (_merge==2)

    matched                             2,907  (_merge==3)
    -----------------------------------------
(2,907 real changes made)
(1,631,753 real changes made)
(86 observations deleted)
(120,462 real changes made)
dpto_string generated as str2
(128,522 observations deleted)
loc_code: all characters numeric; replaced as long
(note: file ..\temp\clean_loc_1998_2016.dta not found)
file ..\temp\clean_loc_1998_2016.dta saved

. 
end of do-file


Execute:  "C:\Program Files (x86)\Stata15\StataSE-64.exe" /e do "./prepare_for_analysis.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./prepare_for_analysis.do 

. clear all

. set more off

. adopath + ../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../library/stata/gslab_misc/ado"

. 
. program main_prepare_for_analysis 
  1.         use ..\temp\clean_loc_1998_2016.dta, clear
  2.         
.         fix_2012_weights
  3.         save ..\temp\clean_loc_1998_2016_fixed_weights.dta, replace
  4.         
.         import excel ..\..\raw\inflation.xlsx, sheet("Sheet1") firstrow clear
  5.         merge 1:m anio using ..\temp\clean_loc_1998_2016_fixed_weights.dta
> , nogen ///
>             assert(1 3)keep(3)
  6.         save ..\temp\clean_loc_1998_2016_fixed.dta, replace
  7. 
.     impute_poverty_lines_pre06
  8.         gen poor       = (y_hogar_alt <= lp_06)
  9.         gen indigente   = (y_hogar_alt <= li_06)
 10.         
.         gen ind_under14 = (nbr_under14>0)
 11.         
.         gen     semestre = 1 if inlist(trimestre, 1, 2)
 12.         replace semestre = 2 if inlist(trimestre, 3, 4)
 13.         gen     anio_sem = yh(anio, semestre)
 14.         format  anio_sem %th
 15.         gen     anio_qtr = yq(anio, trimestre)
 16.     format  anio_qtr %tq
 17. 
.         local outcomes = "trabajo horas_trabajo"
 18.         deseasonalize, outcomes(`outcomes')
 19.          
.         label_vars
 20.         drop if (missing(numero) | missing(pers) | missing(anio))
 21.     save_data ..\output\clean_loc_1998_2016.dta, key(numero pers anio) rep
> lace  
 22. end

. 
. program fix_2012_weights
  1.         keep if anio == 2013
  2.         replace anio = 2012 
  3.         
.         local by_vars "loc_code edad hombre estrato"
  4.         
.         rename (pesotri pesosem) (pesotri2 pesosem2)
  5.         collapse (mean) pesotri pesosem, by(`by_vars')
  6.         
.         save ..\temp\pesos_2012_imputed.dta, replace
  7. 
.         use ..\temp\clean_loc_1998_2016.dta, clear
  8. 
.         merge m:1 `by_vars' using ..\temp\pesos_2012_imputed.dta, nogen
  9.         replace pesotri = pesotri2 if anio == 2012
 10.         replace pesosem = pesosem2 if anio == 2012
 11.         
.         drop pesotri2 pesosem2
 12. end

. 
. program impute_poverty_lines_pre06
  1.         keep if anio == 2006
  2.         
.         forval year=1998/2005 {
  3.             replace anio = `year' 
  4.         
.             local by_vars " trimestre loc_code nbr_above14 nbr_people"
  5.         
.             rename (lp_06 li_06) (lp_06_2 li_06_2)
  6.             collapse (mean) lp_06_2 li_06_2, by(`by_vars')
  7.         
.             save ..\temp\poverty_`year'_imputed.dta, replace
  8. 
.             use ..\temp\clean_loc_1998_2016_fixed.dta, clear
  9. 
.             merge m:1 `by_vars' using ..\temp\poverty_`year'_imputed.dta, nog
> en
 10.             replace lp_06 = lp_06_2 if anio == `year'
 11.             replace li_06 = li_06_2 if anio == `year'
 12.         
.             drop lp_06_2 li_06_2
 13.                 replace lp_06 = (lp_06 * cpi_2006)/100 if anio == `year'
 14.                 replace li_06 = (li_06 * cpi_2006)/100 if anio == `year'
 15.             save ..\temp\clean_loc_1998_2016_fixed.dta, replace
 16.         }
 17. end

. 
. program deseasonalize  
  1.     syntax, outcomes(str)
  2.         
.         levelsof dpto, local(dptos)
  3.         
.         foreach outcome in `outcomes' {
  4.                 gen `outcome'_des = `outcome'
  5.         }
  6.         
.         foreach dpto of local dptos {
  7.                 foreach outcome in `outcomes' {
  8. 
.                         qui sum `outcome' if anio < 2004 & dpto == `dpto' [aw
>  = pesotri]
  9.                         local mean = r(mean)
 10.                         
.                         reg `outcome' i.trimestre if anio < 2004 & dpto == `d
> pto' [aw = pesotri]
 11.                         predict p_`outcome', resid
 12.                         
.                         replace `outcome'_des = p_`outcome' + `mean' if anio 
> < 2004 & dpto == `dpto'
 13.                         drop p_`outcome'
 14.                         
.                         qui sum `outcome' if anio >= 2004 & dpto == `dpto' [a
> w = pesotri]
 15.                         local mean = r(mean)
 16.                         
.                         reg `outcome' i.trimestre if anio >= 2004 & dpto == `
> dpto' [aw = pesotri]
 17.                         predict p_`outcome', resid
 18.                         
.                         replace `outcome'_des = p_`outcome' + `mean' if anio 
> >= 2004 & dpto == `dpto'
 19.                         drop p_`outcome'        
 20.                 }
 21.         }
 22. end

. 
. program label_vars
  1.     label var trabajo "Employment"
  2.         label var horas_trabajo "Hours worked"
  3.         label var  educ_level "Educational attainment"
  4.         label define educ_level 1 "Primary school" 2 "High school" 3 "Post
> -secondary"
  5.         label values educ_level educ_level
  6.     
.         gen educ_more_HS = (educ_level == 3)
  7.         gen educ_HS_or_more = (educ_level == 2 | educ_level == 3 )
  8.         
.         label var  educ_more_HS "College"
  9.         label var educ_HS_or_more "High-school"
 10.         label define educ_HS_or_more 0 "HS degree or less" 1 "More than HS
>  diploma"
 11.         label values educ_HS_or_more educ_HS_or_more
 12. end

. 
. main_prepare_for_analysis
(1,761,666 observations deleted)
(121,723 real changes made)
(note: file ..\temp\pesos_2012_imputed.dta not found)
file ..\temp\pesos_2012_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       513,489
        from master                   513,489  
        from using                          0  

    matched                         1,369,900  
    -----------------------------------------
variable pesotri was int now float
(113,170 real changes made)
variable pesosem was int now float
(113,170 real changes made)
(note: file ..\temp\clean_loc_1998_2016_fixed_weights.dta not found)
file ..\temp\clean_loc_1998_2016_fixed_weights.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(note: file ..\temp\clean_loc_1998_2016_fixed.dta not found)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,673,485 observations deleted)
(209,904 real changes made)
(note: file ..\temp\poverty_1998_imputed.dta not found)
file ..\temp\poverty_1998_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        73,548
        from master                    73,548  
        from using                          0  

    matched                         1,809,841  
    -----------------------------------------
(53,822 real changes made)
variable li_06 was int now float
(53,822 real changes made)
(53,822 real changes made)
(53,822 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,825,715 real changes made)
(note: file ..\temp\poverty_1999_imputed.dta not found)
file ..\temp\poverty_1999_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(56,882 real changes made)
(56,882 real changes made)
(56,882 real changes made)
(56,882 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,825,405 real changes made)
(note: file ..\temp\poverty_2000_imputed.dta not found)
file ..\temp\poverty_2000_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(57,119 real changes made)
(57,119 real changes made)
(57,119 real changes made)
(57,119 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,825,979 real changes made)
(note: file ..\temp\poverty_2001_imputed.dta not found)
file ..\temp\poverty_2001_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(56,694 real changes made)
(56,694 real changes made)
(56,694 real changes made)
(56,694 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,827,056 real changes made)
(note: file ..\temp\poverty_2002_imputed.dta not found)
file ..\temp\poverty_2002_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(55,626 real changes made)
(55,626 real changes made)
(55,626 real changes made)
(55,626 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,828,020 real changes made)
(note: file ..\temp\poverty_2003_imputed.dta not found)
file ..\temp\poverty_2003_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(54,650 real changes made)
(54,650 real changes made)
(54,650 real changes made)
(54,650 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,827,802 real changes made)
(note: file ..\temp\poverty_2004_imputed.dta not found)
file ..\temp\poverty_2004_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(54,842 real changes made)
(54,842 real changes made)
(54,842 real changes made)
(54,842 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,829,059 real changes made)
(note: file ..\temp\poverty_2005_imputed.dta not found)
file ..\temp\poverty_2005_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(53,665 real changes made)
(53,665 real changes made)
(53,665 real changes made)
(53,665 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(940,066 missing values generated)
(940,036 real changes made)
(30 missing values generated)
(30 missing values generated)
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19
(30 missing values generated)
(30 missing values generated)
(sum of wgt is   2.9276e+07)

      Source |       SS           df       MS      Number of obs   =   179,252
-------------+----------------------------------   F(3, 179248)    =      1.09
       Model |  .802419401         3  .267473134   Prob > F        =    0.3502
    Residual |  43827.9015   179,248   .24450985   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |   43828.704   179,251  .244510234   Root MSE        =    .49448

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0048759   .0032963    -1.48   0.139    -.0113367    .0015848
          3  |  -.0046295   .0033006    -1.40   0.161    -.0110986    .0018397
          4  |  -.0050998   .0033097    -1.54   0.123    -.0115867    .0013872
             |
       _cons |   .4295459   .0023333   184.09   0.000     .4249726    .4341191
------------------------------------------------------------------------------
(30 missing values generated)
(179,252 real changes made)
(sum of wgt is   6.6643e+07)

      Source |       SS           df       MS      Number of obs   =   649,585
-------------+----------------------------------   F(3, 649581)    =      7.45
       Model |  5.58047713         3  1.86015904   Prob > F        =    0.0001
    Residual |  162194.233   649,581  .249690544   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  162199.814   649,584  .249697982   Root MSE        =    .49969

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0013768   .0017525     0.79   0.432     -.002058    .0048116
          3  |   .0037798   .0017521     2.16   0.031     .0003457    .0072139
          4  |   .0077318    .001755     4.41   0.000     .0042922    .0111715
             |
       _cons |   .4793946   .0012391   386.89   0.000      .476966    .4818232
------------------------------------------------------------------------------
(30 missing values generated)
(649,604 real changes made)
(sum of wgt is   2.9276e+07)

      Source |       SS           df       MS      Number of obs   =   179,252
-------------+----------------------------------   F(3, 179248)    =      4.23
       Model |  7130.91843         3  2376.97281   Prob > F        =    0.0053
    Residual |   100674271   179,248  561.647946   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |   100681402   179,251  561.678328   Root MSE        =    23.699

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.3634611   .1579851    -2.30   0.021    -.6731083   -.0538139
          3  |  -.4656077   .1581911    -2.94   0.003    -.7756587   -.1555567
          4  |  -.5054691   .1586262    -3.19   0.001    -.8163729   -.1945653
             |
       _cons |   18.30483   .1118294   163.69   0.000     18.08564    18.52401
------------------------------------------------------------------------------
(30 missing values generated)
(179,252 real changes made)
(sum of wgt is   6.6643e+07)

      Source |       SS           df       MS      Number of obs   =   649,585
-------------+----------------------------------   F(3, 649581)    =      6.85
       Model |  11184.1998         3   3728.0666   Prob > F        =    0.0001
    Residual |   353371068   649,581  543.998467   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |   353382252   649,584  544.013172   Root MSE        =    23.324

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.1498378   .0817991    -1.83   0.067    -.3101614    .0104858
          3  |  -.0601844   .0817832    -0.74   0.462    -.2204767     .100108
          4  |   .2072685    .081915     2.53   0.011     .0467178    .3678191
             |
       _cons |   19.67722   .0578371   340.22   0.000     19.56386    19.79058
------------------------------------------------------------------------------
(30 missing values generated)
(649,604 real changes made)
(sum of wgt is   1.3020e+06)

      Source |       SS           df       MS      Number of obs   =     8,878
-------------+----------------------------------   F(3, 8874)      =      1.61
       Model |  1.10923435         3  .369744784   Prob > F        =    0.1845
    Residual |  2036.46072     8,874   .22948622   R-squared       =    0.0005
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |  2037.56995     8,877  .229533621   Root MSE        =    .47905

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0171078   .0143721     1.19   0.234    -.0110649    .0452804
          3  |   .0273742   .0143453     1.91   0.056    -.0007458    .0554942
          4  |   .0269789   .0142735     1.89   0.059    -.0010005    .0549584
             |
       _cons |   .3390854   .0100596    33.71   0.000     .3193663    .3588045
------------------------------------------------------------------------------
(30 missing values generated)
(8,878 real changes made)
(sum of wgt is   3.5873e+06)

      Source |       SS           df       MS      Number of obs   =    36,447
-------------+----------------------------------   F(3, 36443)     =      3.75
       Model |  2.72005567         3  .906685225   Prob > F        =    0.0105
    Residual |  8818.17262    36,443  .241971644   R-squared       =    0.0003
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |  8820.89268    36,446  .242026359   Root MSE        =    .49191

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0092665   .0072419     1.28   0.201    -.0049278    .0234608
          3  |   .0075937   .0072489     1.05   0.295    -.0066143    .0218017
          4  |   .0237833    .007233     3.29   0.001     .0096063    .0379603
             |
       _cons |   .4006276    .005051    79.32   0.000     .3907275    .4105278
------------------------------------------------------------------------------
(30 missing values generated)
(36,502 real changes made)
(sum of wgt is   1.3020e+06)

      Source |       SS           df       MS      Number of obs   =     8,878
-------------+----------------------------------   F(3, 8874)      =      1.36
       Model |  2311.24072         3  770.413573   Prob > F        =    0.2528
    Residual |  5023855.77     8,874  566.132045   R-squared       =    0.0005
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |  5026167.01     8,877  566.201083   Root MSE        =    23.794

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .3389603   .7138402     0.47   0.635    -1.060332    1.738252
          3  |    1.29413   .7125071     1.82   0.069    -.1025487    2.690809
          4  |   .9720213   .7089444     1.37   0.170    -.4176738    2.361716
             |
       _cons |   14.89275   .4996444    29.81   0.000     13.91333    15.87217
------------------------------------------------------------------------------
(30 missing values generated)
(8,878 real changes made)
(sum of wgt is   3.5873e+06)

      Source |       SS           df       MS      Number of obs   =    36,447
-------------+----------------------------------   F(3, 36443)     =      2.37
       Model |  3872.22627         3  1290.74209   Prob > F        =    0.0686
    Residual |  19858172.1    36,443  544.910464   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |  19862044.3    36,446  544.971856   Root MSE        =    23.343

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0902214   .3436624     0.26   0.793    -.5833668    .7638096
          3  |  -.1239101   .3439945    -0.36   0.719    -.7981493    .5503291
          4  |   .7237141   .3432428     2.11   0.035     .0509483     1.39648
             |
       _cons |    16.5182   .2396949    68.91   0.000     16.04839    16.98801
------------------------------------------------------------------------------
(30 missing values generated)
(36,502 real changes made)
(sum of wgt is   7.0634e+06)

      Source |       SS           df       MS      Number of obs   =    42,905
-------------+----------------------------------   F(3, 42901)     =      3.34
       Model |    2.404222         3  .801407335   Prob > F        =    0.0183
    Residual |  10281.0033    42,901  .239644841   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |  10283.4075    42,904  .239684121   Root MSE        =    .48954

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0119688    .006667    -1.80   0.073    -.0250362    .0010986
          3  |  -.0177641   .0066584    -2.67   0.008    -.0308147   -.0047135
          4  |  -.0187176   .0066767    -2.80   0.005    -.0318041   -.0056311
             |
       _cons |   .4104523   .0046896    87.52   0.000     .4012605     .419644
------------------------------------------------------------------------------
(30 missing values generated)
(42,905 real changes made)
(sum of wgt is   2.1985e+07)

      Source |       SS           df       MS      Number of obs   =   197,944
-------------+----------------------------------   F(3, 197940)    =      2.99
       Model |  2.22278604         3  .740928681   Prob > F        =    0.0298
    Residual |  49074.2931   197,940  .247925094   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  49076.5159   197,943  .247932566   Root MSE        =    .49792

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0050748   .0031612     1.61   0.108     -.001121    .0112706
          3  |    .003678    .003166     1.16   0.245    -.0025272    .0098832
          4  |    .009361   .0031638     2.96   0.003     .0031599    .0155621
             |
       _cons |   .4499931   .0022345   201.38   0.000     .4456135    .4543727
------------------------------------------------------------------------------
(30 missing values generated)
(198,008 real changes made)
(sum of wgt is   7.0634e+06)

      Source |       SS           df       MS      Number of obs   =    42,905
-------------+----------------------------------   F(3, 42901)     =      5.88
       Model |  10323.8448         3  3441.28161   Prob > F        =    0.0005
    Residual |  25095083.1    42,901  584.953336   R-squared       =    0.0004
-------------+----------------------------------   Adj R-squared   =    0.0003
       Total |  25105406.9    42,904  585.153061   Root MSE        =    24.186

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.7305741   .3293863    -2.22   0.027    -1.376178   -.0849707
          3  |  -1.158851   .3289623    -3.52   0.000    -1.803624   -.5140787
          4  |  -1.228022   .3298676    -3.72   0.000    -1.874569   -.5814752
             |
       _cons |    18.1834   .2316935    78.48   0.000     17.72928    18.63752
------------------------------------------------------------------------------
(30 missing values generated)
(42,905 real changes made)
(sum of wgt is   2.1985e+07)

      Source |       SS           df       MS      Number of obs   =   197,944
-------------+----------------------------------   F(3, 197940)    =      2.18
       Model |  3554.20009         3  1184.73336   Prob > F        =    0.0886
    Residual |   107778259   197,940  544.499642   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |   107781813   197,943  544.509345   Root MSE        =    23.335

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0403339   .1481445    -0.27   0.785    -.3306936    .2500258
          3  |  -.1807144   .1483699    -1.22   0.223    -.4715158     .110087
          4  |   .1946478   .1482701     1.31   0.189    -.0959581    .4852536
             |
       _cons |   18.56688   .1047178   177.30   0.000     18.36164    18.77213
------------------------------------------------------------------------------
(30 missing values generated)
(198,008 real changes made)
(sum of wgt is   1.3927e+06)

      Source |       SS           df       MS      Number of obs   =     6,911
-------------+----------------------------------   F(3, 6907)      =      1.08
       Model |  .769994854         3  .256664951   Prob > F        =    0.3549
    Residual |  1637.07917     6,907  .237017398   R-squared       =    0.0005
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  1637.84917     6,910  .237025928   Root MSE        =    .48684

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0294847   .0167621    -1.76   0.079    -.0623435    .0033741
          3  |  -.0143827   .0167352    -0.86   0.390    -.0471889    .0184234
          4  |  -.0095184   .0164978    -0.58   0.564    -.0418592    .0228224
             |
       _cons |   .3992986   .0119147    33.51   0.000     .3759422     .422655
------------------------------------------------------------------------------
(30 missing values generated)
(6,911 real changes made)
(sum of wgt is   3.8220e+06)

      Source |       SS           df       MS      Number of obs   =    38,011
-------------+----------------------------------   F(3, 38007)     =      0.74
       Model |  .533505963         3  .177835321   Prob > F        =    0.5304
    Residual |  9184.15733    38,007  .241643837   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |  9184.69083    38,010  .241638801   Root MSE        =    .49157

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0027079   .0071248     0.38   0.704     -.011257    .0166727
          3  |   .0100831   .0071585     1.41   0.159    -.0039478    .0241139
          4  |   .0058898   .0071495     0.82   0.410    -.0081234    .0199031
             |
       _cons |   .4038563   .0050695    79.66   0.000       .39392    .4137926
------------------------------------------------------------------------------
(30 missing values generated)
(38,097 real changes made)
(sum of wgt is   1.3927e+06)

      Source |       SS           df       MS      Number of obs   =     6,911
-------------+----------------------------------   F(3, 6907)      =      2.40
       Model |   4377.1071         3   1459.0357   Prob > F        =    0.0657
    Residual |  4195088.92     6,907  607.367731   R-squared       =    0.0010
-------------+----------------------------------   Adj R-squared   =    0.0006
       Total |  4199466.03     6,910  607.737486   Root MSE        =    24.645

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -1.900443   .8485225    -2.24   0.025    -3.563808   -.2370779
          3  |  -1.546193   .8471625    -1.83   0.068    -3.206892    .1145064
          4  |  -.3205574   .8351459    -0.38   0.701      -1.9577    1.316585
             |
       _cons |   17.99585   .6031387    29.84   0.000     16.81351    19.17819
------------------------------------------------------------------------------
(30 missing values generated)
(6,911 real changes made)
(sum of wgt is   3.8220e+06)

      Source |       SS           df       MS      Number of obs   =    38,011
-------------+----------------------------------   F(3, 38007)     =      0.16
       Model |  229.551375         3  76.5171249   Prob > F        =    0.9202
    Residual |  17667236.4    38,007  464.841646   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0001
       Total |    17667466    38,010  464.810997   Root MSE        =     21.56

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.1693513   .3124921    -0.54   0.588    -.7818441    .4431415
          3  |  -.1216548   .3139692    -0.39   0.698    -.7370428    .4937331
          4  |  -.2067657   .3135744    -0.66   0.510    -.8213797    .4078484
             |
       _cons |   15.94978   .2223443    71.73   0.000     15.51398    16.38558
------------------------------------------------------------------------------
(30 missing values generated)
(38,097 real changes made)
(sum of wgt is   1.9386e+06)

      Source |       SS           df       MS      Number of obs   =     8,862
-------------+----------------------------------   F(3, 8858)      =      0.39
       Model |   .27761295         3   .09253765   Prob > F        =    0.7568
    Residual |  2076.50724     8,858   .23442168   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  2076.78486     8,861  .234373644   Root MSE        =    .48417

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |    .001339   .0145916     0.09   0.927    -.0272639     .029942
          3  |  -.0113973   .0144525    -0.79   0.430    -.0397275    .0169329
          4  |   .0025257   .0145496     0.17   0.862    -.0259949    .0310463
             |
       _cons |   .3768383   .0102506    36.76   0.000     .3567446    .3969319
------------------------------------------------------------------------------
(30 missing values generated)
(8,862 real changes made)
(sum of wgt is   5.1351e+06)

      Source |       SS           df       MS      Number of obs   =    50,217
-------------+----------------------------------   F(3, 50213)     =      1.01
       Model |  .753861738         3  .251287246   Prob > F        =    0.3866
    Residual |  12481.7527    50,213  .248576119   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  12482.5065    50,216  .248576281   Root MSE        =    .49857

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0100952   .0063041     1.60   0.109     -.002261    .0224514
          3  |   .0057718   .0062593     0.92   0.356    -.0064965    .0180402
          4  |   .0085258   .0061992     1.38   0.169    -.0036248    .0206764
             |
       _cons |   .4561954   .0043627   104.57   0.000     .4476444    .4647463
------------------------------------------------------------------------------
(30 missing values generated)
(50,302 real changes made)
(sum of wgt is   1.9386e+06)

      Source |       SS           df       MS      Number of obs   =     8,862
-------------+----------------------------------   F(3, 8858)      =      1.23
       Model |  2032.13901         3  677.379671   Prob > F        =    0.2983
    Residual |  4892682.18     8,858  552.346148   R-squared       =    0.0004
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |  4894714.31     8,861  552.388479   Root MSE        =    23.502

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .1256348   .7082878     0.18   0.859    -1.262773    1.514043
          3  |  -1.099083   .7015341    -1.57   0.117    -2.474252    .2760867
          4  |  -.2961377   .7062483    -0.42   0.675    -1.680548    1.088273
             |
       _cons |   16.24478   .4975743    32.65   0.000     15.26942    17.22014
------------------------------------------------------------------------------
(30 missing values generated)
(8,862 real changes made)
(sum of wgt is   5.1351e+06)

      Source |       SS           df       MS      Number of obs   =    50,217
-------------+----------------------------------   F(3, 50213)     =      0.91
       Model |  1492.76573         3  497.588577   Prob > F        =    0.4362
    Residual |  27518222.7    50,213  548.029846   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |  27519715.4    50,216  548.026833   Root MSE        =     23.41

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .3245857   .2960042     1.10   0.273    -.2555858    .9047572
          3  |  -.1085784   .2939003    -0.37   0.712    -.6846262    .4674694
          4  |   .2325707   .2910794     0.80   0.424    -.3379483    .8030896
             |
       _cons |   19.09244    .204846    93.20   0.000     18.69094    19.49394
------------------------------------------------------------------------------
(30 missing values generated)
(50,302 real changes made)
(sum of wgt is   8.7270e+05)

      Source |       SS           df       MS      Number of obs   =     4,507
-------------+----------------------------------   F(3, 4503)      =      0.38
       Model |  .262091694         3  .087363898   Prob > F        =    0.7664
    Residual |   1031.4683     4,503   .22906247   R-squared       =    0.0003
-------------+----------------------------------   Adj R-squared   =   -0.0004
       Total |   1031.7304     4,506   .22896813   Root MSE        =     .4786

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0002309   .0206954     0.01   0.991    -.0403422     .040804
          3  |   .0058577   .0199856     0.29   0.769    -.0333239    .0450394
          4  |  -.0142931   .0198581    -0.72   0.472    -.0532247    .0246385
             |
       _cons |   .3570285   .0142435    25.07   0.000     .3291043    .3849527
------------------------------------------------------------------------------
(30 missing values generated)
(4,507 real changes made)
(sum of wgt is   2.5025e+06)

      Source |       SS           df       MS      Number of obs   =    32,502
-------------+----------------------------------   F(3, 32498)     =      2.36
       Model |  1.72204751         3  .574015837   Prob > F        =    0.0690
    Residual |  7890.54524    32,498  .242800949   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |  7892.26729    32,501  .242831522   Root MSE        =    .49275

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0116169   .0077331     1.50   0.133    -.0035403     .026774
          3  |   .0131909   .0077544     1.70   0.089     -.002008    .0283899
          4  |   .0202174   .0077046     2.62   0.009     .0051162    .0353187
             |
       _cons |   .4040087   .0054661    73.91   0.000      .393295    .4147225
------------------------------------------------------------------------------
(30 missing values generated)
(32,595 real changes made)
(sum of wgt is   8.7270e+05)

      Source |       SS           df       MS      Number of obs   =     4,507
-------------+----------------------------------   F(3, 4503)      =      1.40
       Model |  2307.95309         3  769.317698   Prob > F        =    0.2416
    Residual |  2479039.85     4,503  550.530724   R-squared       =    0.0009
-------------+----------------------------------   Adj R-squared   =    0.0003
       Total |   2481347.8     4,506  550.676388   Root MSE        =    23.463

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -1.601836   1.014581    -1.58   0.114    -3.590913     .387242
          3  |   -.612218   .9797865    -0.62   0.532    -2.533081    1.308645
          4  |  -1.730049   .9735352    -1.78   0.076    -3.638656     .178558
             |
       _cons |   16.04886   .6982804    22.98   0.000     14.67989    17.41784
------------------------------------------------------------------------------
(30 missing values generated)
(4,507 real changes made)
(sum of wgt is   2.5025e+06)

      Source |       SS           df       MS      Number of obs   =    32,502
-------------+----------------------------------   F(3, 32498)     =      1.74
       Model |  2839.74553         3  946.581844   Prob > F        =    0.1557
    Residual |  17643178.4    32,498  542.900436   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |  17646018.1    32,501  542.937698   Root MSE        =      23.3

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .1486589   .3656691     0.41   0.684     -.568066    .8653839
          3  |  -.1677911   .3666767    -0.46   0.647    -.8864909    .5509088
          4  |   .6235474   .3643203     1.71   0.087    -.0905339    1.337629
             |
       _cons |   16.85084   .2584714    65.19   0.000     16.34422    17.35745
------------------------------------------------------------------------------
(30 missing values generated)
(32,595 real changes made)
(sum of wgt is   4.4542e+05)

      Source |       SS           df       MS      Number of obs   =     3,051
-------------+----------------------------------   F(3, 3047)      =      1.35
       Model |  .973299139         3  .324433046   Prob > F        =    0.2565
    Residual |  732.473229     3,047  .240391608   R-squared       =    0.0013
-------------+----------------------------------   Adj R-squared   =    0.0003
       Total |  733.446529     3,050  .240474272   Root MSE        =     .4903

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0483946   .0252237    -1.92   0.055    -.0978518    .0010626
          3  |  -.0106976   .0252303    -0.42   0.672    -.0601678    .0387726
          4  |  -.0196966   .0248833    -0.79   0.429    -.0684864    .0290932
             |
       _cons |   .4216116   .0177579    23.74   0.000     .3867929    .4564303
------------------------------------------------------------------------------
(30 missing values generated)
(3,051 real changes made)
(sum of wgt is   1.0625e+06)

      Source |       SS           df       MS      Number of obs   =    16,530
-------------+----------------------------------   F(3, 16526)     =      1.74
       Model |  1.29434766         3  .431449221   Prob > F        =    0.1573
    Residual |  4108.09637    16,526   .24858383   R-squared       =    0.0003
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |  4109.39072    16,529   .24861702   Root MSE        =    .49858

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0026258   .0108748     0.24   0.809      -.01869    .0239416
          3  |  -.0016019   .0109508    -0.15   0.884    -.0230667    .0198629
          4  |   .0206317   .0109669     1.88   0.060    -.0008646     .042128
             |
       _cons |   .4572855   .0076736    59.59   0.000     .4422445    .4723265
------------------------------------------------------------------------------
(30 missing values generated)
(16,547 real changes made)
(sum of wgt is   4.4542e+05)

      Source |       SS           df       MS      Number of obs   =     3,051
-------------+----------------------------------   F(3, 3047)      =      1.22
       Model |  2155.62393         3  718.541311   Prob > F        =    0.3003
    Residual |  1792604.91     3,047  588.317989   R-squared       =    0.0012
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |  1794760.54     3,050  588.446078   Root MSE        =    24.255

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -2.296431   1.247829    -1.84   0.066    -4.743102    .1502406
          3  |   -.756866   1.248157    -0.61   0.544    -3.204181    1.690449
          4  |  -.6193996   1.230991    -0.50   0.615    -3.033056    1.794256
             |
       _cons |   18.35445   .8784931    20.89   0.000     16.63195    20.07694
------------------------------------------------------------------------------
(30 missing values generated)
(3,051 real changes made)
(sum of wgt is   1.0625e+06)

      Source |       SS           df       MS      Number of obs   =    16,530
-------------+----------------------------------   F(3, 16526)     =      1.22
       Model |  1962.95823         3  654.319409   Prob > F        =    0.2989
    Residual |  8828385.37    16,526  534.211871   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  8830348.33    16,529   534.23367   Root MSE        =    23.113

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .1209801   .5041295     0.24   0.810    -.8671679    1.109128
          3  |  -.1118122   .5076536    -0.22   0.826    -1.106868    .8832436
          4  |   .7821828   .5083991     1.54   0.124    -.2143341      1.7787
             |
       _cons |     18.403   .3557269    51.73   0.000     17.70574    19.10026
------------------------------------------------------------------------------
(30 missing values generated)
(16,547 real changes made)
(sum of wgt is   8.2847e+05)

      Source |       SS           df       MS      Number of obs   =     3,961
-------------+----------------------------------   F(3, 3957)      =      0.93
       Model |  .676656623         3  .225552208   Prob > F        =    0.4235
    Residual |  955.950487     3,957  .241584657   R-squared       =    0.0007
-------------+----------------------------------   Adj R-squared   =   -0.0001
       Total |  956.627143     3,960  .241572511   Root MSE        =    .49151

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0289698   .0225644    -1.28   0.199    -.0732087    .0152691
          3  |  -.0324352   .0219973    -1.47   0.140    -.0755623    .0106919
          4  |  -.0300249   .0222956    -1.35   0.178    -.0737369    .0136871
             |
       _cons |   .4311324   .0160029    26.94   0.000     .3997576    .4625071
------------------------------------------------------------------------------
(30 missing values generated)
(3,961 real changes made)
(sum of wgt is   2.8407e+06)

      Source |       SS           df       MS      Number of obs   =    33,605
-------------+----------------------------------   F(3, 33601)     =      1.30
       Model |  .956310471         3  .318770157   Prob > F        =    0.2737
    Residual |  8262.73743    33,601  .245907486   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  8263.69374    33,604   .24591399   Root MSE        =    .49589

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0009911   .0076504     0.13   0.897    -.0140039     .015986
          3  |   .0024421   .0077617     0.31   0.753    -.0127712    .0176553
          4  |   .0131743   .0076389     1.72   0.085    -.0017983    .0281468
             |
       _cons |   .4317795   .0054749    78.87   0.000     .4210486    .4425105
------------------------------------------------------------------------------
(30 missing values generated)
(33,679 real changes made)
(sum of wgt is   8.2847e+05)

      Source |       SS           df       MS      Number of obs   =     3,961
-------------+----------------------------------   F(3, 3957)      =      0.27
       Model |  475.266886         3  158.422295   Prob > F        =    0.8486
    Residual |   2339939.8     3,957  591.341876   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |  2340415.07     3,960  591.013907   Root MSE        =    24.318

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.9525868    1.11637    -0.85   0.394    -3.141301    1.236128
          3  |  -.4692354   1.088313    -0.43   0.666    -2.602942    1.664471
          4  |  -.7197653   1.103073    -0.65   0.514    -2.882411     1.44288
             |
       _cons |   18.13851   .7917427    22.91   0.000     16.58625    19.69077
------------------------------------------------------------------------------
(30 missing values generated)
(3,961 real changes made)
(sum of wgt is   2.8407e+06)

      Source |       SS           df       MS      Number of obs   =    33,605
-------------+----------------------------------   F(3, 33601)     =      0.75
       Model |  1269.53981         3  423.179936   Prob > F        =    0.5226
    Residual |  18977347.4    33,601  564.785198   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |    18978617    33,604  564.772557   Root MSE        =    23.765

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.3364795   .3666378    -0.92   0.359    -1.055102    .3821433
          3  |  -.1256461   .3719747    -0.34   0.736    -.8547293    .6034372
          4  |   .1915772   .3660904     0.52   0.601    -.5259727     .909127
             |
       _cons |    18.1541   .2623794    69.19   0.000     17.63983    18.66838
------------------------------------------------------------------------------
(30 missing values generated)
(33,679 real changes made)
(sum of wgt is   9.4384e+05)

      Source |       SS           df       MS      Number of obs   =     4,819
-------------+----------------------------------   F(3, 4815)      =      0.11
       Model |  .080554559         3   .02685152   Prob > F        =    0.9530
    Residual |  1152.28402     4,815  .239311322   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |  1152.36457     4,818  .239179031   Root MSE        =    .48919

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0064572   .0198486    -0.33   0.745    -.0453695    .0324551
          3  |  -.0055086   .0198251    -0.28   0.781    -.0443749    .0333577
          4  |   .0035986   .0200303     0.18   0.857    -.0356699    .0428672
             |
       _cons |    .397883   .0140256    28.37   0.000     .3703865    .4253796
------------------------------------------------------------------------------
(30 missing values generated)
(4,819 real changes made)
(sum of wgt is   2.5545e+06)

      Source |       SS           df       MS      Number of obs   =    27,921
-------------+----------------------------------   F(3, 27917)     =      0.27
       Model |  .196724299         3  .065574766   Prob > F        =    0.8495
    Residual |  6864.88536    27,917  .245903405   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0001
       Total |  6865.08208    27,920  .245884029   Root MSE        =    .49589

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0003088   .0082885    -0.04   0.970    -.0165547     .015937
          3  |  -.0003687   .0083855    -0.04   0.965    -.0168047    .0160674
          4  |   .0059452   .0083696     0.71   0.478    -.0104597    .0223501
             |
       _cons |     .43449   .0058332    74.49   0.000     .4230566    .4459234
------------------------------------------------------------------------------
(30 missing values generated)
(28,039 real changes made)
(sum of wgt is   9.4384e+05)

      Source |       SS           df       MS      Number of obs   =     4,819
-------------+----------------------------------   F(3, 4815)      =      0.13
       Model |   196.14516         3  65.3817199   Prob > F        =    0.9396
    Residual |  2342847.63     4,815  486.572716   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0005
       Total |  2343043.77     4,818  486.310455   Root MSE        =    22.058

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.3332955   .8949987    -0.37   0.710    -2.087902    1.421311
          3  |  -.4265607   .8939395    -0.48   0.633     -2.17909    1.325969
          4  |  -.5418021    .903192    -0.60   0.549    -2.312471    1.228867
             |
       _cons |   16.73485   .6324306    26.46   0.000       15.495     17.9747
------------------------------------------------------------------------------
(30 missing values generated)
(4,819 real changes made)
(sum of wgt is   2.5545e+06)

      Source |       SS           df       MS      Number of obs   =    27,921
-------------+----------------------------------   F(3, 27917)     =      0.85
       Model |  1311.19663         3  437.065543   Prob > F        =    0.4673
    Residual |  14385717.1    27,917  515.303115   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |  14387028.3    27,920  515.294708   Root MSE        =      22.7

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   -.445033   .3794231    -1.17   0.241    -1.188721    .2986549
          3  |  -.5262343   .3838665    -1.37   0.170    -1.278631    .2261629
          4  |  -.1359581   .3831382    -0.35   0.723    -.8869278    .6150117
             |
       _cons |   17.43218   .2670286    65.28   0.000     16.90879    17.95557
------------------------------------------------------------------------------
(30 missing values generated)
(28,039 real changes made)
(sum of wgt is   2.5758e+06)

      Source |       SS           df       MS      Number of obs   =    12,670
-------------+----------------------------------   F(3, 12666)     =      6.71
       Model |  4.83094479         3  1.61031493   Prob > F        =    0.0002
    Residual |  3041.17162    12,666  .240105133   R-squared       =    0.0016
-------------+----------------------------------   Adj R-squared   =    0.0013
       Total |  3046.00256    12,669  .240429597   Root MSE        =    .49001

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0483956   .0124391    -3.89   0.000    -.0727782   -.0240131
          3  |  -.0475259   .0123309    -3.85   0.000    -.0716963   -.0233555
          4  |  -.0268566   .0124428    -2.16   0.031    -.0512463   -.0024668
             |
       _cons |   .4332575   .0088924    48.72   0.000     .4158271    .4506879
------------------------------------------------------------------------------
(30 missing values generated)
(12,670 real changes made)
(sum of wgt is   7.2329e+06)

      Source |       SS           df       MS      Number of obs   =    77,551
-------------+----------------------------------   F(3, 77547)     =     26.88
       Model |  20.0832631         3  6.69442102   Prob > F        =    0.0000
    Residual |  19315.1474    77,547  .249076656   R-squared       =    0.0010
-------------+----------------------------------   Adj R-squared   =    0.0010
       Total |  19335.2307    77,550  .249325992   Root MSE        =    .49908

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0417141   .0050863    -8.20   0.000    -.0516832   -.0317451
          3  |  -.0371682   .0050903    -7.30   0.000     -.047145   -.0271913
          4  |   -.025604   .0050844    -5.04   0.000    -.0355695   -.0156385
             |
       _cons |   .5002728   .0036219   138.12   0.000     .4931738    .5073717
------------------------------------------------------------------------------
(30 missing values generated)
(77,628 real changes made)
(sum of wgt is   2.5758e+06)

      Source |       SS           df       MS      Number of obs   =    12,670
-------------+----------------------------------   F(3, 12666)     =     16.62
       Model |  28873.2663         3  9624.42212   Prob > F        =    0.0000
    Residual |  7333021.51    12,666  578.953222   R-squared       =    0.0039
-------------+----------------------------------   Adj R-squared   =    0.0037
       Total |  7361894.78    12,669  581.095175   Root MSE        =    24.061

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -3.783299   .6108155    -6.19   0.000     -4.98059   -2.586009
          3  |  -3.654742   .6055013    -6.04   0.000    -4.841616   -2.467868
          4  |  -2.180213   .6109967    -3.57   0.000    -3.377859   -.9825667
             |
       _cons |    20.0761   .4366556    45.98   0.000     19.22019    20.93201
------------------------------------------------------------------------------
(30 missing values generated)
(12,670 real changes made)
(sum of wgt is   7.2329e+06)

      Source |       SS           df       MS      Number of obs   =    77,551
-------------+----------------------------------   F(3, 77547)     =     85.73
       Model |  139604.185         3  46534.7283   Prob > F        =    0.0000
    Residual |    42092525    77,547  542.800172   R-squared       =    0.0033
-------------+----------------------------------   Adj R-squared   =    0.0033
       Total |  42232129.1    77,550  544.579357   Root MSE        =    23.298

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -3.273148   .2374398   -13.79   0.000    -3.738529   -2.807768
          3  |  -3.323661   .2376253   -13.99   0.000    -3.789405   -2.857917
          4  |  -2.007919   .2373544    -8.46   0.000    -2.473132   -1.542705
             |
       _cons |   21.77902   .1690795   128.81   0.000     21.44762    22.11041
------------------------------------------------------------------------------
(30 missing values generated)
(77,628 real changes made)
(sum of wgt is   1.8092e+06)

      Source |       SS           df       MS      Number of obs   =     9,237
-------------+----------------------------------   F(3, 9233)      =      0.46
       Model |    .3139872         3    .1046624   Prob > F        =    0.7133
    Residual |  2120.69111     9,233  .229686029   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  2121.00509     9,236  .229645419   Root MSE        =    .47926

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0028916   .0139663     0.21   0.836    -.0244854    .0302686
          3  |   -.008897   .0140384    -0.63   0.526    -.0364153    .0186214
          4  |  -.0110282   .0140693    -0.78   0.433    -.0386072    .0165509
             |
       _cons |   .3613965   .0097983    36.88   0.000     .3421896    .3806034
------------------------------------------------------------------------------
(30 missing values generated)
(9,237 real changes made)
(sum of wgt is   5.2768e+06)

      Source |       SS           df       MS      Number of obs   =    50,468
-------------+----------------------------------   F(3, 50464)     =      0.31
       Model |  .224951689         3  .074983896   Prob > F        =    0.8183
    Residual |  12214.5948    50,464  .242045712   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |  12214.8198    50,467  .242035781   Root MSE        =    .49198

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0040956    .006203     0.66   0.509    -.0080623    .0162535
          3  |   .0055544   .0061523     0.90   0.367    -.0065042    .0176131
          4  |   .0020326   .0061431     0.33   0.741     -.010008    .0140731
             |
       _cons |   .4078425   .0043181    94.45   0.000     .3993789     .416306
------------------------------------------------------------------------------
(30 missing values generated)
(50,583 real changes made)
(sum of wgt is   1.8092e+06)

      Source |       SS           df       MS      Number of obs   =     9,237
-------------+----------------------------------   F(3, 9233)      =      1.18
       Model |  1856.13618         3  618.712058   Prob > F        =    0.3138
    Residual |  4821635.27     9,233  522.217618   R-squared       =    0.0004
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |   4823491.4     9,236  522.248961   Root MSE        =    22.852

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.3810912   .6659471    -0.57   0.567    -1.686495    .9243123
          3  |  -.8945741   .6693844    -1.34   0.181    -2.206716    .4175672
          4  |  -1.152041   .6708608    -1.72   0.086    -2.467077    .1629939
             |
       _cons |   16.07533   .4672083    34.41   0.000      15.1595    16.99116
------------------------------------------------------------------------------
(30 missing values generated)
(9,237 real changes made)
(sum of wgt is   5.2768e+06)

      Source |       SS           df       MS      Number of obs   =    50,468
-------------+----------------------------------   F(3, 50464)     =      0.24
       Model |  386.200446         3  128.733482   Prob > F        =    0.8663
    Residual |    26728446    50,464  529.653734   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |  26728832.2    50,467  529.629901   Root MSE        =    23.014

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0377538   .2901669    -0.13   0.896    -.6064841    .5309764
          3  |  -.2008105   .2877977    -0.70   0.485    -.7648972    .3632762
          4  |  -.1804668   .2873661    -0.63   0.530    -.7437076     .382774
             |
       _cons |   17.19576   .2019963    85.13   0.000     16.79985    17.59168
------------------------------------------------------------------------------
(30 missing values generated)
(50,583 real changes made)
(sum of wgt is   7.5625e+05)

      Source |       SS           df       MS      Number of obs   =     4,742
-------------+----------------------------------   F(3, 4738)      =      2.67
       Model |  1.80163355         3  .600544518   Prob > F        =    0.0456
    Residual |  1063.72888     4,738  .224510106   R-squared       =    0.0017
-------------+----------------------------------   Adj R-squared   =    0.0011
       Total |  1065.53052     4,741  .224748052   Root MSE        =    .47382

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   -.018555    .019098    -0.97   0.331    -.0559959    .0188858
          3  |  -.0531673   .0192757    -2.76   0.006    -.0909565    -.015378
          4  |  -.0311302   .0195861    -1.59   0.112    -.0695281    .0072677
             |
       _cons |    .366132    .013432    27.26   0.000      .339799    .3924651
------------------------------------------------------------------------------
(30 missing values generated)
(4,742 real changes made)
(sum of wgt is   2.2489e+06)

      Source |       SS           df       MS      Number of obs   =    28,410
-------------+----------------------------------   F(3, 28406)     =      3.98
       Model |  2.89444335         3  .964814449   Prob > F        =    0.0076
    Residual |  6883.83617    28,406    .2423374   R-squared       =    0.0004
-------------+----------------------------------   Adj R-squared   =    0.0003
       Total |  6886.73062    28,409  .242413693   Root MSE        =    .49228

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0244597   .0082514     2.96   0.003     .0082865     .040633
          3  |   .0174933   .0082784     2.11   0.035     .0012673    .0337193
          4  |   .0246481    .008194     3.01   0.003     .0085876    .0407087
             |
       _cons |    .396252   .0057982    68.34   0.000     .3848871    .4076168
------------------------------------------------------------------------------
(30 missing values generated)
(28,496 real changes made)
(sum of wgt is   7.5625e+05)

      Source |       SS           df       MS      Number of obs   =     4,742
-------------+----------------------------------   F(3, 4738)      =      3.37
       Model |  4566.08886         3  1522.02962   Prob > F        =    0.0178
    Residual |  2141113.65     4,738  451.902417   R-squared       =    0.0021
-------------+----------------------------------   Adj R-squared   =    0.0015
       Total |  2145679.74     4,741   452.57957   Root MSE        =    21.258

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   -1.56747   .8568235    -1.83   0.067    -3.247242    .1123026
          3  |  -2.538564   .8647963    -2.94   0.003    -4.233967   -.8431614
          4  |  -2.173034    .878725    -2.47   0.013    -3.895744   -.4503246
             |
       _cons |   15.56053   .6026242    25.82   0.000     14.37911    16.74195
------------------------------------------------------------------------------
(30 missing values generated)
(4,742 real changes made)
(sum of wgt is   2.2489e+06)

      Source |       SS           df       MS      Number of obs   =    28,410
-------------+----------------------------------   F(3, 28406)     =      2.43
       Model |  3910.83134         3  1303.61045   Prob > F        =    0.0632
    Residual |  15234973.3    28,406  536.329412   R-squared       =    0.0003
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |  15238884.1    28,409  536.410437   Root MSE        =    23.159

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .5361086   .3881819     1.38   0.167    -.2247464    1.296964
          3  |   .2017272   .3894498     0.52   0.604     -.561613    .9650674
          4  |   .9737132   .3854779     2.53   0.012     .2181582    1.729268
             |
       _cons |   16.52315   .2727736    60.57   0.000      15.9885     17.0578
------------------------------------------------------------------------------
(30 missing values generated)
(28,496 real changes made)
(sum of wgt is   1.8326e+06)

      Source |       SS           df       MS      Number of obs   =     9,589
-------------+----------------------------------   F(3, 9585)      =      1.06
       Model |   .72718722         3   .24239574   Prob > F        =    0.3664
    Residual |  2199.79868     9,585  .229504297   R-squared       =    0.0003
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  2200.52587     9,588   .22950833   Root MSE        =    .47907

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0228565    .013844     1.65   0.099    -.0042806    .0499937
          3  |   .0052884   .0138734     0.38   0.703    -.0219063    .0324831
          4  |   .0136922   .0141677     0.97   0.334    -.0140795    .0414638
             |
       _cons |   .3461152   .0100271    34.52   0.000     .3264601    .3657704
------------------------------------------------------------------------------
(30 missing values generated)
(9,589 real changes made)
(sum of wgt is   4.6918e+06)

      Source |       SS           df       MS      Number of obs   =    46,149
-------------+----------------------------------   F(3, 46145)     =      0.48
       Model |  .353917307         3  .117972436   Prob > F        =    0.6927
    Residual |  11224.7746    46,145  .243250073   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |  11225.1285    46,148  .243241929   Root MSE        =     .4932

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0057562   .0065158    -0.88   0.377    -.0185273    .0070149
          3  |  -.0068472   .0065031    -1.05   0.292    -.0195935    .0058991
          4  |  -.0019803   .0065277    -0.30   0.762    -.0147746    .0108141
             |
       _cons |   .4214394   .0046373    90.88   0.000     .4123503    .4305286
------------------------------------------------------------------------------
(30 missing values generated)
(46,195 real changes made)
(sum of wgt is   1.8326e+06)

      Source |       SS           df       MS      Number of obs   =     9,589
-------------+----------------------------------   F(3, 9585)      =      0.47
       Model |  785.393674         3  261.797891   Prob > F        =    0.7033
    Residual |  5340189.63     9,585  557.140284   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  5340975.02     9,588  557.047874   Root MSE        =    23.604

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |    .650803   .6820997     0.95   0.340    -.6862566    1.987863
          3  |   .2253332   .6835468     0.33   0.742    -1.114563    1.565229
          4  |   .6849349   .6980483     0.98   0.327    -.6833874    2.053257
             |
       _cons |   16.18234   .4940378    32.76   0.000     15.21393    17.15076
------------------------------------------------------------------------------
(30 missing values generated)
(9,589 real changes made)
(sum of wgt is   4.6918e+06)

      Source |       SS           df       MS      Number of obs   =    46,149
-------------+----------------------------------   F(3, 46145)     =      3.82
       Model |  6370.10645         3  2123.36882   Prob > F        =    0.0095
    Residual |  25638494.6    46,145  555.607209   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |  25644864.8    46,148  555.709126   Root MSE        =    23.571

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.7136081   .3114054    -2.29   0.022    -1.323968   -.1032486
          3  |  -1.020828   .3108001    -3.28   0.001    -1.630001   -.4116549
          4  |  -.6829641   .3119732    -2.19   0.029    -1.294436   -.0714917
             |
       _cons |   18.02124    .221626    81.31   0.000     17.58685    18.45563
------------------------------------------------------------------------------
(30 missing values generated)
(46,195 real changes made)
(sum of wgt is   1.1698e+06)

      Source |       SS           df       MS      Number of obs   =     6,536
-------------+----------------------------------   F(3, 6532)      =      6.43
       Model |   4.5724134         3   1.5241378   Prob > F        =    0.0002
    Residual |  1547.70084     6,532  .236941341   R-squared       =    0.0029
-------------+----------------------------------   Adj R-squared   =    0.0025
       Total |  1552.27325     6,535  .237532249   Root MSE        =    .48677

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0005124   .0172083     0.03   0.976    -.0332214    .0342463
          3  |  -.0342614   .0170153    -2.01   0.044    -.0676171   -.0009058
          4  |  -.0627824   .0169855    -3.70   0.000    -.0960796   -.0294853
             |
       _cons |     .41284   .0121215    34.06   0.000      .389078    .4366021
------------------------------------------------------------------------------
(30 missing values generated)
(6,536 real changes made)
(sum of wgt is   3.1480e+06)

      Source |       SS           df       MS      Number of obs   =    45,211
-------------+----------------------------------   F(3, 45207)     =      4.74
       Model |  3.46587926         3  1.15529309   Prob > F        =    0.0026
    Residual |  11019.7873    45,207  .243762853   R-squared       =    0.0003
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |  11023.2532    45,210  .243823339   Root MSE        =    .49372

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0175816   .0066641    -2.64   0.008    -.0306433   -.0045199
          3  |   -.024588   .0067163    -3.66   0.000    -.0377521    -.011424
          4  |   -.014245   .0065191    -2.19   0.029    -.0270225   -.0014675
             |
       _cons |   .4355667   .0047693    91.33   0.000     .4262187    .4449147
------------------------------------------------------------------------------
(30 missing values generated)
(45,226 real changes made)
(sum of wgt is   1.1698e+06)

      Source |       SS           df       MS      Number of obs   =     6,536
-------------+----------------------------------   F(3, 6532)      =      8.84
       Model |  14961.2825         3  4987.09418   Prob > F        =    0.0000
    Residual |  3684945.63     6,532  564.137421   R-squared       =    0.0040
-------------+----------------------------------   Adj R-squared   =    0.0036
       Total |  3699906.92     6,535  566.167853   Root MSE        =    23.752

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -1.338964    .839672    -1.59   0.111    -2.984996    .3070675
          3  |  -3.002796   .8302577    -3.62   0.000    -4.630373   -1.375219
          4  |  -3.925279   .8288018    -4.74   0.000    -5.550002   -2.300556
             |
       _cons |   18.60568    .591463    31.46   0.000     17.44622    19.76514
------------------------------------------------------------------------------
(30 missing values generated)
(6,536 real changes made)
(sum of wgt is   3.1480e+06)

      Source |       SS           df       MS      Number of obs   =    45,211
-------------+----------------------------------   F(3, 45207)     =     26.46
       Model |  41151.6738         3  13717.2246   Prob > F        =    0.0000
    Residual |  23440091.2    45,207   518.50579   R-squared       =    0.0018
-------------+----------------------------------   Adj R-squared   =    0.0017
       Total |  23481242.9    45,210  519.381617   Root MSE        =    22.771

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -1.906848   .3073494    -6.20   0.000    -2.509258   -1.304438
          3  |  -2.654711   .3097578    -8.57   0.000    -3.261842   -2.047581
          4  |  -1.258169   .3006623    -4.18   0.000    -1.847472   -.6688663
             |
       _cons |   18.34194   .2199638    83.39   0.000     17.91081    18.77308
------------------------------------------------------------------------------
(30 missing values generated)
(45,226 real changes made)
(sum of wgt is   1.9705e+06)

      Source |       SS           df       MS      Number of obs   =     9,416
-------------+----------------------------------   F(3, 9412)      =      0.08
       Model |  .057608225         3  .019202742   Prob > F        =    0.9683
    Residual |  2129.08864     9,412  .226210012   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0003
       Total |  2129.14624     9,415  .226144051   Root MSE        =    .47562

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0068743   .0138861    -0.50   0.621    -.0340941    .0203455
          3  |  -.0041783   .0139585    -0.30   0.765    -.0315399    .0231833
          4  |  -.0045525    .013792    -0.33   0.741    -.0315878    .0224827
             |
       _cons |   .3493786   .0098331    35.53   0.000     .3301035    .3686536
------------------------------------------------------------------------------
(30 missing values generated)
(9,416 real changes made)
(sum of wgt is   5.6162e+06)

      Source |       SS           df       MS      Number of obs   =    52,528
-------------+----------------------------------   F(3, 52524)     =      1.12
       Model |  .818287438         3  .272762479   Prob > F        =    0.3387
    Residual |  12771.0126    52,524  .243146231   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  12771.8309    52,527  .243147922   Root MSE        =     .4931

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0024901   .0060999    -0.41   0.683    -.0144459    .0094658
          3  |   .0061206   .0060527     1.01   0.312    -.0057428    .0179841
          4  |   .0067979    .006065     1.12   0.262    -.0050895    .0186854
             |
       _cons |   .4145602   .0042751    96.97   0.000      .406181    .4229394
------------------------------------------------------------------------------
(30 missing values generated)
(52,588 real changes made)
(sum of wgt is   1.9705e+06)

      Source |       SS           df       MS      Number of obs   =     9,416
-------------+----------------------------------   F(3, 9412)      =      0.31
       Model |  584.717814         3  194.905938   Prob > F        =    0.8154
    Residual |  5844585.45     9,412  620.971679   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  5845170.16     9,415  620.835918   Root MSE        =    24.919

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.6771616   .7275471    -0.93   0.352    -2.103311    .7489878
          3  |  -.4647427   .7313373    -0.64   0.525    -1.898322    .9688363
          4  |  -.2687687   .7226135    -0.37   0.710    -1.685247     1.14771
             |
       _cons |   16.96114   .5151945    32.92   0.000     15.95125    17.97103
------------------------------------------------------------------------------
(30 missing values generated)
(9,416 real changes made)
(sum of wgt is   5.6162e+06)

      Source |       SS           df       MS      Number of obs   =    52,528
-------------+----------------------------------   F(3, 52524)     =      2.48
       Model |  3884.56248         3  1294.85416   Prob > F        =    0.0594
    Residual |  27459836.7    52,524  522.805512   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |  27463721.3    52,527  522.849606   Root MSE        =    22.865

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.4359372   .2828513    -1.54   0.123    -.9903284     .118454
          3  |  -.0851808   .2806646    -0.30   0.762    -.6352859    .4649244
          4  |   .3326288    .281233     1.18   0.237    -.2185905    .8838481
             |
       _cons |   16.96442   .1982345    85.58   0.000     16.57588    17.35296
------------------------------------------------------------------------------
(30 missing values generated)
(52,588 real changes made)
(sum of wgt is   1.4795e+06)

      Source |       SS           df       MS      Number of obs   =     8,337
-------------+----------------------------------   F(3, 8333)      =      0.22
       Model |  .161134543         3  .053711514   Prob > F        =    0.8802
    Residual |  2004.12033     8,333  .240504059   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0003
       Total |  2004.28146     8,336  .240436835   Root MSE        =    .49041

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0041277   .0153449     0.27   0.788     -.025952    .0342075
          3  |   -.007383   .0151001    -0.49   0.625    -.0369829     .022217
          4  |   .0025042   .0150234     0.17   0.868    -.0269455    .0319538
             |
       _cons |   .4023011   .0106569    37.75   0.000      .381411    .4231913
------------------------------------------------------------------------------
(30 missing values generated)
(8,337 real changes made)
(sum of wgt is   4.5327e+06)

      Source |       SS           df       MS      Number of obs   =    47,421
-------------+----------------------------------   F(3, 47417)     =      0.26
       Model |   .19285985         3  .064286617   Prob > F        =    0.8546
    Residual |  11749.0781    47,417  .247781978   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |  11749.2709    47,420   .24777037   Root MSE        =    .49778

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0027019    .006509    -0.42   0.678    -.0154597    .0100559
          3  |   .0005737    .006458     0.09   0.929    -.0120841    .0132316
          4  |   .0029818   .0064083     0.47   0.642    -.0095786    .0155423
             |
       _cons |   .4524689    .004555    99.33   0.000      .443541    .4613968
------------------------------------------------------------------------------
(30 missing values generated)
(47,492 real changes made)
(sum of wgt is   1.4795e+06)

      Source |       SS           df       MS      Number of obs   =     8,337
-------------+----------------------------------   F(3, 8333)      =      0.67
       Model |  1193.53352         3  397.844506   Prob > F        =    0.5707
    Residual |  4952308.45     8,333  594.300787   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =   -0.0001
       Total |  4953501.99     8,336  594.230085   Root MSE        =    24.378

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.2498301   .7627897    -0.33   0.743    -1.745088    1.245427
          3  |  -.8420232    .750623    -1.12   0.262    -2.313431    .6293845
          4  |   .1401169   .7468113     0.19   0.851    -1.323819    1.604053
             |
       _cons |   17.55184   .5297506    33.13   0.000      16.5134    18.59029
------------------------------------------------------------------------------
(30 missing values generated)
(8,337 real changes made)
(sum of wgt is   4.5327e+06)

      Source |       SS           df       MS      Number of obs   =    47,421
-------------+----------------------------------   F(3, 47417)     =      2.18
       Model |  3853.26834         3  1284.42278   Prob > F        =    0.0884
    Residual |    27972876    47,417  589.933483   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |  27976729.2    47,420   589.97742   Root MSE        =    24.289

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.6505721   .3176022    -2.05   0.041    -1.273077   -.0280674
          3  |  -.3360398   .3151131    -1.07   0.286    -.9536659    .2815863
          4  |   .0652301   .3126889     0.21   0.835    -.5476445    .6781048
             |
       _cons |    19.5913   .2222573    88.15   0.000     19.15567    20.02693
------------------------------------------------------------------------------
(30 missing values generated)
(47,492 real changes made)
(sum of wgt is   1.2238e+06)

      Source |       SS           df       MS      Number of obs   =     6,878
-------------+----------------------------------   F(3, 6874)      =      0.42
       Model |  .285633935         3  .095211312   Prob > F        =    0.7408
    Residual |  1569.24651     6,874  .228287244   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =   -0.0003
       Total |  1569.53215     6,877  .228229191   Root MSE        =    .47779

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.0000538   .0163257    -0.00   0.997    -.0320571    .0319496
          3  |  -.0016153   .0164998    -0.10   0.922    -.0339599    .0307294
          4  |  -.0151829    .016235    -0.94   0.350    -.0470085    .0166427
             |
       _cons |   .3566774   .0116389    30.65   0.000     .3338616    .3794932
------------------------------------------------------------------------------
(30 missing values generated)
(6,878 real changes made)
(sum of wgt is   3.6781e+06)

      Source |       SS           df       MS      Number of obs   =    37,708
-------------+----------------------------------   F(3, 37704)     =      2.49
       Model |  1.85238662         3  .617462208   Prob > F        =    0.0583
    Residual |   9345.3099    37,704  .247859906   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |  9347.16229    37,707  .247889312   Root MSE        =    .49786

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0130035   .0072917     1.78   0.075    -.0012883    .0272954
          3  |    .003182   .0072723     0.44   0.662    -.0110718    .0174359
          4  |   .0171225   .0072045     2.38   0.017     .0030015    .0312435
             |
       _cons |    .445598   .0051359    86.76   0.000     .4355315    .4556644
------------------------------------------------------------------------------
(30 missing values generated)
(37,826 real changes made)
(sum of wgt is   1.2238e+06)

      Source |       SS           df       MS      Number of obs   =     6,878
-------------+----------------------------------   F(3, 6874)      =      1.89
       Model |  3036.04972         3  1012.01657   Prob > F        =    0.1294
    Residual |  3686404.89     6,874  536.282352   R-squared       =    0.0008
-------------+----------------------------------   Adj R-squared   =    0.0004
       Total |  3689440.94     6,877  536.489885   Root MSE        =    23.158

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -1.306069   .7912739    -1.65   0.099    -2.857211    .2450722
          3  |  -1.064707   .7997125    -1.33   0.183    -2.632391    .5029764
          4  |   -1.82287   .7868794    -2.32   0.021    -3.365397   -.2803428
             |
       _cons |   16.05004   .5641147    28.45   0.000      14.9442    17.15588
------------------------------------------------------------------------------
(30 missing values generated)
(6,878 real changes made)
(sum of wgt is   3.6781e+06)

      Source |       SS           df       MS      Number of obs   =    37,708
-------------+----------------------------------   F(3, 37704)     =      1.29
       Model |  2163.32126         3  721.107088   Prob > F        =    0.2764
    Residual |  21103252.4    37,704  559.708581   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  21105415.7    37,707  559.721422   Root MSE        =    23.658

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .2604442   .3465006     0.75   0.452    -.4187064    .9395948
          3  |  -.3578787   .3455797    -1.04   0.300    -1.035224    .3194669
          4  |    .192955   .3423596     0.56   0.573     -.478079     .863989
             |
       _cons |   18.10888   .2440586    74.20   0.000     17.63052    18.58725
------------------------------------------------------------------------------
(30 missing values generated)
(37,826 real changes made)
(sum of wgt is   1.3278e+06)

      Source |       SS           df       MS      Number of obs   =     6,929
-------------+----------------------------------   F(3, 6925)      =      0.33
       Model |  .228384913         3  .076128304   Prob > F        =    0.8017
    Residual |  1584.58599     6,925  .228821081   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0003
       Total |  1584.81437     6,928  .228754961   Root MSE        =    .47835

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0111311    .016357     0.68   0.496    -.0209337     .043196
          3  |   .0130414   .0162246     0.80   0.422    -.0187637    .0448465
          4  |   .0014821   .0163592     0.09   0.928     -.030587    .0335512
             |
       _cons |   .3476329   .0116159    29.93   0.000     .3248622    .3704036
------------------------------------------------------------------------------
(30 missing values generated)
(6,929 real changes made)
(sum of wgt is   3.7542e+06)

      Source |       SS           df       MS      Number of obs   =    45,010
-------------+----------------------------------   F(3, 45006)     =      0.51
       Model |   .36802059         3   .12267353   Prob > F        =    0.6783
    Residual |  10917.2342    45,006  .242572862   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |  10917.6022    45,009   .24256487   Root MSE        =    .49252

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0007322   .0065877     0.11   0.912    -.0121797    .0136441
          3  |   -.004822   .0066238    -0.73   0.467    -.0178047    .0081607
          4  |   .0030227   .0065796     0.46   0.646    -.0098735    .0159188
             |
       _cons |   .4139816   .0047066    87.96   0.000     .4047566    .4232065
------------------------------------------------------------------------------
(30 missing values generated)
(45,072 real changes made)
(sum of wgt is   1.3278e+06)

      Source |       SS           df       MS      Number of obs   =     6,929
-------------+----------------------------------   F(3, 6925)      =      0.31
       Model |   503.13772         3  167.712573   Prob > F        =    0.8208
    Residual |  3790048.63     6,925  547.299442   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0003
       Total |  3790551.77     6,928  547.135071   Root MSE        =    23.394

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.5734373   .7999618    -0.72   0.474    -2.141608     .994733
          3  |  -.6648423    .793483    -0.84   0.402    -2.220312    .8906276
          4  |  -.6267291   .8000679    -0.78   0.433    -2.195108    .9416493
             |
       _cons |   16.18289   .5680902    28.49   0.000     15.06926    17.29652
------------------------------------------------------------------------------
(30 missing values generated)
(6,929 real changes made)
(sum of wgt is   3.7542e+06)

      Source |       SS           df       MS      Number of obs   =    45,010
-------------+----------------------------------   F(3, 45006)     =      1.30
       Model |   2071.2293         3  690.409765   Prob > F        =    0.2711
    Residual |  23824819.3    45,006  529.369846   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  23826890.5    45,009  529.380579   Root MSE        =    23.008

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |  -.2738327    .307744    -0.89   0.374     -.877016    .3293507
          3  |  -.5696463   .3094307    -1.84   0.066    -1.176136     .036843
          4  |  -.1033393   .3073681    -0.34   0.737    -.7057859    .4991073
             |
       _cons |   17.04197   .2198689    77.51   0.000     16.61102    17.47291
------------------------------------------------------------------------------
(30 missing values generated)
(45,072 real changes made)
(sum of wgt is   7.5648e+05)

      Source |       SS           df       MS      Number of obs   =     4,147
-------------+----------------------------------   F(3, 4143)      =      0.24
       Model |  .172576074         3  .057525358   Prob > F        =    0.8664
    Residual |  980.954849     4,143   .23677404   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =   -0.0005
       Total |  981.127425     4,146  .236644338   Root MSE        =    .48659

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .0088204   .0213352     0.41   0.679     -.033008    .0506489
          3  |  -.0075382   .0212719    -0.35   0.723    -.0492425    .0341662
          4  |   .0071701   .0212085     0.34   0.735      -.03441    .0487501
             |
       _cons |   .3820989   .0148936    25.66   0.000     .3528995    .4112983
------------------------------------------------------------------------------
(30 missing values generated)
(4,147 real changes made)
(sum of wgt is   2.0435e+06)

      Source |       SS           df       MS      Number of obs   =    27,212
-------------+----------------------------------   F(3, 27208)     =      1.50
       Model |  1.08332876         3  .361109585   Prob > F        =    0.2129
    Residual |  6559.13696    27,208  .241073837   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |  6560.22029    27,211  .241087071   Root MSE        =    .49099

------------------------------------------------------------------------------
     trabajo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |    .007277   .0083979     0.87   0.386    -.0091834    .0237373
          3  |  -.0026693   .0083994    -0.32   0.751    -.0191325     .013794
          4  |   .0134187   .0083141     1.61   0.107    -.0028773    .0297148
             |
       _cons |   .4010197   .0058461    68.60   0.000     .3895611    .4124783
------------------------------------------------------------------------------
(30 missing values generated)
(27,253 real changes made)
(sum of wgt is   7.5648e+05)

      Source |       SS           df       MS      Number of obs   =     4,147
-------------+----------------------------------   F(3, 4143)      =      0.04
       Model |  69.0351915         3  23.0117305   Prob > F        =    0.9909
    Residual |  2655540.45     4,143   640.97042   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0007
       Total |  2655609.48     4,146  640.523272   Root MSE        =    25.317

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .3163542   1.110066     0.28   0.776    -1.859971     2.49268
          3  |   .0472603   1.106773     0.04   0.966    -2.122608    2.217128
          4  |   .2271021   1.103474     0.21   0.837    -1.936299    2.390503
             |
       _cons |   17.65435   .7749095    22.78   0.000     16.13511    19.17359
------------------------------------------------------------------------------
(30 missing values generated)
(4,147 real changes made)
(sum of wgt is   2.0435e+06)

      Source |       SS           df       MS      Number of obs   =    27,212
-------------+----------------------------------   F(3, 27208)     =      2.77
       Model |  4362.96332         3  1454.32111   Prob > F        =    0.0398
    Residual |  14262758.1    27,208  524.211928   R-squared       =    0.0003
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |  14267121.1    27,211  524.314472   Root MSE        =    22.896

------------------------------------------------------------------------------
horas_trab~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   trimestre |
          2  |   .1818991   .3916066     0.46   0.642      -.58567    .9494681
          3  |  -.5511692   .3916761    -1.41   0.159    -1.318874    .2165361
          4  |   .5657608   .3876982     1.46   0.144    -.1941476    1.325669
             |
       _cons |   16.52029   .2726113    60.60   0.000     15.98596    17.05463
------------------------------------------------------------------------------
(30 missing values generated)
(27,253 real changes made)
(30 observations deleted)
(data now sorted by numero pers anio)
  variable poor was float now byte
  variable indigente was float now byte
  variable ind_under14 was float now byte
  variable semestre was float now byte
  variable anio_sem was float now int
  variable anio_qtr was float now int
  variable educ_more_HS was float now byte
  variable educ_HS_or_more was float now byte
  variable nomloc was str104 now str25
  (190,219,259 bytes saved)
===============================================================================
> ===================
File: ..\output\clean_loc_1998_2016.dta
Key: numero pers anio
===============================================================================
> ===================
  1883359:82(66945):1038383142:3013729684

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      numero |  1,883,359    7.60e+08    9.76e+08          1   2.02e+09
        pers |  1,883,359    2.394438    1.518967          1         27
        anio |  1,883,359    2008.397    4.955544       1998       2016
   inflation |  1,883,359    8.059518    3.511445       3.59      25.94
    cpi_2006 |  1,883,359    127.7388    47.60945   48.00595   217.6432
-------------+---------------------------------------------------------
    cpi_2009 |  1,883,359    101.3042    38.36949   37.53526   173.4749
      semana |    172,515    24.40658    13.83848          1         48
        dpto |  1,883,359    5.628493    5.786107          1         19
        secc |  1,730,305    9.574802    16.53152          0         99
        segm |  1,730,305    61.89583    92.34555          0        845
-------------+---------------------------------------------------------
     estrato |  1,883,359    5.493579    2.938851          1         12
      hombre |  1,883,359    .4683451    .4989971          0          1
        edad |  1,883,359    36.69205      23.473          0         99
    pobpcoac |  1,883,359    3.836935    3.223082          1         99
horas_trab~p |  1,883,359    17.30666    22.32695          0         99
-------------+---------------------------------------------------------
horas_tra~_s |  1,883,359    .8807312    4.793508          0         98
horas_trab~o |  1,883,359    18.28292    23.41774          0        180
busca_trab~o |  1,883,359    .0717808    .2581247          0          1
meses_trab~o |  1,604,330    .9877718    3.921998          0         80
anios_trab~o |  1,604,330    3.595143    7.810929          0         98
-------------+---------------------------------------------------------
      ytotal |  1,883,359     8964.04    17117.79          0    7244333
     pesotri |  1,882,057    112.2817    54.20272          1       1527
     pesosem |  1,770,327    55.96034    28.39956          3       1345
      pesoan |  1,883,359    28.17216    13.90841          1       1323
         ccz |  1,799,390     4.17659    5.575275          0         18
-------------+---------------------------------------------------------
         loc |          0
      nomloc |          0
  nbr_people |  1,883,359    3.788646    1.892628          1         27
 nbr_above14 |  1,883,359     2.79023    1.261887          1         16
 nbr_under14 |  1,883,359    .9982621    1.287069          0         14
-------------+---------------------------------------------------------
     y_hogar |  1,883,359    27941.29    35277.56          0    7681180
c98_resid_~e |  1,883,359    .9953339    .0681495          0          1
c98_resid_~d |  1,883,359    .6481754    .4775397          0          1
c98_nbr_ro~s |  1,883,359    3.574185    1.311901          0         80
c98_nbr_be~s |  1,883,359    2.195518    .8372686          0         40
-------------+---------------------------------------------------------
c98_b_pipe~r |  1,883,359     .964987    .1838126          0          1
c98_hhld_t~t |  1,883,359    .9230901    .2664485          0          1
c98_b_sewage |  1,883,359    .6018704    .4895126          0          1
c98_hhld_s~e |  1,883,359    .9487071    .2205946          0          1
c98_hhld_h~r |  1,883,359    .8767718    .3286991          0          1
-------------+---------------------------------------------------------
c98_hhld_r~t |  1,883,359    .8439952      .36286          0          1
 c98_hhld_tv |  1,883,359    .9618586    .1915377          0          1
c98_hhld_vcr |  1,883,359    .4869757    .4998305          0          1
c98_hhld_w~c |  1,883,359    .7094054    .4540369          0          1
c98_hhld_d~r |  1,883,359    .0426716    .2021158          0          1
-------------+---------------------------------------------------------
c98_hhld_m~e |  1,883,359    .4803296    .4996131          0          1
c98_hhld_car |  1,883,359    .3550953    .4785423          0          1
   trimestre |  1,883,359    2.497607    1.117068          1          4
     married |  1,593,343    .5195686    .4996171          0          1
       etnia |  1,431,815    2.291282    .9704217          0          4
-------------+---------------------------------------------------------
  estudiante |  1,883,359    .0635089     .243876          0          1
     trabajo |  1,883,359    .4440752    .4968627          0          1
 y_hogar_alt |  1,883,359    28126.23       32692          0    7289481
  educ_level |  1,883,359    1.300751    .5889926          1          3
         mes |  1,710,844    6.493153    3.444643          1         12
-------------+---------------------------------------------------------
   trabajo_1 |  1,710,844    .4191715    .4934236          0          1
c01_hhld_c~r |  1,710,844    .5257364    .4993373          0          1
c01_hhld_i~t |  1,710,844    .3633762     .480972          0          1
c01_hhld_p~e |  1,710,844    .7214872    .4482673          0          1
c01_hhld_c~v |  1,710,844    .5669482    .4954978          0          1
-------------+---------------------------------------------------------
    region_3 |  1,431,815    1.683245    .6382833          1          3
    region_4 |  1,431,815    1.683762    .6397525          1          4
     pesomen |  1,317,343    276.1591    110.1016          1       2451
 live_births |  1,186,134    .7562409      .73836          0          2
live_birth~r |  1,186,134    1.054584    1.754446          0         72
-------------+---------------------------------------------------------
       li_06 |  1,875,115    1621.162    582.8108   363.3281       3021
       lp_06 |  1,875,115     16985.2    9365.428   1585.694   132026.8
c06_mat_wa~s |  1,431,815    .9736006    .1603198          0          1
c06_mat_roof |  1,431,815    .5676362    .4954044          0          1
c06_mat_fl~r |  1,431,815    .7911539    .4064844          0          1
-------------+---------------------------------------------------------
c06_b_electr |  1,431,815    .9961147    .0622108          0          1
    loc_code |  1,883,359    574042.5    585552.4     101010    1931000
        poor |  1,883,359    .3719832    .4833341          0          1
   indigente |  1,883,359    .0128812    .1127622          0          1
 ind_under14 |  1,883,359    .5156978    .4997537          0          1
-------------+---------------------------------------------------------
    semestre |  1,883,359    1.499127    .4999994          1          2
    anio_sem |  1,883,359    97.29315    9.924085         76        113
    anio_qtr |  1,883,359    195.0857    19.85452        152        227
 trabajo_des |  1,883,359     .444078    .4968316  -.0311828   1.038121
horas_tra~es |  1,883,359    18.28332    23.41472  -2.442167   179.3911
-------------+---------------------------------------------------------
educ_more_HS |  1,883,359    .0683061    .2522706          0          1
educ_HS_or~e |  1,883,359    .2324448    .4223912          0          1




(note: file ..\output\clean_loc_1998_2016.dta not found)
file ..\output\clean_loc_1998_2016.dta saved

. 
end of do-file


Execute:  "C:\Program Files (x86)\Stata15\StataSE-64.exe" /e do "./population.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./population.do 

. * Note: since the locals created in the beginning are used several times in t
> he 
. * code, I did not create different programs (alternative: create globals?)
. 
. * Setting up locals that describe the 6 tables in each worksheet
. local S_all   = 0

. local S_men   = 22

. local S_women = 44

. 
. * Create the cell range for each of the 6 tables in each worksheet
. foreach gender in all men women {
  2.         local S0_`gender' = 8 + `S_`gender''
  3.         local S1_`gender' = `S0_`gender''+2
  4.         local E1_`gender' = `S0_`gender''+2+18
  5.         local cr1_`gender' = "A`S0_`gender'':Z`S0_`gender''"
  6.         local cr2_`gender' = "A`S1_`gender'':Z`E1_`gender''"
  7. }

. 
. * Get names and number of worksheets to be later used as indicators
. import excel "..\..\raw\Departamentos_poblacion_por_sexo_y_edad_1996-2025.xls
> " , describe

                Sheet | Range
  --------------------+--------------------
                 Nota | A1:L35
  Sexo y Departamento | A1:AE74
           Montevideo | A1:BD76
              Artigas | A1:BD76
            Canelones | A1:BD76
          Cerro Largo | A1:BD76
              Colonia | A1:BD76
              Durazno | A1:BD76
               Flores | A1:BD76
              Florida | A1:BD76
            Lavalleja | A1:BD76
            Maldonado | A1:BD76
            Paysandú | A1:BD76
           Río Negro | A1:BD76
               Rivera | A1:BD76
                Rocha | A1:BD76
                Salto | A1:BD76
            San José | A1:BD76
              Soriano | A1:BD76
          Tacuarembó | A1:BD76
       Treinta y Tres | A1:BD76
               Hoja21 | 

. local ws_N = `r(N_worksheet)'-1

. local ws_1 = 3

. 
. forvalues ws = `ws_1'/`ws_N' {
  2.         local ws_`ws'_name = "`r(worksheet_`ws')'"
  3.         local ws_`ws'_nbr  = `ws'
  4.         if `ws'==3 {
  5.                 local ws_`ws'_dpto = 10 //Mvd
  6.         }
  7.         else if inrange(`ws',4,12) { 
  8.                 local ws_`ws'_dpto = `ws'-3 // Alphabetically prior to Mvd
  9.         }
 10.         else {
 11.                 local ws_`ws'_dpto = `ws'-2
 12.         }
 13.         *I wanted to create a label for depar with the local below, but it
> 's hard to add the double quotes
.         *local depar = " `depar' " + " `ws_`ws'_dpto' " + `" `=char(34)' "' +
>  "`ws_`ws'_name'" //+ "`ws_`ws'_name'" 
. }

. 
. * Import the 6 tables from each worksheet and create the relevant variables 
. forvalues ws = `ws_1'/`ws_N' {
  2.         foreach gender in all men women {
  3.                 foreach cr in 1 2 {
  4.                         import excel "..\..\raw\Departamentos_poblacion_po
> r_sexo_y_edad_1996-2025.xls" ///
>                          , clear sheet("`ws_`ws'_name'") cellrange(`cr`cr'_`g
> ender'')
  5.                         
.                         gen depar = `ws_`ws'_dpto'
  6.                         gen gender_all = "`gender'"
  7.                         
.                         if "`cr'" == "1" {
  8.                                 gen age_min    = 0
  9.                                 gen age_max    = 99
 10.                                 gen all_ages   = 1
 11.                         }
 12.                         else {          
 13.                                 qui replace A="90-99" if A=="90 y más"
 14.                                 gen splitat    = strpos(A,"-")  
 15.                                 gen age_min    = substr(A,1,splitat-1)
 16.                                 gen age_max    = substr(A,splitat+1,.)
 17.                                 qui destring age_min age_max, replace
 18.                                 drop splitat
 19.                                 gen all_ages   = 0
 20.                         }
 21.                         
.                         tempfile pop_`ws_`ws'_nbr'_`gender'_`cr'
 22.                         save `pop_`ws_`ws'_nbr'_`gender'_`cr''
 23.                         
.                         di "*******"
 24.                         di "pop_`ws_`ws'_nbr'_`gender'_`cr'"
 25.                         di "*******"
 26.                 }
 27.         }
 28. }
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000001.tmp saved
*******
pop_3_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000002.tmp saved
*******
pop_3_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000003.tmp saved
*******
pop_3_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000004.tmp saved
*******
pop_3_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000005.tmp saved
*******
pop_3_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000006.tmp saved
*******
pop_3_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000007.tmp saved
*******
pop_4_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000008.tmp saved
*******
pop_4_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000009.tmp saved
*******
pop_4_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000a.tmp saved
*******
pop_4_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000b.tmp saved
*******
pop_4_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000c.tmp saved
*******
pop_4_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000d.tmp saved
*******
pop_5_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000e.tmp saved
*******
pop_5_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000f.tmp saved
*******
pop_5_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000g.tmp saved
*******
pop_5_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000h.tmp saved
*******
pop_5_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000i.tmp saved
*******
pop_5_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000j.tmp saved
*******
pop_6_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000k.tmp saved
*******
pop_6_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000l.tmp saved
*******
pop_6_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000m.tmp saved
*******
pop_6_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000n.tmp saved
*******
pop_6_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000o.tmp saved
*******
pop_6_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000p.tmp saved
*******
pop_7_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000q.tmp saved
*******
pop_7_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000r.tmp saved
*******
pop_7_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000s.tmp saved
*******
pop_7_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000t.tmp saved
*******
pop_7_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000u.tmp saved
*******
pop_7_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000v.tmp saved
*******
pop_8_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000w.tmp saved
*******
pop_8_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00000x.tmp saved
*******
pop_8_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000010.tmp saved
*******
pop_8_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000011.tmp saved
*******
pop_8_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000012.tmp saved
*******
pop_8_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000013.tmp saved
*******
pop_9_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000014.tmp saved
*******
pop_9_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000015.tmp saved
*******
pop_9_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000016.tmp saved
*******
pop_9_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000017.tmp saved
*******
pop_9_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000018.tmp saved
*******
pop_9_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000019.tmp saved
*******
pop_10_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001a.tmp saved
*******
pop_10_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001b.tmp saved
*******
pop_10_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001c.tmp saved
*******
pop_10_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001d.tmp saved
*******
pop_10_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001e.tmp saved
*******
pop_10_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001f.tmp saved
*******
pop_11_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001g.tmp saved
*******
pop_11_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001h.tmp saved
*******
pop_11_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001i.tmp saved
*******
pop_11_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001j.tmp saved
*******
pop_11_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001k.tmp saved
*******
pop_11_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001l.tmp saved
*******
pop_12_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001m.tmp saved
*******
pop_12_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001n.tmp saved
*******
pop_12_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001o.tmp saved
*******
pop_12_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001p.tmp saved
*******
pop_12_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001q.tmp saved
*******
pop_12_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001r.tmp saved
*******
pop_13_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001s.tmp saved
*******
pop_13_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001t.tmp saved
*******
pop_13_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001u.tmp saved
*******
pop_13_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001v.tmp saved
*******
pop_13_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001w.tmp saved
*******
pop_13_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00001x.tmp saved
*******
pop_14_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000020.tmp saved
*******
pop_14_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000021.tmp saved
*******
pop_14_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000022.tmp saved
*******
pop_14_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000023.tmp saved
*******
pop_14_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000024.tmp saved
*******
pop_14_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000025.tmp saved
*******
pop_15_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000026.tmp saved
*******
pop_15_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000027.tmp saved
*******
pop_15_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000028.tmp saved
*******
pop_15_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000029.tmp saved
*******
pop_15_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002a.tmp saved
*******
pop_15_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002b.tmp saved
*******
pop_16_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002c.tmp saved
*******
pop_16_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002d.tmp saved
*******
pop_16_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002e.tmp saved
*******
pop_16_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002f.tmp saved
*******
pop_16_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002g.tmp saved
*******
pop_16_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002h.tmp saved
*******
pop_17_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002i.tmp saved
*******
pop_17_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002j.tmp saved
*******
pop_17_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002k.tmp saved
*******
pop_17_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002l.tmp saved
*******
pop_17_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002m.tmp saved
*******
pop_17_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002n.tmp saved
*******
pop_18_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002o.tmp saved
*******
pop_18_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002p.tmp saved
*******
pop_18_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002q.tmp saved
*******
pop_18_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002r.tmp saved
*******
pop_18_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002s.tmp saved
*******
pop_18_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002t.tmp saved
*******
pop_19_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002u.tmp saved
*******
pop_19_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002v.tmp saved
*******
pop_19_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002w.tmp saved
*******
pop_19_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00002x.tmp saved
*******
pop_19_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000030.tmp saved
*******
pop_19_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000031.tmp saved
*******
pop_20_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000032.tmp saved
*******
pop_20_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000033.tmp saved
*******
pop_20_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000034.tmp saved
*******
pop_20_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000035.tmp saved
*******
pop_20_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000036.tmp saved
*******
pop_20_women_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000037.tmp saved
*******
pop_21_all_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000038.tmp saved
*******
pop_21_all_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_000039.tmp saved
*******
pop_21_men_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00003a.tmp saved
*******
pop_21_men_2
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00003b.tmp saved
*******
pop_21_women_1
*******
file C:\Users\cravizza\AppData\Local\Temp\ST_3590_00003c.tmp saved
*******
pop_21_women_2
*******

. 
. * Append all tables
. use `pop_`ws_1'_all_1', clear

. forvalues ws = `ws_1'/`ws_N' {
  2.         foreach gender in all men women {
  3.                 foreach cr in 1 2 {
  4.                         if "`ws_`ws'_nbr'_`gender'_`cr'" == "`ws_1'_all_1"
>  {
  5.                                 continue
  6.                         }
  7.                         else {
  8.                                 append using `pop_`ws_`ws'_nbr'_`gender'_`
> cr''
  9.                         }
 10.                 }
 11.         }
 12. }
(note: variable gender_all was str3, now str5 to accommodate using data's
       values)

. 
. * Check and rename year variables
. isid depar gender_all age_min age_max

. drop A

. local year = 1996

. foreach k in `c(ALPHA)' {
  2.         if "`k'" == "A" {
  3.                 continue
  4.         }
  5.         else {
  6.                 rename `k' pop`year'
  7.                 local year = `year' + 1
  8.         }
  9. }

. 
. * Reshape, aggregate dy depto, and save table
. reshape long pop, i(depar gender_all age_min age_max) j(anio)
(note: j = 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 200
> 9 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1140   ->   28500
Number of variables                  30   ->       7
j variable (25 values)                    ->   anio
xij variables:
            pop1996 pop1997 ... pop2020   ->   pop
-----------------------------------------------------------------------------

. save "..\output\population.dta", replace
(note: file ..\output\population.dta not found)
file ..\output\population.dta saved

. 
. * Collapse to women of fertile age and save table
. gen fertile_age = (gender_all=="women" & age_min>=15 & age_max<45 & all_ages=
> =0)

. collapse (sum) pop if all_ages==0 & fertile_age==1, by(depar anio age_min age
> _max)

. 
. save "..\output\population_fertile_age.dta", replace
(note: file ..\output\population_fertile_age.dta not found)
file ..\output\population_fertile_age.dta saved

. 
end of do-file


Execute:  "C:\Program Files (x86)\Stata15\StataSE-64.exe" /e do "./vital_records.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./vital_records.do 

. clear all

. set more off

. 
. program main    
  1.         append_data
  2.         derived_data
  3. end

. 
. program append_data
  1.         * Note: there is no 1998 data, but there is data for 1996 and 1997
.         forvalues year = 1999/2015 {
  2.                 capture import delimited "..\..\raw\vital_records\Natalida
> d `year'_p.csv", delim(";") clear
  3.                 
.                 *capture rename (civilm  civilp  instm   instp) (mestciv pest
> civ mademay pademay)
.                                                  
.                 qui destring , replace
  4.                 
.                 tempfile temp_`year'
  5.                 save `temp_`year''
  6.         }
  7. 
.         forvalues year = 1999/2014 {
  8.                 append using `temp_`year''
  9.         }
 10. 
.         keep if inrange(anio_parto,1999,2015) //note some births in 2015 are 
> recorded in 2016
 11.         assert !mi(edadm)
 12.         *keep if inrange(edadm,16,45)
.         
.         save "..\temp\births_append.dta", replace
 13. end

. 
. program derived_data
  1.         use "..\temp\births_append.dta", clear
  2.         rename anio_parto anio
  3. 
.         * Assert that corresponding variables are not used at the same time &
>  Gen harmonized vars
.         * Note: issue with mademay == 4 : table anio madeult if mademay == 4
.         assert (mi(civilm) & !mi(mestciv) & !mi(tunion)) | (!mi(civilm) & mi(
> mestciv) & mi(tunion))
  4.         assert (mi(instm) & !mi(mademay) & !mi(madecur) & !mi(madeult)) | 
> (!mi(instm) & mi(mademay) & mi(madecur) & mi(madeult))
  5.         gen married = (civilm==2 | mestciv==2)
  6.         gen not_married = (married==0)
  7.         gen partner = (civilm==2|civilm==3|mestciv==2|(convpad==1 & (tunio
> n==1|tunion==2)))
  8.         gen no_partner = (partner==0)
  9.         gen prim_school = (instm==2 | ((mademay==2 & madeult==6) | (madema
> y==4 & madeult<3) | mademay==3))
 10.         gen high_school = (instm==3 | ((mademay==4 & madeult==3) | (madema
> y==5 & madeult==1)))
 11.         replace high_school = 1 if inrange(anio,2008,2010) & mademay==4 & 
> madeult==6
 12.         
.         * Birth date
.         replace fecparto = "jan" + substr(fecparto,4, .) if substr(fecparto, 
> 1, 3) == "ene"
 13.         replace fecparto = "apr" + substr(fecparto,4, .) if substr(fecpart
> o, 1, 3) == "abr"
 14.         replace fecparto = "aug" + substr(fecparto,4, .) if substr(fecpart
> o, 1, 3) == "ago"
 15.         replace fecparto = "dec" + substr(fecparto,4, .) if substr(fecpart
> o, 1, 3) == "dic"
 16.         gen     anio_mon = monthly(fecparto, "MY")
 17.         replace anio_mon = monthly(fecparto, "M20Y")
 18.         assert !mi(anio_mon) if !mi(fecparto)
 19.         format  anio_mon %tm 
 20.         gen     anio_qtr = qofd(dofm(anio_mon))
 21.     format  anio_qtr %tq
 22.         gen     anio_sem = hofd(dofm(anio_mon))
 23.         format  anio_sem %th
 24.         
.         * Pregnancy vars
.         gen recomm_prenatal_numvisits = (totcons>5 & totcon!=99)
 25.         gen recomm_prenatal_1stvisit  = (semprim<13 & semprim!=97 & sempri
> m!=99)
 26.         gen no_prenatal_care          = (totcons==0 | totcon==99 | semprim
> ==97 | semprim==99)
 27.         gen first_pregnancy           = (numemban==0)
 28.         
.         * Add variable dpto coded as in the ECH
.         gen     dpto = depar   if inrange(depar,11,19)
 29.         replace dpto = 1       if depar==10
 30.         replace dpto = depar+1 if inrange(depar,1,9)
 31.         
.         * Labelling
.         lab def not_married               0 "Married"                1 "Not m
> arried"
 32.         lab val not_married               not_married
 33.         lab def no_partner                0 "With partner"           1 "Wi
> thout partner"
 34.         lab val no_partner                no_partner
 35.         lab def prim_school               0 "Less than PS"           1 "PS
>  or more"
 36.         lab val prim_school               prim_school
 37.         lab def high_school               0 "Less than HS"           1 "HS
>  or more"
 38.         lab val high_school               high_school
 39.         lab def no_prenatal_care          0 "No prenatal care"       1 "Pr
> enatal care"
 40.         lab val no_prenatal_care          no_prenatal_care
 41.         lab def first_pregnancy           0 "Not first pregnancy"    1 "Fi
> rst pregnancy"
 42.         lab val first_pregnancy           first_pregnancy
 43.         lab def recomm_prenatal_numvisits 0 "5 or less"              1 "Mo
> re than 5"
 44.         lab val recomm_prenatal_numvisits recomm_prenatal_numvisits
 45.         lab def recomm_prenatal_1stvisit  0 "1st visit by 14+ weeks" 1 "1s
> t visit by 13 weeks"
 46.         lab val recomm_prenatal_1stvisit  recomm_prenatal_1stvisit
 47.         label_depar
 48. 
.         save "..\output\births_derived.dta", replace
 49. end

. 
. program label_depar
  1.         label var    depar "Mother's residential state"
  2.         label define depar  1 "ARTIGAS" ///
>                                                 2 "CANELONES" ///
>                                                 3 "CERRO LARGO" ///
>                                                 4 "COLONIA" ///
>                                                 5 "DURAZNO" ///
>                                                 6 "FLORES" ///
>                                                 7 "FLORIDA" ///
>                                                 8 "LAVALLEJA" ///
>                                                 9 "MALDONADO" ///
>                                                 10 "MONTEVIDEO" ///
>                                                 11 "PAYSANDU" ///
>                                                 12 "RÍO NEGRO" ///
>                                                 13 "RIVERA" ///
>                                                 14 "ROCHA" ///
>                                                 15 "SALTO" ///
>                                                 16 "SAN JOSÉ" ///
>                                                 17 "SORIANO" ///
>                                                 18 "TACUAREMBÓ" ///
>                                                 19 "TREINTA Y TRES"
  3.         label values depar depar
  4. end

. 
. main
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_000001.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_000002.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_000003.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_000004.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_000005.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_000006.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_000007.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_000008.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_000009.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_00000a.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_00000b.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_00000c.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_00000d.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_00000e.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_00000f.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_00000g.tmp saved
file C:\Users\cravizza\AppData\Local\Temp\ST_3180_00000h.tmp saved
(note: variable fecparto was str6, now str7 to accommodate using data's
       values)
(note: variable fecparto was str7, now str8 to accommodate using data's
       values)
(1,247 observations deleted)
(note: file ..\temp\births_append.dta not found)
file ..\temp\births_append.dta saved
(2,651 real changes made)
(32,731 real changes made)
(31,821 real changes made)
(31,505 real changes made)
(32,843 real changes made)
(286,006 missing values generated)
(285,978 real changes made)
(28 missing values generated)
(28 missing values generated)
(617,773 missing values generated)
(326,317 real changes made)
(289,707 real changes made)
(note: file ..\output\births_derived.dta not found)
file ..\output\births_derived.dta saved

. 
end of do-file

 make.py ended: 2018-05-13 12:32:15
