
 make.py started: 2018-05-14 19:27:40 C:\Users\dgentil1\Desktop\aborto_uru_repo\Aborto-Uruguay\derived\code 




Execute:  "C:\Program Files (x86)\Stata14\StataSE-64.exe" /e do "./homogeneize_geo_vars.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401406206058
         Licensed to:  CIS Department
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./homogeneize_geo_vars.do 

. clear all

. set more off

. adopath + ../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata14\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata14\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../library/stata/gslab_misc/ado"

. 
. program main_homogeneize_geo_vars 
  1.         use ..\..\base\output\clean_1998_2016, clear
  2.         
.         fix_98_05
  3.         fix_2007
  4.         fix_2008
  5.         save ../temp/98_2011_loc_homo.dta, replace
  6.         
.         import excel ../../raw/lista_homogen_codes_geo.xlsx, sheet("Sheet1") 
> ///
>             cellrange(B1:F100) firstrow clear
  7.         rename (codigodpto localidad codigo98_2005 codigo_2006_2011 codigo
> _2012_2014) ///
>             (dpto nomloc2 loc98_05 loc loc12_14)
  8.     save ../temp/loc_xwalk.dta, replace
  9.         
.     homogeneize_loc_to_2012_2014
 10.                 
.         drop if missing(anio)
 11.         
.         replace ccz = ccz04 if anio == 2012
 12.         drop ccz04 ccz10
 13.         
.         tostring dpto, gen(dpto_string)
 14.         gen loc_code = dpto_string + loc
 15.         drop dpto_string
 16.         drop if substr(loc_code, -3,.) == "900" 
 17.         
.         destring loc_code, replace
 18.                 
.         save ..\temp\clean_loc_1998_2016.dta, replace
 19. end

. 
. program fix_98_05
  1.     * Montevideo
.         replace loc = "010" if inrange(anio, 1998, 2005) & loc == "0101"
  2. 
.         * Artigas
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0201"
  3.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "0202"
  4.         
.         * Canelones
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0302"
  5.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "0301"
  6.         replace loc = "023" if inrange(anio, 1998, 2005) & loc == "0303"  
>       
  7.         replace loc = "024" if inrange(anio, 1998, 2005) & loc == "0304"
  8.         replace loc = "422" if inrange(anio, 1998, 2005) & loc == "0305"
  9.         
.         * Cerro Largo
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0401"
 10.         replace loc = "522" if inrange(anio, 1998, 2005) & loc == "0402"
 11. 
.     * Colonia
.         replace loc = "320" if inrange(anio, 1998, 2005) & loc == "0501"
 12.         replace loc = "321" if inrange(anio, 1998, 2005) & loc == "0502"
 13.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "0503"  
>       
 14.         replace loc = "022" if inrange(anio, 1998, 2005) & loc == "0504"
 15.         replace loc = "023" if inrange(anio, 1998, 2005) & loc == "0505"
 16. 
.         * Durazno
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0601"
 17.         replace loc = "421" if inrange(anio, 1998, 2005) & loc == "0602"
 18. 
.         * Flores
.         replace loc = "320" if inrange(anio, 1998, 2005) & loc == "0701"
 19. 
.         * Florida
.         replace loc = "220" if inrange(anio, 1998, 2005) & loc == "0801"
 20.         replace loc = "421" if inrange(anio, 1998, 2005) & loc == "0802"
 21. 
.         * Lavalleja
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0901"
 22.         replace loc = "522" if inrange(anio, 1998, 2005) & loc == "0902"
 23. 
.     * Maldonado
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1001"
 24.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "1002"
 25.         replace loc = "022" if inrange(anio, 1998, 2005) & loc == "1003"  
>       
 26.         replace loc = "023" if inrange(anio, 1998, 2005) & loc == "1004"
 27.         replace loc = "024" if inrange(anio, 1998, 2005) & loc == "1005"
 28. 
.         * Paysandu
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1101"
 29.         replace loc = "521" if inrange(anio, 1998, 2005) & loc == "1102"
 30. 
.         * Rio Negro
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1201"
 31.         replace loc = "421" if inrange(anio, 1998, 2005) & loc == "1202"
 32.         
.     *Rivera
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1301"
 33.         replace loc = "522" if inrange(anio, 1998, 2005) & loc == "1302"
 34.         
.     *Rocha
.         replace loc = "320" if inrange(anio, 1998, 2005) & loc == "1401"
 35.         replace loc = "422" if inrange(anio, 1998, 2005) & loc == "1403"
 36.         replace loc = "521" if inrange(anio, 1998, 2005) & loc == "1404"
 37.         
.         * Salto
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1501"
 38. 
.     *San Jose
.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "1601"
 39.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1602"
 40.         replace loc = "022" if inrange(anio, 1998, 2005) & loc == "1603"
 41. 
.     *Soriano
.         replace loc = "220" if inrange(anio, 1998, 2005) & loc == "1701"
 42.         replace loc = "021" if inrange(anio, 1998, 2005) & loc == "1702"
 43. 
.     *Tacuarembo
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1801"
 44.         replace loc = "321" if inrange(anio, 1998, 2005) & loc == "1802"
 45. 
.     *Treinta y Tres
.         replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1901"
 46. end

. 
. program fix_2007        
  1.     replace loc = substr(loc, 3, 3) if anio == 2007
  2.         
.         * Montevideo
.         replace loc = "010" if anio == 2007 & loc == "020" & dpto == 1
  3. 
.         * Artigas
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 2
  4.         replace loc = "021" if anio == 2007 & loc == "621" & dpto == 2
  5.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 2
  6. 
.         * Canelones
.         replace loc = "020" if anio == 2007 & loc == "121" & dpto == 3
  7.         replace loc = "022" if anio == 2007 & loc == "222" & dpto == 3
  8.         replace loc = "023" if anio == 2007 & loc == "323" & dpto == 3
  9.         replace loc = "000" if anio == 2007 & loc == "528" & dpto == 3
 10.         
.         * Cerro Largo
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 4
 11.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 4
 12. 
.     * Colonia
.         replace loc = "021" if anio == 2007 & loc == "421" & dpto == 5
 13.         replace loc = "023" if anio == 2007 & loc == "323" & dpto == 5
 14.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 5
 15.         
.         * Durazno
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 6
 16.         replace loc = "000" if anio == 2007 & loc == "721" & dpto == 6
 17. 
.         * Flores
.         replace loc = "000" if anio == 2007 & loc == "721" & dpto == 7
 18. 
.         * Florida
.         replace loc = "000" if anio == 2007 & loc == "622" & dpto == 8
 19. 
.         * Lavalleja
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 9
 20.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 9
 21. 
.     * Maldonado
.         replace loc = "020" if anio == 2007 & loc == "320" & dpto == 10
 22.         replace loc = "021" if anio == 2007 & loc == "321" & dpto == 10
 23.         replace loc = "023" if anio == 2007 & loc == "523" & dpto == 10
 24.         replace loc = "024" if anio == 2007 & loc == "524" & dpto == 10
 25.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 10
 26. 
.         * Paysandu
.         replace loc = "020" if anio == 2007 & loc == "120" & dpto == 11
 27.         replace loc = "021" if anio == 2007 & loc == "822" & dpto == 11
 28.         replace loc = "000" if anio == 2007 & loc == "621" & dpto == 11
 29.         
.         * Rio Negro
.         replace loc = "020" if anio == 2007 & loc == "320" & dpto == 12
 30.         replace loc = "000" if anio == 2007 & loc == "621" & dpto == 12
 31.         
.     *Rivera
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 13
 32.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 13
 33.         
.     *Rocha
.         replace loc = "000" if anio == 2007 & loc == "722" & dpto == 14
 34.         
.         * Salto
.         replace loc = "020" if anio == 2007 & loc == "120" & dpto == 15
 35.         replace loc = "000" if anio == 2007 & loc == "522" & dpto == 15
 36. 
.     *San Jose
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 16
 37.         replace loc = "021" if anio == 2007 & loc == "321" & dpto == 16
 38.         replace loc = "022" if anio == 2007 & loc == "421" & dpto == 16
 39.         replace loc = "000" if anio == 2007 & loc == "621" & dpto == 16
 40. 
.     *Soriano
.         replace loc = "021" if anio == 2007 & loc == "321" & dpto == 17
 41.         replace loc = "091" if anio == 2007 & loc == "521" & dpto == 17
 42.         replace loc = "000" if anio == 2007 & loc == "622" & dpto == 17
 43. 
.     *Tacuarembo
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 18
 44.         replace loc = "000" if anio == 2007 & loc == "521" & dpto == 18
 45.         
.     *Treinta y Tres
.         replace loc = "020" if anio == 2007 & loc == "220" & dpto == 19
 46.         replace loc = "000" if anio == 2007 & loc == "790" & dpto == 19
 47.         
.         fill_missing_loc, dest_year(2007) ren_var(nomloc)
 48.         
.         merge m:1 anio dpto loc using ../temp/loc_2006.dta, nogen
 49.         
.         replace nomloc = nomloc2 if anio == 2007
 50.         drop nomloc2
 51. end

. 
. program fix_2008
  1.         fill_missing_loc, dest_year(2008) ren_var(loc)
  2.         
.         merge m:1 anio dpto nomloc using ../temp/loc_2006, nogen
  3.         
.         replace loc = loc2 if anio == 2008
  4.         drop loc2
  5. end

. 
. program fill_missing_loc
  1.     syntax, dest_year(str) ren_var(str)
  2.     
.         preserve 
  3.         keep if anio == 2006
  4.         keep anio dpto loc nomloc
  5.         duplicates drop anio dpto loc, force
  6.         replace anio = `dest_year'
  7.         rename `ren_var' `ren_var'2
  8.         save ../temp/loc_2006, replace
  9.         restore
 10. end

. 
. program homogeneize_loc_to_2012_2014
  1.         use ../temp/98_2011_loc_homo.dta, clear
  2.         
.         merge m:1 dpto loc using ../temp/loc_xwalk.dta
  3.         
.         replace loc = "000" if missing(loc)
  4.         
.         replace loc = loc12_14 if _merge == 3
  5.         replace nomloc = nomloc2
  6.         
.         drop _merge nomloc2 loc12_14 loc98_05
  7.         
.         replace loc = "000" if length(loc) < 5
  8.     
.     merge m:1 dpto loc using ../temp/loc_xwalk.dta
  9.     
.         replace loc = loc12_14 if _merge == 3
 10.         replace nomloc = nomloc2
 11.         
.         drop _merge nomloc2 loc12_14 loc98_05
 12. end

. 
. main_homogeneize_geo_vars
(238,595 real changes made)
(7,863 real changes made)
(3,840 real changes made)
(12,718 real changes made)
(30,695 real changes made)
(6,467 real changes made)
(3,652 real changes made)
(1,126 real changes made)
(6,487 real changes made)
(2,709 real changes made)
(5,940 real changes made)
(2,568 real changes made)
(680 real changes made)
(431 real changes made)
(2,116 real changes made)
(4,603 real changes made)
(1,235 real changes made)
(4,025 real changes made)
(3,824 real changes made)
(1,478 real changes made)
(6,127 real changes made)
(221 real changes made)
(10,192 real changes made)
(4,344 real changes made)
(1,535 real changes made)
(333 real changes made)
(167 real changes made)
(11,982 real changes made)
(173 real changes made)
(3,605 real changes made)
(2,718 real changes made)
(11,257 real changes made)
(1,302 real changes made)
(7,098 real changes made)
(1,330 real changes made)
(205 real changes made)
(12,609 real changes made)
(5,481 real changes made)
(3,786 real changes made)
(1,649 real changes made)
(6,279 real changes made)
(2,877 real changes made)
(7,321 real changes made)
(1,842 real changes made)
(5,415 real changes made)
(143,185 real changes made)
(57,520 real changes made)
(1,190 real changes made)
(452 real changes made)
(1,293 real changes made)
(3,155 real changes made)
(1,816 real changes made)
(1,171 real changes made)
(999 real changes made)
(1,982 real changes made)
(651 real changes made)
(774 real changes made)
(767 real changes made)
(620 real changes made)
(1,861 real changes made)
(555 real changes made)
(212 real changes made)
(688 real changes made)
(2,024 real changes made)
(272 real changes made)
(2,508 real changes made)
(999 real changes made)
(310 real changes made)
(437 real changes made)
(380 real changes made)
(3,344 real changes made)
(9 real changes made)
(553 real changes made)
(1,295 real changes made)
(486 real changes made)
(3,037 real changes made)
(462 real changes made)
(651 real changes made)
(3,667 real changes made)
(576 real changes made)
(3,077 real changes made)
(1,853 real changes made)
(778 real changes made)
(482 real changes made)
(776 real changes made)
(242 real changes made)
(408 real changes made)
(2,404 real changes made)
(416 real changes made)
(1,777 real changes made)
(250 real changes made)
(1,755,020 observations deleted)

Duplicates in terms of anio dpto loc

(256,765 observations deleted)
(96 real changes made)
(note: file ../temp/loc_2006.dta not found)
file ../temp/loc_2006.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,870,334
        from master                 1,870,319  
        from using                         15  

    matched                           141,562  
    -----------------------------------------
(141,577 real changes made)
(1,755,035 observations deleted)

Duplicates in terms of anio dpto loc

(256,765 observations deleted)
(96 real changes made)
file ../temp/loc_2006.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,867,335
        from master                 1,867,320  
        from using                         15  

    matched                           144,576  
    -----------------------------------------
(144,591 real changes made)
(note: file ../temp/98_2011_loc_homo.dta not found)
file ../temp/98_2011_loc_homo.dta saved
(note: file ../temp/loc_xwalk.dta not found)
file ../temp/loc_xwalk.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       383,151
        from master                   383,151  (_merge==1)
        from using                          0  (_merge==2)

    matched                         1,628,760  (_merge==3)
    -----------------------------------------
(358 real changes made)
(1,628,760 real changes made)
(838,922 real changes made)
(2,549 real changes made)

    Result                           # of obs.
    -----------------------------------------
    not matched                     2,009,090
        from master                 2,009,004  (_merge==1)
        from using                         86  (_merge==2)

    matched                             2,907  (_merge==3)
    -----------------------------------------
(2,907 real changes made)
(1,631,753 real changes made)
(86 observations deleted)
(120,462 real changes made)
dpto_string generated as str2
(128,522 observations deleted)
loc_code: all characters numeric; replaced as long
(note: file ..\temp\clean_loc_1998_2016.dta not found)
file ..\temp\clean_loc_1998_2016.dta saved

. 
end of do-file


Execute:  "C:\Program Files (x86)\Stata14\StataSE-64.exe" /e do "./prepare_for_analysis.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401406206058
         Licensed to:  CIS Department
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./prepare_for_analysis.do 

. clear all

. set more off

. adopath + ../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata14\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata14\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../library/stata/gslab_misc/ado"

. 
. program main_prepare_for_analysis 
  1.         use ..\temp\clean_loc_1998_2016.dta, clear
  2.         
.         fix_2012_weights
  3.         save ..\temp\clean_loc_1998_2016_fixed_weights.dta, replace
  4.         
.         import excel ..\..\raw\inflation.xlsx, sheet("Sheet1") firstrow clear
  5.         merge 1:m anio using ..\temp\clean_loc_1998_2016_fixed_weights.dta
> , nogen ///
>             assert(1 3)keep(3)
  6.         save ..\temp\clean_loc_1998_2016_fixed.dta, replace
  7. 
.     impute_poverty_lines_pre06
  8.         gen poor       = (y_hogar_alt <= lp_06)
  9.         gen indigente   = (y_hogar_alt <= li_06)
 10.         
.         gen ind_under14 = (nbr_under14>0)
 11.         
.         gen     semestre = 1 if inlist(trimestre, 1, 2)
 12.         replace semestre = 2 if inlist(trimestre, 3, 4)
 13.         gen     anio_sem = yh(anio, semestre)
 14.         format  anio_sem %th
 15.         gen     anio_qtr = yq(anio, trimestre)
 16.     format  anio_qtr %tq
 17. 
.         /*local outcomes = "trabajo horas_trabajo"
>         deseasonalize, outcomes(`outcomes')*/
.          
.         label_vars
 18.         drop if (missing(numero) | missing(pers) | missing(anio))
 19.         replace horas_trabajo = . if horas_trabajo >= 100
 20.     save_data ..\output\clean_loc_1998_2016.dta, key(numero pers anio) rep
> lace  
 21. end

. 
. program fix_2012_weights
  1.         keep if anio == 2013
  2.         replace anio = 2012 
  3.         
.         local by_vars "loc_code edad hombre estrato"
  4.         
.         rename (pesotri pesosem) (pesotri2 pesosem2)
  5.         collapse (mean) pesotri pesosem, by(`by_vars')
  6.         
.         save ..\temp\pesos_2012_imputed.dta, replace
  7. 
.         use ..\temp\clean_loc_1998_2016.dta, clear
  8. 
.         merge m:1 `by_vars' using ..\temp\pesos_2012_imputed.dta, nogen
  9.         replace pesotri = pesotri2 if anio == 2012
 10.         replace pesosem = pesosem2 if anio == 2012
 11.         
.         drop pesotri2 pesosem2
 12. end

. 
. program impute_poverty_lines_pre06
  1.         keep if anio == 2006
  2.         
.         forval year=1998/2005 {
  3.             replace anio = `year' 
  4.         
.             local by_vars " trimestre loc_code nbr_above14 nbr_people"
  5.         
.             rename (lp_06 li_06) (lp_06_2 li_06_2)
  6.             collapse (mean) lp_06_2 li_06_2, by(`by_vars')
  7.         
.             save ..\temp\poverty_`year'_imputed.dta, replace
  8. 
.             use ..\temp\clean_loc_1998_2016_fixed.dta, clear
  9. 
.             merge m:1 `by_vars' using ..\temp\poverty_`year'_imputed.dta, nog
> en
 10.             replace lp_06 = lp_06_2 if anio == `year'
 11.             replace li_06 = li_06_2 if anio == `year'
 12.         
.             drop lp_06_2 li_06_2
 13.                 replace lp_06 = (lp_06 * cpi_2006)/100 if anio == `year'
 14.                 replace li_06 = (li_06 * cpi_2006)/100 if anio == `year'
 15.             save ..\temp\clean_loc_1998_2016_fixed.dta, replace
 16.         }
 17. end

. 
. program deseasonalize  
  1.     syntax, outcomes(str)
  2.         
.         levelsof dpto, local(dptos)
  3.         
.         foreach outcome in `outcomes' {
  4.                 gen `outcome'_des = `outcome'
  5.         }
  6.         
.         foreach dpto of local dptos {
  7.                 foreach outcome in `outcomes' {
  8. 
.                         qui sum `outcome' if anio < 2004 & dpto == `dpto' [aw
>  = pesotri]
  9.                         local mean = r(mean)
 10.                         
.                         reg `outcome' i.trimestre if anio < 2004 & dpto == `d
> pto' [aw = pesotri]
 11.                         predict p_`outcome', resid
 12.                         
.                         replace `outcome'_des = p_`outcome' + `mean' if anio 
> < 2004 & dpto == `dpto'
 13.                         drop p_`outcome'
 14.                         
.                         qui sum `outcome' if anio >= 2004 & dpto == `dpto' [a
> w = pesotri]
 15.                         local mean = r(mean)
 16.                         
.                         reg `outcome' i.trimestre if anio >= 2004 & dpto == `
> dpto' [aw = pesotri]
 17.                         predict p_`outcome', resid
 18.                         
.                         replace `outcome'_des = p_`outcome' + `mean' if anio 
> >= 2004 & dpto == `dpto'
 19.                         drop p_`outcome'        
 20.                 }
 21.         }
 22. end

. 
. program label_vars
  1.     label var trabajo "Employment"
  2.         label var horas_trabajo "Hours worked"
  3.         label var  educ_level "Educational attainment"
  4.         label define educ_level 1 "Primary school" 2 "High school" 3 "Post
> -secondary"
  5.         label values educ_level educ_level
  6.     
.         gen educ_more_HS = (educ_level == 3)
  7.         gen educ_HS_or_more = (educ_level == 2 | educ_level == 3 )
  8.         
.         label var  educ_more_HS "College"
  9.         label var educ_HS_or_more "High-school"
 10.         label define educ_HS_or_more 0 "HS degree or less" 1 "More than HS
>  diploma"
 11.         label values educ_HS_or_more educ_HS_or_more
 12. end

. 
. main_prepare_for_analysis
(1,761,666 observations deleted)
(121,723 real changes made)
(note: file ..\temp\pesos_2012_imputed.dta not found)
file ..\temp\pesos_2012_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       513,489
        from master                   513,489  
        from using                          0  

    matched                         1,369,900  
    -----------------------------------------
variable pesotri was int now float
(113,170 real changes made)
variable pesosem was int now float
(113,170 real changes made)
(note: file ..\temp\clean_loc_1998_2016_fixed_weights.dta not found)
file ..\temp\clean_loc_1998_2016_fixed_weights.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(note: file ..\temp\clean_loc_1998_2016_fixed.dta not found)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,673,485 observations deleted)
(209,904 real changes made)
(note: file ..\temp\poverty_1998_imputed.dta not found)
file ..\temp\poverty_1998_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        73,548
        from master                    73,548  
        from using                          0  

    matched                         1,809,841  
    -----------------------------------------
(53,822 real changes made)
variable li_06 was int now float
(53,822 real changes made)
(53,822 real changes made)
(53,822 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,825,715 real changes made)
(note: file ..\temp\poverty_1999_imputed.dta not found)
file ..\temp\poverty_1999_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(56,882 real changes made)
(56,882 real changes made)
(56,882 real changes made)
(56,882 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,825,405 real changes made)
(note: file ..\temp\poverty_2000_imputed.dta not found)
file ..\temp\poverty_2000_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(57,119 real changes made)
(57,119 real changes made)
(57,119 real changes made)
(57,119 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,825,979 real changes made)
(note: file ..\temp\poverty_2001_imputed.dta not found)
file ..\temp\poverty_2001_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(56,694 real changes made)
(56,694 real changes made)
(56,694 real changes made)
(56,694 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,827,056 real changes made)
(note: file ..\temp\poverty_2002_imputed.dta not found)
file ..\temp\poverty_2002_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(55,626 real changes made)
(55,626 real changes made)
(55,626 real changes made)
(55,626 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,828,020 real changes made)
(note: file ..\temp\poverty_2003_imputed.dta not found)
file ..\temp\poverty_2003_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(54,650 real changes made)
(54,650 real changes made)
(54,650 real changes made)
(54,650 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,827,802 real changes made)
(note: file ..\temp\poverty_2004_imputed.dta not found)
file ..\temp\poverty_2004_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(54,842 real changes made)
(54,842 real changes made)
(54,842 real changes made)
(54,842 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,829,059 real changes made)
(note: file ..\temp\poverty_2005_imputed.dta not found)
file ..\temp\poverty_2005_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,389  
    -----------------------------------------
(53,665 real changes made)
(53,665 real changes made)
(53,665 real changes made)
(53,665 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(940,066 missing values generated)
(940,036 real changes made)
(30 missing values generated)
(30 missing values generated)
(30 observations deleted)
(0 real changes made)
(data now sorted by numero pers anio)
  variable D was int now byte
  variable poor was float now byte
  variable indigente was float now byte
  variable ind_under14 was float now byte
  variable semestre was float now byte
  variable anio_sem was float now int
  variable anio_qtr was float now int
  variable educ_more_HS was float now byte
  variable educ_HS_or_more was float now byte
  variable nomloc was str104 now str25
  (192,102,618 bytes saved)
===============================================================================
> ===================
File: ..\output\clean_loc_1998_2016.dta
Key: numero pers anio
===============================================================================
> ===================
  1883359:87(54556):1505934829:2712410429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      numero |  1,883,359    7.60e+08    9.76e+08          1   2.02e+09
        pers |  1,883,359    2.394438    1.518967          1         27
        anio |  1,883,359    2008.397    4.955544       1998       2016
   inflation |  1,883,359    8.059518    3.511445       3.59      25.94
    cpi_2006 |  1,883,359    127.7388    47.60945   48.00595   217.6432
-------------+---------------------------------------------------------
           D |          0
      semana |    172,515    24.40658    13.83848          1         48
        dpto |  1,883,359    5.628493    5.786107          1         19
        secc |  1,730,305    9.574802    16.53152          0         99
        segm |  1,730,305    61.89583    92.34555          0        845
-------------+---------------------------------------------------------
     estrato |  1,883,359    5.493579    2.938851          1         12
      hombre |  1,883,359    .4683451    .4989971          0          1
        edad |  1,883,359    36.69205      23.473          0         99
horas_trab~o |  1,883,359    17.37756    22.42278          0         99
       pf133 |    172,515    .8011535    .9642651          0          2
-------------+---------------------------------------------------------
busca_trab~o |  1,883,359    .0717808    .2581247          0          1
meses_trab~o |  1,604,330    .9877718    3.921998          0         80
anios_trab~o |  1,604,330    3.595143    7.810929          0         98
      ytotal |  1,883,359     8964.04    17117.79          0    7244333
     pesotri |  1,882,057    112.2817    54.20272          1       1527
-------------+---------------------------------------------------------
     pesosem |  1,770,327    55.96034    28.39956          3       1345
      pesoan |  1,883,359    28.17216    13.90841          1       1323
         ccz |  1,799,390     4.17659    5.575275          0         18
         loc |          0
      nomloc |          0
-------------+---------------------------------------------------------
  nbr_people |  1,883,359    3.788646    1.892628          1         27
 nbr_above14 |  1,883,359     2.79023    1.261887          1         16
 nbr_under14 |  1,883,359    .9982621    1.287069          0         14
     y_hogar |  1,883,359    27941.29    35277.56          0    7681180
  educ_level |  1,883,359    1.300751    .5889926          1          3
-------------+---------------------------------------------------------
  estudiante |  1,883,359    .0682754    .2522179          0          1
c98_resid_~e |  1,883,359    .9953339    .0681495          0          1
c98_resid_~d |  1,883,359    .6481754    .4775397          0          1
c98_nbr_ro~s |  1,883,359    3.574185    1.311901          0         80
c98_nbr_be~s |  1,883,359    2.195518    .8372686          0         40
-------------+---------------------------------------------------------
c98_b_pipe~r |  1,883,359     .964987    .1838126          0          1
c98_hhld_t~t |  1,883,359    .9230901    .2664485          0          1
c98_b_sewage |  1,883,359    .6018704    .4895126          0          1
c98_hhld_s~e |  1,883,359    .9487071    .2205946          0          1
c98_hhld_h~r |  1,883,359    .8767718    .3286991          0          1
-------------+---------------------------------------------------------
c98_hhld_r~t |  1,883,359    .8439952      .36286          0          1
 c98_hhld_tv |  1,883,359    .9618586    .1915377          0          1
c98_hhld_vcr |  1,883,359    .4869757    .4998305          0          1
c98_hhld_w~c |  1,883,359    .7094054    .4540369          0          1
c98_hhld_d~r |  1,883,359    .0426716    .2021158          0          1
-------------+---------------------------------------------------------
c98_hhld_m~e |  1,883,359    .4803296    .4996131          0          1
c98_hhld_car |  1,883,359    .3550953    .4785423          0          1
     married |  1,593,343    .5195686    .4996171          0          1
 y_hogar_alt |  1,883,359    28126.23       32692          0    7289481
   trimestre |  1,883,359    2.497607    1.117068          1          4
-------------+---------------------------------------------------------
     trabajo |  1,883,359    .4188713    .4933744          0          1
       etnia |  1,431,815    2.291282    .9704217          0          4
         mes |  1,710,844    6.493153    3.444643          1         12
          e9 |    279,029    1.656792    .5465739          0          2
c01_hhld_c~r |  1,710,844    .5257364    .4993373          0          1
-------------+---------------------------------------------------------
c01_hhld_i~t |  1,710,844    .3633762     .480972          0          1
c01_hhld_p~e |  1,710,844    .7214872    .4482673          0          1
c01_hhld_c~v |  1,710,844    .5669482    .4954978          0          1
    region_3 |  1,431,815    1.683245    .6382833          1          3
    region_4 |  1,431,815    1.683762    .6397525          1          4
-------------+---------------------------------------------------------
        afro |    475,334     .014413    .1191861          0          1
        asia |    475,334    .0009278    .0304452          0          1
      blanco |    475,334    .8583543    .3486867          0          1
    indigena |    475,334    .0027202    .0520845          0          1
 live_births |  1,186,134    .7562409      .73836          0          2
-------------+---------------------------------------------------------
live_birth~r |  1,186,134    1.054584    1.754446          0         72
         e48 |    209,904    1.716394      .45077          0          2
       li_06 |  1,875,115    1621.162    582.8108   363.3281       3021
       lp_06 |  1,875,115     16985.2    9365.428   1585.694   132026.8
c06_mat_wa~s |  1,431,815    .9736006    .1603198          0          1
-------------+---------------------------------------------------------
c06_mat_roof |  1,431,815    .5676362    .4954044          0          1
c06_mat_fl~r |  1,431,815    .7911539    .4064844          0          1
c06_b_electr |  1,431,815    .9961147    .0622108          0          1
     mestizo |    475,334    .1188638    .3236285          0          1
        otro |    475,334    .0047209    .0685464          0          1
-------------+---------------------------------------------------------
         e50 |    265,430    1.720412    .4487975          1          2
 ascendencia |    956,481    2.933281    .4111345          1          5
         e49 |    956,481    1.213831     .410014          0          2
    loc_code |  1,883,359    574042.5    585552.4     101010    1931000
        poor |  1,883,359    .3719832    .4833341          0          1
-------------+---------------------------------------------------------
   indigente |  1,883,359    .0128812    .1127622          0          1
 ind_under14 |  1,883,359    .5156978    .4997537          0          1
    semestre |  1,883,359    1.499127    .4999994          1          2
    anio_sem |  1,883,359    97.29315    9.924085         76        113
    anio_qtr |  1,883,359    195.0857    19.85452        152        227
-------------+---------------------------------------------------------
educ_more_HS |  1,883,359    .0683061    .2522706          0          1
educ_HS_or~e |  1,883,359    .2324448    .4223912          0          1




(note: file ..\output\clean_loc_1998_2016.dta not found)
file ..\output\clean_loc_1998_2016.dta saved

. 
end of do-file


Execute:  "C:\Program Files (x86)\Stata14\StataSE-64.exe" /e do "./population.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401406206058
         Licensed to:  CIS Department
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./population.do 

. * Note: since the locals created in the beginning are used several times in t
> he 
. * code, I did not create different programs (alternative: create globals?)
. 
. * Setting up locals that describe the 6 tables in each worksheet
. local S_all   = 0

. local S_men   = 22

. local S_women = 44

. 
. * Create the cell range for each of the 6 tables in each worksheet
. foreach gender in all men women {
  2.         local S0_`gender' = 8 + `S_`gender''
  3.         local S1_`gender' = `S0_`gender''+2
  4.         local E1_`gender' = `S0_`gender''+2+18
  5.         local cr1_`gender' = "A`S0_`gender'':Z`S0_`gender''"
  6.         local cr2_`gender' = "A`S1_`gender'':Z`E1_`gender''"
  7. }

. 
. * Get names and number of worksheets to be later used as indicators
. import excel "..\..\raw\Departamentos_poblacion_por_sexo_y_edad_1996-2025.xls
> " , describe

                Sheet | Range
  --------------------+--------------------
                 Nota | A1:L35
  Sexo y Departamento | A1:AE74
           Montevideo | A1:BD76
              Artigas | A1:BD76
            Canelones | A1:BD76
          Cerro Largo | A1:BD76
              Colonia | A1:BD76
              Durazno | A1:BD76
               Flores | A1:BD76
              Florida | A1:BD76
            Lavalleja | A1:BD76
            Maldonado | A1:BD76
            Paysandú | A1:BD76
           Río Negro | A1:BD76
               Rivera | A1:BD76
                Rocha | A1:BD76
                Salto | A1:BD76
            San José | A1:BD76
              Soriano | A1:BD76
          Tacuarembó | A1:BD76
       Treinta y Tres | A1:BD76
               Hoja21 | 

. local ws_N = `r(N_worksheet)'-1

. local ws_1 = 3

. 
. forvalues ws = `ws_1'/`ws_N' {
  2.         local ws_`ws'_name = "`r(worksheet_`ws')'"
  3.         local ws_`ws'_nbr  = `ws'
  4.         if `ws'==3 {
  5.                 local ws_`ws'_dpto = 10 //Mvd
  6.         }
  7.         else if inrange(`ws',4,12) { 
  8.                 local ws_`ws'_dpto = `ws'-3 // Alphabetically prior to Mvd
  9.         }
 10.         else {
 11.                 local ws_`ws'_dpto = `ws'-2
 12.         }
 13.         *I wanted to create a label for depar with the local below, but it
> 's hard to add the double quotes
.         *local depar = " `depar' " + " `ws_`ws'_dpto' " + `" `=char(34)' "' +
>  "`ws_`ws'_name'" //+ "`ws_`ws'_name'" 
. }

. 
. * Import the 6 tables from each worksheet and create the relevant variables 
. forvalues ws = `ws_1'/`ws_N' {
  2.         foreach gender in all men women {
  3.                 foreach cr in 1 2 {
  4.                         import excel "..\..\raw\Departamentos_poblacion_po
> r_sexo_y_edad_1996-2025.xls" ///
>                          , clear sheet("`ws_`ws'_name'") cellrange(`cr`cr'_`g
> ender'')
  5.                         
.                         gen depar = `ws_`ws'_dpto'
  6.                         gen gender_all = "`gender'"
  7.                         
.                         if "`cr'" == "1" {
  8.                                 gen age_min    = 0
  9.                                 gen age_max    = 99
 10.                                 gen all_ages   = 1
 11.                         }
 12.                         else {          
 13.                                 qui replace A="90-99" if A=="90 y más"
 14.                                 gen splitat    = strpos(A,"-")  
 15.                                 gen age_min    = substr(A,1,splitat-1)
 16.                                 gen age_max    = substr(A,splitat+1,.)
 17.                                 qui destring age_min age_max, replace
 18.                                 drop splitat
 19.                                 gen all_ages   = 0
 20.                         }
 21.                         
.                         tempfile pop_`ws_`ws'_nbr'_`gender'_`cr'
 22.                         save `pop_`ws_`ws'_nbr'_`gender'_`cr''
 23.                         
.                         di "*******"
 24.                         di "pop_`ws_`ws'_nbr'_`gender'_`cr'"
 25.                         di "*******"
 26.                 }
 27.         }
 28. }
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000001.tmp saved
*******
pop_3_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000002.tmp saved
*******
pop_3_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000003.tmp saved
*******
pop_3_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000004.tmp saved
*******
pop_3_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000005.tmp saved
*******
pop_3_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000006.tmp saved
*******
pop_3_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000007.tmp saved
*******
pop_4_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000008.tmp saved
*******
pop_4_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000009.tmp saved
*******
pop_4_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000a.tmp saved
*******
pop_4_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000b.tmp saved
*******
pop_4_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000c.tmp saved
*******
pop_4_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000d.tmp saved
*******
pop_5_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000e.tmp saved
*******
pop_5_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000f.tmp saved
*******
pop_5_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000g.tmp saved
*******
pop_5_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000h.tmp saved
*******
pop_5_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000i.tmp saved
*******
pop_5_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000j.tmp saved
*******
pop_6_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000k.tmp saved
*******
pop_6_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000l.tmp saved
*******
pop_6_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000m.tmp saved
*******
pop_6_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000n.tmp saved
*******
pop_6_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000o.tmp saved
*******
pop_6_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000p.tmp saved
*******
pop_7_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000q.tmp saved
*******
pop_7_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000r.tmp saved
*******
pop_7_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000s.tmp saved
*******
pop_7_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000t.tmp saved
*******
pop_7_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000u.tmp saved
*******
pop_7_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000v.tmp saved
*******
pop_8_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000w.tmp saved
*******
pop_8_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000x.tmp saved
*******
pop_8_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000010.tmp saved
*******
pop_8_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000011.tmp saved
*******
pop_8_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000012.tmp saved
*******
pop_8_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000013.tmp saved
*******
pop_9_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000014.tmp saved
*******
pop_9_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000015.tmp saved
*******
pop_9_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000016.tmp saved
*******
pop_9_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000017.tmp saved
*******
pop_9_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000018.tmp saved
*******
pop_9_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000019.tmp saved
*******
pop_10_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001a.tmp saved
*******
pop_10_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001b.tmp saved
*******
pop_10_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001c.tmp saved
*******
pop_10_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001d.tmp saved
*******
pop_10_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001e.tmp saved
*******
pop_10_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001f.tmp saved
*******
pop_11_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001g.tmp saved
*******
pop_11_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001h.tmp saved
*******
pop_11_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001i.tmp saved
*******
pop_11_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001j.tmp saved
*******
pop_11_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001k.tmp saved
*******
pop_11_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001l.tmp saved
*******
pop_12_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001m.tmp saved
*******
pop_12_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001n.tmp saved
*******
pop_12_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001o.tmp saved
*******
pop_12_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001p.tmp saved
*******
pop_12_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001q.tmp saved
*******
pop_12_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001r.tmp saved
*******
pop_13_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001s.tmp saved
*******
pop_13_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001t.tmp saved
*******
pop_13_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001u.tmp saved
*******
pop_13_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001v.tmp saved
*******
pop_13_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001w.tmp saved
*******
pop_13_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00001x.tmp saved
*******
pop_14_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000020.tmp saved
*******
pop_14_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000021.tmp saved
*******
pop_14_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000022.tmp saved
*******
pop_14_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000023.tmp saved
*******
pop_14_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000024.tmp saved
*******
pop_14_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000025.tmp saved
*******
pop_15_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000026.tmp saved
*******
pop_15_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000027.tmp saved
*******
pop_15_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000028.tmp saved
*******
pop_15_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000029.tmp saved
*******
pop_15_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002a.tmp saved
*******
pop_15_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002b.tmp saved
*******
pop_16_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002c.tmp saved
*******
pop_16_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002d.tmp saved
*******
pop_16_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002e.tmp saved
*******
pop_16_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002f.tmp saved
*******
pop_16_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002g.tmp saved
*******
pop_16_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002h.tmp saved
*******
pop_17_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002i.tmp saved
*******
pop_17_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002j.tmp saved
*******
pop_17_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002k.tmp saved
*******
pop_17_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002l.tmp saved
*******
pop_17_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002m.tmp saved
*******
pop_17_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002n.tmp saved
*******
pop_18_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002o.tmp saved
*******
pop_18_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002p.tmp saved
*******
pop_18_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002q.tmp saved
*******
pop_18_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002r.tmp saved
*******
pop_18_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002s.tmp saved
*******
pop_18_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002t.tmp saved
*******
pop_19_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002u.tmp saved
*******
pop_19_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002v.tmp saved
*******
pop_19_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002w.tmp saved
*******
pop_19_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00002x.tmp saved
*******
pop_19_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000030.tmp saved
*******
pop_19_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000031.tmp saved
*******
pop_20_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000032.tmp saved
*******
pop_20_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000033.tmp saved
*******
pop_20_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000034.tmp saved
*******
pop_20_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000035.tmp saved
*******
pop_20_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000036.tmp saved
*******
pop_20_women_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000037.tmp saved
*******
pop_21_all_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000038.tmp saved
*******
pop_21_all_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000039.tmp saved
*******
pop_21_men_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00003a.tmp saved
*******
pop_21_men_2
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00003b.tmp saved
*******
pop_21_women_1
*******
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00003c.tmp saved
*******
pop_21_women_2
*******

. 
. * Append all tables
. use `pop_`ws_1'_all_1', clear

. forvalues ws = `ws_1'/`ws_N' {
  2.         foreach gender in all men women {
  3.                 foreach cr in 1 2 {
  4.                         if "`ws_`ws'_nbr'_`gender'_`cr'" == "`ws_1'_all_1"
>  {
  5.                                 continue
  6.                         }
  7.                         else {
  8.                                 append using `pop_`ws_`ws'_nbr'_`gender'_`
> cr''
  9.                         }
 10.                 }
 11.         }
 12. }
(note: variable gender_all was str3, now str5 to accommodate using data's
       values)

. 
. * Check and rename year variables
. isid depar gender_all age_min age_max

. drop A

. local year = 1996

. foreach k in `c(ALPHA)' {
  2.         if "`k'" == "A" {
  3.                 continue
  4.         }
  5.         else {
  6.                 rename `k' pop`year'
  7.                 local year = `year' + 1
  8.         }
  9. }

. 
. * Reshape, aggregate dy depto, and save table
. reshape long pop, i(depar gender_all age_min age_max) j(anio)
(note: j = 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 200
> 9 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1140   ->   28500
Number of variables                  30   ->       7
j variable (25 values)                    ->   anio
xij variables:
            pop1996 pop1997 ... pop2020   ->   pop
-----------------------------------------------------------------------------

. save "..\output\population.dta", replace
(note: file ..\output\population.dta not found)
file ..\output\population.dta saved

. 
. * Collapse to women of fertile age and save table
. gen fertile_age = (gender_all=="women" & age_min>=15 & age_max<45 & all_ages=
> =0)

. collapse (sum) pop if all_ages==0 & fertile_age==1, by(depar anio age_min age
> _max)

. 
. save "..\output\population_fertile_age.dta", replace
(note: file ..\output\population_fertile_age.dta not found)
file ..\output\population_fertile_age.dta saved

. 
end of do-file


Execute:  "C:\Program Files (x86)\Stata14\StataSE-64.exe" /e do "./vital_records.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401406206058
         Licensed to:  CIS Department
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./vital_records.do 

. clear all

. set more off

. 
. program main    
  1.         append_data
  2.         derived_data
  3. end

. 
. program append_data
  1.         * Note: there is no 1998 data, but there is data for 1996 and 1997
.         forvalues year = 1999/2015 {
  2.                 capture import delimited "..\..\raw\vital_records\Natalida
> d `year'_p.csv", delim(";") clear
  3.                 
.                 *capture rename (civilm  civilp  instm   instp) (mestciv pest
> civ mademay pademay)
.                                                  
.                 qui destring , replace
  4.                 
.                 tempfile temp_`year'
  5.                 save `temp_`year''
  6.         }
  7. 
.         forvalues year = 1999/2014 {
  8.                 append using `temp_`year''
  9.         }
 10. 
.         keep if inrange(anio_parto,1999,2015) //note some births in 2015 are 
> recorded in 2016
 11.         assert !mi(edadm)
 12.         *keep if inrange(edadm,16,45)
.         
.         save "..\temp\births_append.dta", replace
 13. end

. 
. program derived_data
  1.         use "..\temp\births_append.dta", clear
  2.         rename anio_parto anio
  3. 
.         * Assert that corresponding variables are not used at the same time &
>  Gen harmonized vars
.         * Note: issue with mademay == 4 : table anio madeult if mademay == 4
.         assert (mi(civilm) & !mi(mestciv) & !mi(tunion)) | (!mi(civilm) & mi(
> mestciv) & mi(tunion))
  4.         assert (mi(instm) & !mi(mademay) & !mi(madecur) & !mi(madeult)) | 
> (!mi(instm) & mi(mademay) & mi(madecur) & mi(madeult))
  5.         gen married = (civilm==2 | mestciv==2)
  6.         gen not_married = (married==0)
  7.         gen partner = (civilm==2|civilm==3|mestciv==2|(convpad==1 & (tunio
> n==1|tunion==2)))
  8.         gen no_partner = (partner==0)
  9.         gen prim_school = (instm==2 | ((mademay==2 & madeult==6) | (madema
> y==4 & madeult<3) | mademay==3))
 10.         gen high_school = (instm==3 | ((mademay==4 & madeult==3) | (madema
> y==5 & madeult==1)))
 11.         replace high_school = 1 if inrange(anio,2008,2010) & mademay==4 & 
> madeult==6
 12.         
.         * Birth date
.         replace fecparto = "jan" + substr(fecparto,4, .) if substr(fecparto, 
> 1, 3) == "ene"
 13.         replace fecparto = "apr" + substr(fecparto,4, .) if substr(fecpart
> o, 1, 3) == "abr"
 14.         replace fecparto = "aug" + substr(fecparto,4, .) if substr(fecpart
> o, 1, 3) == "ago"
 15.         replace fecparto = "dec" + substr(fecparto,4, .) if substr(fecpart
> o, 1, 3) == "dic"
 16.         gen     anio_mon = monthly(fecparto, "MY")
 17.         replace anio_mon = monthly(fecparto, "M20Y")
 18.         assert !mi(anio_mon) if !mi(fecparto)
 19.         format  anio_mon %tm 
 20.         gen     anio_qtr = qofd(dofm(anio_mon))
 21.     format  anio_qtr %tq
 22.         gen     anio_sem = hofd(dofm(anio_mon))
 23.         format  anio_sem %th
 24.         
.         * Pregnancy vars
.         gen recomm_prenatal_numvisits = (totcons>5 & totcon!=99)
 25.         gen recomm_prenatal_1stvisit  = (semprim<13 & semprim!=97 & sempri
> m!=99)
 26.         gen no_prenatal_care          = (totcons==0 | totcon==99 | semprim
> ==97 | semprim==99)
 27.         gen first_pregnancy           = (numemban==0)
 28.         
.         * Add variable dpto coded as in the ECH
.         gen     dpto = depar   if inrange(depar,11,19)
 29.         replace dpto = 1       if depar==10
 30.         replace dpto = depar+1 if inrange(depar,1,9)
 31.         
.         * Labelling
.         lab def not_married               0 "Married"                1 "Not m
> arried"
 32.         lab val not_married               not_married
 33.         lab def no_partner                0 "With partner"           1 "Wi
> thout partner"
 34.         lab val no_partner                no_partner
 35.         lab def prim_school               0 "Less than PS"           1 "PS
>  or more"
 36.         lab val prim_school               prim_school
 37.         lab def high_school               0 "Less than HS"           1 "HS
>  or more"
 38.         lab val high_school               high_school
 39.         lab def no_prenatal_care          0 "No prenatal care"       1 "Pr
> enatal care"
 40.         lab val no_prenatal_care          no_prenatal_care
 41.         lab def first_pregnancy           0 "Not first pregnancy"    1 "Fi
> rst pregnancy"
 42.         lab val first_pregnancy           first_pregnancy
 43.         lab def recomm_prenatal_numvisits 0 "5 or less"              1 "Mo
> re than 5"
 44.         lab val recomm_prenatal_numvisits recomm_prenatal_numvisits
 45.         lab def recomm_prenatal_1stvisit  0 "1st visit by 14+ weeks" 1 "1s
> t visit by 13 weeks"
 46.         lab val recomm_prenatal_1stvisit  recomm_prenatal_1stvisit
 47.         label_depar
 48. 
.         save "..\output\births_derived.dta", replace
 49. end

. 
. program label_depar
  1.         label var    depar "Mother's residential state"
  2.         label define depar  1 "ARTIGAS" ///
>                                                 2 "CANELONES" ///
>                                                 3 "CERRO LARGO" ///
>                                                 4 "COLONIA" ///
>                                                 5 "DURAZNO" ///
>                                                 6 "FLORES" ///
>                                                 7 "FLORIDA" ///
>                                                 8 "LAVALLEJA" ///
>                                                 9 "MALDONADO" ///
>                                                 10 "MONTEVIDEO" ///
>                                                 11 "PAYSANDU" ///
>                                                 12 "RÍO NEGRO" ///
>                                                 13 "RIVERA" ///
>                                                 14 "ROCHA" ///
>                                                 15 "SALTO" ///
>                                                 16 "SAN JOSÉ" ///
>                                                 17 "SORIANO" ///
>                                                 18 "TACUAREMBÓ" ///
>                                                 19 "TREINTA Y TRES"
  3.         label values depar depar
  4. end

. 
. main
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000001.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000002.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000003.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000004.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000005.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000006.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000007.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000008.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a000009.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000a.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000b.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000c.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000d.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000e.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000f.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000g.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0a00000h.tmp saved
(note: variable fecparto was str6, now str7 to accommodate using data's
       values)
(note: variable fecparto was str7, now str8 to accommodate using data's
       values)
(1,247 observations deleted)
(note: file ..\temp\births_append.dta not found)
file ..\temp\births_append.dta saved
(2,651 real changes made)
(32,731 real changes made)
(31,821 real changes made)
(31,505 real changes made)
(32,843 real changes made)
(286,006 missing values generated)
(285,978 real changes made)
(28 missing values generated)
(28 missing values generated)
(617,773 missing values generated)
(326,317 real changes made)
(289,707 real changes made)
(note: file ..\output\births_derived.dta not found)
file ..\output\births_derived.dta saved

. 
end of do-file

 make.py ended: 2018-05-14 19:33:04
