
 make.py started: 2020-04-01 08:00:55 C:\Users\diegog\Desktop\Diego\Aborto-Uruguay\derived\code 




Execute:  StataMP-64 /e do "./homogeneize_geo_vars.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./homogeneize_geo_vars.do 

. clear all

. set more off

. adopath + ../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../library/stata/gslab_misc/ado"

. 
. program main 
  1.     use ../../base\output\clean_1998_2016, clear
  2.     
.     convert_98_05_to_06_11_cod
  3.     convert_07_to_06_11_cod
  4.     fill_missing_loc_var, year(2007) loc_var(nomloc) merge_var(loc)
  5.     fill_missing_loc_var, year(2008) loc_var(loc) merge_var(nomloc)
  6.     save ../temp/1998_2011_loc_homo.dta, replace
  7.     
.     homogeneize_loc_to_2012_2014    
  8.     replace ccz = ccz04 if anio == 2012
  9.     drop ccz04 ccz10
 10.     
.     tostring dpto, gen(dpto_string)
 11.     replace dpto_string = "0" + dpto_string if  dpto < 10
 12.     gen loc_code = dpto_string + loc
 13.     drop dpto_string
 14.     
.     destring loc_code, gen(loc_code_destring)
 15.     drop_rural_areas
 16.     drop loc_code_destring loc
 17.     
.     drop if missing(loc_code)
 18.     drop if (missing(anio) | missing(numero) | missing(pers))
 19. 
.     save_data ../temp/clean_loc_1998_2016.dta, key(numero pers anio) replace
 20. end

. 
. program convert_98_05_to_06_11_cod
  1.     * Montevideo
.     replace loc = "010" if inrange(anio, 1998, 2005) & loc == "0101"
  2. 
.     * Artigas
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0201"
  3.     replace loc = "021" if inrange(anio, 1998, 2005) & loc == "0202"
  4.     
.     * Canelones
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0302"
  5.     replace loc = "021" if inrange(anio, 1998, 2005) & loc == "0301"
  6.     replace loc = "023" if inrange(anio, 1998, 2005) & loc == "0303"    
  7.     replace loc = "024" if inrange(anio, 1998, 2005) & loc == "0304"
  8.     replace loc = "422" if inrange(anio, 1998, 2005) & loc == "0305"
  9.     
.     * Cerro Largo
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0401"
 10.     replace loc = "522" if inrange(anio, 1998, 2005) & loc == "0402"
 11. 
.     * Colonia
.     replace loc = "320" if inrange(anio, 1998, 2005) & loc == "0501"
 12.     replace loc = "321" if inrange(anio, 1998, 2005) & loc == "0502"
 13.     replace loc = "021" if inrange(anio, 1998, 2005) & loc == "0503"    
 14.     replace loc = "022" if inrange(anio, 1998, 2005) & loc == "0504"
 15.     replace loc = "023" if inrange(anio, 1998, 2005) & loc == "0505"
 16. 
.     * Durazno
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0601"
 17.     replace loc = "421" if inrange(anio, 1998, 2005) & loc == "0602"
 18. 
.     * Flores
.     replace loc = "320" if inrange(anio, 1998, 2005) & loc == "0701"
 19. 
.     * Florida
.     replace loc = "220" if inrange(anio, 1998, 2005) & loc == "0801"
 20.     replace loc = "421" if inrange(anio, 1998, 2005) & loc == "0802"
 21. 
.     * Lavalleja
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "0901"
 22.     replace loc = "522" if inrange(anio, 1998, 2005) & loc == "0902"
 23. 
.     * Maldonado
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1001"
 24.     replace loc = "021" if inrange(anio, 1998, 2005) & loc == "1002"
 25.     replace loc = "022" if inrange(anio, 1998, 2005) & loc == "1003"    
 26.     replace loc = "023" if inrange(anio, 1998, 2005) & loc == "1004"
 27.     replace loc = "024" if inrange(anio, 1998, 2005) & loc == "1005"
 28. 
.     * Paysandu
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1101"
 29.     replace loc = "521" if inrange(anio, 1998, 2005) & loc == "1102"
 30. 
.     * Rio Negro
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1201"
 31.     replace loc = "421" if inrange(anio, 1998, 2005) & loc == "1202"
 32.     
.     *Rivera
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1301"
 33.     replace loc = "522" if inrange(anio, 1998, 2005) & loc == "1302"
 34.     
.     *Rocha
.     replace loc = "320" if inrange(anio, 1998, 2005) & loc == "1401"
 35.     replace loc = "422" if inrange(anio, 1998, 2005) & loc == "1403"
 36.     replace loc = "521" if inrange(anio, 1998, 2005) & loc == "1404"
 37.     
.     * Salto
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1501"
 38. 
.     *San Jose
.     replace loc = "021" if inrange(anio, 1998, 2005) & loc == "1601"
 39.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1602"
 40.     replace loc = "022" if inrange(anio, 1998, 2005) & loc == "1603"
 41. 
.     *Soriano
.     replace loc = "220" if inrange(anio, 1998, 2005) & loc == "1701"
 42.     replace loc = "021" if inrange(anio, 1998, 2005) & loc == "1702"
 43. 
.     *Tacuarembo
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1801"
 44.     replace loc = "321" if inrange(anio, 1998, 2005) & loc == "1802"
 45. 
.     *Treinta y Tres
.     replace loc = "020" if inrange(anio, 1998, 2005) & loc == "1901"
 46. end

. 
. program convert_07_to_06_11_cod    
  1.     replace loc = substr(loc, 3, 3) if anio == 2007
  2.     
.     * Montevideo
.     replace loc = "010" if anio == 2007 & loc == "020" & dpto == 1
  3. 
.     * Artigas
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 2
  4.     replace loc = "021" if anio == 2007 & loc == "621" & dpto == 2
  5.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 2
  6. 
.     * Canelones
.     replace loc = "020" if anio == 2007 & loc == "121" & dpto == 3
  7.     replace loc = "022" if anio == 2007 & loc == "222" & dpto == 3
  8.     replace loc = "023" if anio == 2007 & loc == "323" & dpto == 3
  9.     replace loc = "000" if anio == 2007 & loc == "528" & dpto == 3
 10.     
.     * Cerro Largo
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 4
 11.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 4
 12. 
.     * Colonia
.     replace loc = "021" if anio == 2007 & loc == "421" & dpto == 5
 13.     replace loc = "023" if anio == 2007 & loc == "323" & dpto == 5
 14.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 5
 15.     
.     * Durazno
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 6
 16.     replace loc = "000" if anio == 2007 & loc == "721" & dpto == 6
 17. 
.     * Flores
.     replace loc = "000" if anio == 2007 & loc == "721" & dpto == 7
 18. 
.     * Florida
.     replace loc = "000" if anio == 2007 & loc == "622" & dpto == 8
 19. 
.     * Lavalleja
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 9
 20.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 9
 21. 
.     * Maldonado
.     replace loc = "020" if anio == 2007 & loc == "320" & dpto == 10
 22.     replace loc = "021" if anio == 2007 & loc == "321" & dpto == 10
 23.     replace loc = "023" if anio == 2007 & loc == "523" & dpto == 10
 24.     replace loc = "024" if anio == 2007 & loc == "524" & dpto == 10
 25.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 10
 26. 
.     * Paysandu
.     replace loc = "020" if anio == 2007 & loc == "120" & dpto == 11
 27.     replace loc = "021" if anio == 2007 & loc == "822" & dpto == 11
 28.     replace loc = "000" if anio == 2007 & loc == "621" & dpto == 11
 29.     
.     * Rio Negro
.     replace loc = "020" if anio == 2007 & loc == "320" & dpto == 12
 30.     replace loc = "000" if anio == 2007 & loc == "621" & dpto == 12
 31.     
.     *Rivera
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 13
 32.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 13
 33.     
.     *Rocha
.     replace loc = "000" if anio == 2007 & loc == "722" & dpto == 14
 34.     
.     * Salto
.     replace loc = "020" if anio == 2007 & loc == "120" & dpto == 15
 35.     replace loc = "000" if anio == 2007 & loc == "522" & dpto == 15
 36. 
.     *San Jose
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 16
 37.     replace loc = "021" if anio == 2007 & loc == "321" & dpto == 16
 38.     replace loc = "022" if anio == 2007 & loc == "421" & dpto == 16
 39.     replace loc = "000" if anio == 2007 & loc == "621" & dpto == 16
 40. 
.     *Soriano
.     replace loc = "021" if anio == 2007 & loc == "321" & dpto == 17
 41.     replace loc = "091" if anio == 2007 & loc == "521" & dpto == 17
 42.     replace loc = "000" if anio == 2007 & loc == "622" & dpto == 17
 43. 
.     *Tacuarembo
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 18
 44.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 18
 45.     
.     *Treinta y Tres
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 19
 46.     replace loc = "000" if anio == 2007 & loc == "790" & dpto == 19
 47. end

. 
. program fill_missing_loc_var
  1.     syntax, year(int) loc_var(str) merge_var(str)
  2.     
.     preserve 
  3.         keep if anio == 2006
  4.         keep anio dpto `loc_var' `merge_var'
  5.         duplicates drop anio dpto loc, force
  6.         replace anio = `year'
  7.         rename `loc_var' `loc_var'2
  8.         save ../temp/loc_2006, replace
  9.     restore    
 10. 
.     merge m:1 anio dpto `merge_var' using ../temp/loc_2006, ///
>         keepusing(`loc_var'2) nogen
 11.     
.     replace `loc_var' = `loc_var'2 if anio == `year'
 12.     drop `loc_var'2
 13. end

. 
. program homogeneize_loc_to_2012_2014
  1.     use ../temp/1998_2011_loc_homo.dta, clear
  2.     
.     merge m:1 dpto loc using ../../base/output/loc_xwalk.dta, ///
>         keepusing(loc12_14)
  3.     replace loc12_14 = loc if inrange(anio, 2012,2014) 
  4.     drop if missing(loc)    
  5.         
.     replace loc = loc12_14
  6.     drop _merge loc12_14
  7. end

. 
. program drop_rural_areas
  1.     * Artigas
.     drop if dpto == 2 & loc_code_destring == 0231900
  2. 
.      * Canelones
.     drop if dpto == 3 & loc_code_destring == 0303900
  3.     
.     * Cerro Largo
.     drop if dpto == 4 & loc_code_destring == 0431900
  4. 
.     * Colonia
.     drop if dpto == 5 & loc_code_destring == 0532900
  5. 
.     * Durazno
.     drop if dpto == 6 & loc_code_destring == 0633900
  6. 
.     * Flores
.     drop if dpto == 7 & loc_code_destring == 0734900
  7. 
.     * Florida
.     drop if dpto == 8 & loc_code_destring == 0834900
  8. 
.     * Lavalleja
.     drop if dpto == 9 & loc_code_destring == 0934900
  9. 
.     * Maldonado
.     drop if dpto == 10 & loc_code_destring == 1035900
 10. 
.     * Paysandu
.     drop if dpto == 11 & loc_code_destring == 1136900
 11. 
.     * Rio Negro
.     drop if dpto == 12 & loc_code_destring == 1236900
 12.     
.     *Rivera
.     drop if dpto == 13 & loc_code_destring == 1331900
 13.     
.     *Rocha
.     drop if dpto == 14 & loc_code_destring == 1435900
 14.     
.     * Salto
.     drop if dpto == 15 & loc_code_destring == 1536900
 15. 
.     *San Jose
.     drop if dpto == 16 & loc_code_destring == 1632900
 16. 
.     *Soriano
.     drop if dpto == 17 & loc_code_destring == 1732900
 17. 
.     *Tacuarembo
.     drop if dpto == 18 & loc_code_destring == 1833900
 18. 
.     *Treinta y Tres
.     drop if dpto == 19 & loc_code_destring == 1931900
 19. end

. 
. * EXECUTE
. main
(238,595 real changes made)
(7,863 real changes made)
(3,840 real changes made)
(12,718 real changes made)
(30,695 real changes made)
(6,467 real changes made)
(3,652 real changes made)
(1,126 real changes made)
(6,487 real changes made)
(2,709 real changes made)
(5,940 real changes made)
(2,568 real changes made)
(680 real changes made)
(431 real changes made)
(2,116 real changes made)
(4,603 real changes made)
(1,235 real changes made)
(4,025 real changes made)
(3,824 real changes made)
(1,478 real changes made)
(6,127 real changes made)
(221 real changes made)
(10,192 real changes made)
(4,344 real changes made)
(1,535 real changes made)
(333 real changes made)
(167 real changes made)
(11,982 real changes made)
(173 real changes made)
(3,605 real changes made)
(2,718 real changes made)
(11,257 real changes made)
(1,302 real changes made)
(7,098 real changes made)
(1,330 real changes made)
(205 real changes made)
(12,609 real changes made)
(5,481 real changes made)
(3,786 real changes made)
(1,649 real changes made)
(6,279 real changes made)
(2,877 real changes made)
(7,321 real changes made)
(1,842 real changes made)
(5,415 real changes made)
(143,185 real changes made)
(57,520 real changes made)
(1,190 real changes made)
(452 real changes made)
(1,293 real changes made)
(3,155 real changes made)
(1,816 real changes made)
(1,171 real changes made)
(999 real changes made)
(1,982 real changes made)
(651 real changes made)
(774 real changes made)
(767 real changes made)
(620 real changes made)
(1,861 real changes made)
(555 real changes made)
(212 real changes made)
(688 real changes made)
(2,024 real changes made)
(272 real changes made)
(2,508 real changes made)
(999 real changes made)
(310 real changes made)
(437 real changes made)
(380 real changes made)
(3,344 real changes made)
(9 real changes made)
(553 real changes made)
(1,295 real changes made)
(486 real changes made)
(3,037 real changes made)
(462 real changes made)
(651 real changes made)
(3,667 real changes made)
(576 real changes made)
(3,077 real changes made)
(1,853 real changes made)
(778 real changes made)
(482 real changes made)
(776 real changes made)
(242 real changes made)
(408 real changes made)
(2,404 real changes made)
(416 real changes made)
(1,777 real changes made)
(250 real changes made)
(1,755,020 observations deleted)

Duplicates in terms of anio dpto loc

(256,765 observations deleted)
(96 real changes made)
(note: file ../temp/loc_2006.dta not found)
file ../temp/loc_2006.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,870,334
        from master                 1,870,319  
        from using                         15  

    matched                           141,562  
    -----------------------------------------
(141,577 real changes made)
(1,755,035 observations deleted)

Duplicates in terms of anio dpto loc

(256,765 observations deleted)
(96 real changes made)
file ../temp/loc_2006.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,867,335
        from master                 1,867,320  
        from using                         15  

    matched                           144,576  
    -----------------------------------------
(144,591 real changes made)
(note: file ../temp/1998_2011_loc_homo.dta not found)
file ../temp/1998_2011_loc_homo.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       383,151
        from master                   383,151  (_merge==1)
        from using                          0  (_merge==2)

    matched                         1,628,760  (_merge==3)
    -----------------------------------------
(380,244 real changes made)
(358 observations deleted)
(1,631,309 real changes made)
(120,462 real changes made)
dpto_string generated as str2
(1,419,853 real changes made)
loc_code: all characters numeric; loc_code_destring generated as long
(4,082 observations deleted)
(35,350 observations deleted)
(5,511 observations deleted)
(9,215 observations deleted)
(4,382 observations deleted)
(2,627 observations deleted)
(7,533 observations deleted)
(4,696 observations deleted)
(4,041 observations deleted)
(4,404 observations deleted)
(4,227 observations deleted)
(6,010 observations deleted)
(4,173 observations deleted)
(6,460 observations deleted)
(10,739 observations deleted)
(5,002 observations deleted)
(6,706 observations deleted)
(3,364 observations deleted)
(0 observations deleted)
(30 observations deleted)
(data now sorted by numero pers anio)
  (0 bytes saved)
===============================================================================
> ===================
File: ../temp/clean_loc_1998_2016.dta
Key: numero pers anio
===============================================================================
> ===================
  1883001:72(36138):1879422818:2498013713

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      numero |  1,883,001    7.60e+08    9.76e+08          1   2.02e+09
        pers |  1,883,001    2.394427    1.518971          1         27
        anio |  1,883,001    2008.396    4.955077       1998       2016
      semana |    172,515    24.40658    13.83848          1         48
        dpto |  1,883,001    5.627094    5.785383          1         19
-------------+---------------------------------------------------------
        secc |  1,730,140    9.575127    16.53226          0         99
        segm |  1,730,140     61.8744    92.31873          0        845
     estrato |  1,883,001    5.492968     2.93876          1         12
      hombre |  1,883,001    .4683386    .4989967          0          1
        edad |  1,883,001    36.69248    23.47308          0         99
-------------+---------------------------------------------------------
    pobpcoac |  1,883,001     3.83691    3.223087          1         99
horas_trab~p |  1,883,001    17.30703    22.32703          0         99
horas_trab~s |  1,883,001    .8808381    4.793823          0         98
horas_trab~o |  1,883,001    18.28341    23.41794          0        180
busca_trab~o |  1,883,001    .0717796    .2581226          0          1
-------------+---------------------------------------------------------
meses_trab~o |  1,603,978    .9879306    3.922381          0         80
anios_trab~o |  1,603,978    3.595337    7.811246          0         98
      ytotal |  1,883,001     8963.94    17118.72          0    7244333
     pesotri |  1,768,529    112.5999    55.67063          1       1527
     pesosem |  1,656,952    56.11867    29.23545          3       1345
-------------+---------------------------------------------------------
      pesoan |  1,883,001    28.17228    13.90951          1       1323
         ccz |  1,799,032    4.177422    5.575519          0         18
      nomloc |          0
  nbr_people |  1,883,001    3.788625    1.892648          1         27
 nbr_above14 |  1,883,001    2.790203    1.261856          1         16
-------------+---------------------------------------------------------
 nbr_under14 |  1,883,001    .9982677    1.287109          0         14
     y_hogar |  1,883,001       27942    35279.14          0    7681180
c98_resid_~e |  1,883,001     .995333     .068156          0          1
c98_resid_~d |  1,883,001    .6481627    .4775436          0          1
c98_nbr_ro~s |  1,883,001    3.574194    1.311938          0         80
-------------+---------------------------------------------------------
c98_nbr_be~s |  1,883,001    2.195521    .8372966          0         40
c98_b_pipe~r |  1,883,001    .9650021    .1837744          0          1
c98_hhld_t~t |  1,883,001    .9231094    .2664178          0          1
c98_b_sewage |  1,883,001    .6019636    .4894932          0          1
c98_hhld_s~e |  1,883,001    .9487366    .2205345          0          1
-------------+---------------------------------------------------------
c98_hhld_h~r |  1,883,001    .8768014    .3286651          0          1
c98_hhld_r~t |  1,883,001     .843982    .3628725          0          1
 c98_hhld_tv |  1,883,001    .9618635    .1915257          0          1
c98_hhld_vcr |  1,883,001    .4869907    .4998309          0          1
c98_hhld_w~c |  1,883,001    .7094075    .4540359          0          1
-------------+---------------------------------------------------------
c98_hhld_d~r |  1,883,001    .0426776    .2021293          0          1
c98_hhld_m~e |  1,883,001     .480355    .4996141          0          1
c98_hhld_car |  1,883,001    .3550816    .4785382          0          1
   trimestre |  1,883,001    2.497624    1.117098          1          4
     married |  1,593,059    .5195464     .499618          0          1
-------------+---------------------------------------------------------
       etnia |  1,431,463    2.291132    .9704668          0          4
  estudiante |  1,883,001    .0635061     .243871          0          1
     trabajo |  1,883,001    .4440821    .4968635          0          1
 y_hogar_alt |  1,883,001    28125.33    32693.99          0    7289481
  anios_prim |  1,848,281    5.005129    1.924656          0          6
-------------+---------------------------------------------------------
 anios_secun |  1,848,281    2.119509    2.420579          0          6
  anios_terc |  1,864,778    .4804164    1.443628          0         40
  anios_tecn |  1,848,281     .256131    .7879275          0          8
  educ_level |  1,848,281    1.898372     1.01154          1          4
         mes |  1,710,486    6.493169    3.444754          1         12
-------------+---------------------------------------------------------
   trabajo_1 |  1,710,486    .4191785    .4934248          0          1
c01_hhld_c~r |  1,710,486    .5257202    .4993382          0          1
c01_hhld_i~t |  1,710,486    .3633944    .4809772          0          1
c01_hhld_p~e |  1,710,486    .7215955    .4482137          0          1
c01_hhld_c~v |  1,710,486    .5669289    .4955004          0          1
-------------+---------------------------------------------------------
    region_3 |  1,431,463    1.682926     .638033          1          3
    region_4 |  1,431,463    1.683443    .6395034          1          4
     pesomen |  1,316,991    276.1408    110.0983          1       2451
 live_births |    475,328    1.039613    .6913098          0          2
live_birth~r |    475,328    1.412622    1.940563          0         65
-------------+---------------------------------------------------------
       li_06 |  1,431,463    1786.062    544.0301       1002       3021
       lp_06 |  1,431,463    18442.54    9717.829       3274   132026.8
c06_mat_wa~s |  1,431,463    .9736368    .1602131          0          1
c06_mat_roof |  1,431,463    .5677583    .4953877          0          1
c06_mat_fl~r |  1,431,463    .7912199    .4064371          0          1
-------------+---------------------------------------------------------
c06_b_electr |  1,431,463    .9961228     .062146          0          1
    loc_code |          0




(note: file ../temp/clean_loc_1998_2016.dta not found)
file ../temp/clean_loc_1998_2016.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./prepare_for_analysis.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./prepare_for_analysis.do 

. clear all

. set more off

. adopath + ../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../library/stata/gslab_misc/ado"

. 
. program main 
  1.     use ../temp/clean_loc_1998_2016.dta, clear
  2.     
.     fix_2012_weights, by_vars(loc_code trimestre edad hombre)
  3.     
.     import excel ..\..\raw\inflation.xlsx, sheet("Sheet1") firstrow clear
  4.     merge 1:m anio using ..\temp\clean_loc_1998_2016_fixed_weights.dta, no
> gen ///
>         assert(1 3)keep(3)
  5.     save ..\temp\clean_loc_1998_2016_fixed.dta, replace
  6. 
.     impute_poverty_lines_pre06
  7.     gen poor       = (y_hogar_alt <= lp_06)
  8.     gen indigente   = (y_hogar_alt <= li_06)
  9.     
.     gen ind_under14 = (nbr_under14>0)
 10.     gen work_part_time = (horas_trabajo<32) if !mi(horas_trabajo) & trabaj
> o==1
 11.     
.     gen     semestre = 1 if inlist(trimestre, 1, 2)
 12.     replace semestre = 2 if inlist(trimestre, 3, 4)
 13.     gen     anio_sem = yh(anio, semestre)
 14.     format  anio_sem %th
 15.     gen     anio_qtr = yq(anio, trimestre)
 16.     format  anio_qtr %tq
 17. 
.     label_vars
 18.     drop if (missing(numero) | missing(pers) | missing(anio))
 19.     replace horas_trabajo = . if horas_trabajo >= 100
 20.     save_data ../output/clean_loc_1998_2016.dta, key(numero pers anio) rep
> lace    
 21. end

. 
. program fix_2012_weights
  1.     syntax, by_vars(str)
  2.     
.     keep if anio == 2013
  3.         
.     rename (pesotri pesosem) (pesotri2 pesosem2)
  4.     collapse (mean) pesotri2 pesosem2, by(`by_vars')
  5.     gen anio = 2012
  6.     
.     save ../temp/pesos_2012_imputed.dta, replace
  7. 
.     use ../temp/clean_loc_1998_2016.dta, clear
  8.     
.     merge m:1 anio `by_vars' using ../temp/pesos_2012_imputed.dta, ///
>         keepusing(pesosem2 pesotri2) keep(1 3)
  9.     replace pesotri = pesotri2 if _merge == 3
 10.     replace pesosem = pesosem2 if _merge == 3
 11.     drop pesotri2 pesosem2 _merge
 12.     
.     save ../temp/clean_loc_1998_2016_fixed_weights.dta, replace
 13. end

. 
. program impute_poverty_lines_pre06
  1.     keep if anio == 2006
  2.     
.     forval year=1998/2005 {
  3.         replace anio = `year' 
  4.     
.         local by_vars " trimestre loc_code nbr_above14 nbr_people"
  5.     
.         rename (lp_06 li_06) (lp_06_2 li_06_2)
  6.         collapse (mean) lp_06_2 li_06_2, by(`by_vars')
  7.     
.         save ..\temp\poverty_`year'_imputed.dta, replace
  8. 
.         use ..\temp\clean_loc_1998_2016_fixed.dta, clear
  9. 
.         merge m:1 `by_vars' using ..\temp\poverty_`year'_imputed.dta, nogen
 10.         replace lp_06 = lp_06_2 if anio == `year'
 11.         replace li_06 = li_06_2 if anio == `year'
 12.     
.         drop lp_06_2 li_06_2
 13.         replace lp_06 = (lp_06 * cpi_2006)/100 if anio == `year'
 14.         replace li_06 = (li_06 * cpi_2006)/100 if anio == `year'
 15.         save ..\temp\clean_loc_1998_2016_fixed.dta, replace
 16.     }
 17. end

. 
. program label_vars
  1.     label var trabajo "Employment"
  2.     label var horas_trabajo "Hours worked"
  3.     label var work_part_time "Part-time work"
  4.     label var anios_prim  "Years of primary school"
  5.     label var anios_secun "Years of high school"
  6.     label var anios_tecn  "Years of technical school"
  7.     label var anios_terc  "Years of college"
  8. 
.     label var    educ_level "Educational attainment"
  9.     label define educ_level 1 "Primary school" 2 "High school (incomplete)
> " 3 "High school (complete)" 4 "Post-secondary"
 10.     label values educ_level educ_level
 11.     
.     gen       educ_anios_secun = anios_secun if !mi(anios_secun) & educ_level
> <4 & inrange(edad,16,22)
 12.     label var educ_anios_secun "Years of high school"
 13.     gen       educ_anios_terc  = anios_terc  if !mi(anios_terc) & educ_lev
> el>=3 & inrange(edad,18,30)
 14.     label var educ_anios_terc  "Years of college"
 15. 
.     gen          educ_HS_diploma = (educ_level == 3) if !mi(educ_level) & edu
> c_level<4 & inrange(edad,18,22)
 16.     label var    educ_HS_diploma "High-school completed"
 17.     label define educ_HS_diploma 0 "No HS diploma" 1 "HS diploma or more"
 18.     label values educ_HS_diploma educ_diploma
 19.     
.     gen          educ_some_college = (educ_level == 4) if !mi(educ_level) & e
> duc_level>=3 & inrange(edad,18,30)
 20.     label var    educ_some_college "Some College"
 21.     label define educ_some_college 0 "No College" 1 "Some College"
 22.     label values educ_some_college educ_some_college
 23. end

. 
. main
(1,761,278 observations deleted)
(note: file ../temp/pesos_2012_imputed.dta not found)
file ../temp/pesos_2012_imputed.dta saved
(note: variable anio was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,778,944
        from master                 1,778,944  (_merge==1)
        from using                          0  (_merge==2)

    matched                           104,057  (_merge==3)
    -----------------------------------------
variable pesotri was int now float
(104,057 real changes made)
variable pesosem was int now float
(104,057 real changes made)
(note: file ../temp/clean_loc_1998_2016_fixed_weights.dta not found)
file ../temp/clean_loc_1998_2016_fixed_weights.dta saved
(note: variable anio was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,001  
    -----------------------------------------
(note: file ..\temp\clean_loc_1998_2016_fixed.dta not found)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,673,097 observations deleted)
(209,904 real changes made)
(note: file ..\temp\poverty_1998_imputed.dta not found)
file ..\temp\poverty_1998_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        75,486
        from master                    75,486  
        from using                          0  

    matched                         1,807,515  
    -----------------------------------------
(53,695 real changes made)
variable li_06 was int now float
(53,695 real changes made)
(53,695 real changes made)
(53,695 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,825,327 real changes made)
(note: file ..\temp\poverty_1999_imputed.dta not found)
file ..\temp\poverty_1999_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,001  
    -----------------------------------------
(56,845 real changes made)
(56,845 real changes made)
(56,845 real changes made)
(56,845 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,825,017 real changes made)
(note: file ..\temp\poverty_2000_imputed.dta not found)
file ..\temp\poverty_2000_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,001  
    -----------------------------------------
(57,093 real changes made)
(57,093 real changes made)
(57,093 real changes made)
(57,093 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,825,591 real changes made)
(note: file ..\temp\poverty_2001_imputed.dta not found)
file ..\temp\poverty_2001_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,001  
    -----------------------------------------
(56,694 real changes made)
(56,694 real changes made)
(56,694 real changes made)
(56,694 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,826,674 real changes made)
(note: file ..\temp\poverty_2002_imputed.dta not found)
file ..\temp\poverty_2002_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,001  
    -----------------------------------------
(55,620 real changes made)
(55,620 real changes made)
(55,620 real changes made)
(55,620 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,827,632 real changes made)
(note: file ..\temp\poverty_2003_imputed.dta not found)
file ..\temp\poverty_2003_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,001  
    -----------------------------------------
(54,650 real changes made)
(54,650 real changes made)
(54,650 real changes made)
(54,650 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,827,414 real changes made)
(note: file ..\temp\poverty_2004_imputed.dta not found)
file ..\temp\poverty_2004_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,001  
    -----------------------------------------
(54,842 real changes made)
(54,842 real changes made)
(54,842 real changes made)
(54,842 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,828,671 real changes made)
(note: file ..\temp\poverty_2005_imputed.dta not found)
file ..\temp\poverty_2005_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,883,001  
    -----------------------------------------
(53,665 real changes made)
(53,665 real changes made)
(53,665 real changes made)
(53,665 real changes made)
file ..\temp\clean_loc_1998_2016_fixed.dta saved
(1,046,794 missing values generated)
(939,872 missing values generated)
(939,872 real changes made)
(1,711,736 missing values generated)
(1,769,966 missing values generated)
(1,773,862 missing values generated)
(1,770,115 missing values generated)
(0 observations deleted)
(261 real changes made, 261 to missing)
(data now sorted by numero pers anio)
  variable anio was float now int
  variable horas_trabajo was int now byte
  variable poor was float now byte
  variable indigente was float now byte
  variable ind_under14 was float now byte
  variable work_part_time was float now byte
  variable semestre was float now byte
  variable anio_sem was float now int
  variable anio_qtr was float now int
  variable educ_anios_secun was float now byte
  variable educ_anios_terc was float now byte
  variable educ_HS_diploma was float now byte
  variable educ_some_college was float now byte
  (64,022,034 bytes saved)
===============================================================================
> ===================
File: ../output/clean_loc_1998_2016.dta
Key: numero pers anio
===============================================================================
> ===================
  1883001:85(100147):1679399254:4223410392

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      numero |  1,883,001    7.60e+08    9.76e+08          1   2.02e+09
        pers |  1,883,001    2.394427    1.518971          1         27
        anio |  1,883,001    2008.396    4.955077       1998       2016
   inflation |  1,883,001    8.059312    3.511605       3.59      25.94
    cpi_2006 |  1,883,001    127.7241    47.60114   48.00595   217.6432
-------------+---------------------------------------------------------
      semana |    172,515    24.40658    13.83848          1         48
        dpto |  1,883,001    5.627094    5.785383          1         19
        secc |  1,730,140    9.575127    16.53226          0         99
        segm |  1,730,140     61.8744    92.31873          0        845
     estrato |  1,883,001    5.492968     2.93876          1         12
-------------+---------------------------------------------------------
      hombre |  1,883,001    .4683386    .4989967          0          1
        edad |  1,883,001    36.69248    23.47308          0         99
    pobpcoac |  1,883,001     3.83691    3.223087          1         99
horas_trab~p |  1,883,001    17.30703    22.32703          0         99
horas_trab~s |  1,883,001    .8808381    4.793823          0         98
-------------+---------------------------------------------------------
horas_trab~o |  1,882,740    18.27068    23.39412          0         99
busca_trab~o |  1,883,001    .0717796    .2581226          0          1
meses_trab~o |  1,603,978    .9879306    3.922381          0         80
anios_trab~o |  1,603,978    3.595337    7.811246          0         98
      ytotal |  1,883,001     8963.94    17118.72          0    7244333
-------------+---------------------------------------------------------
     pesotri |  1,872,586     112.356    54.35323          1       1527
     pesosem |  1,761,009    55.98618    28.46612          3       1345
      pesoan |  1,883,001    28.17228    13.90951          1       1323
         ccz |  1,799,032    4.177422    5.575519          0         18
      nomloc |          0
-------------+---------------------------------------------------------
  nbr_people |  1,883,001    3.788625    1.892648          1         27
 nbr_above14 |  1,883,001    2.790203    1.261856          1         16
 nbr_under14 |  1,883,001    .9982677    1.287109          0         14
     y_hogar |  1,883,001       27942    35279.14          0    7681180
c98_resid_~e |  1,883,001     .995333     .068156          0          1
-------------+---------------------------------------------------------
c98_resid_~d |  1,883,001    .6481627    .4775436          0          1
c98_nbr_ro~s |  1,883,001    3.574194    1.311938          0         80
c98_nbr_be~s |  1,883,001    2.195521    .8372966          0         40
c98_b_pipe~r |  1,883,001    .9650021    .1837744          0          1
c98_hhld_t~t |  1,883,001    .9231094    .2664178          0          1
-------------+---------------------------------------------------------
c98_b_sewage |  1,883,001    .6019636    .4894932          0          1
c98_hhld_s~e |  1,883,001    .9487366    .2205345          0          1
c98_hhld_h~r |  1,883,001    .8768014    .3286651          0          1
c98_hhld_r~t |  1,883,001     .843982    .3628725          0          1
 c98_hhld_tv |  1,883,001    .9618635    .1915257          0          1
-------------+---------------------------------------------------------
c98_hhld_vcr |  1,883,001    .4869907    .4998309          0          1
c98_hhld_w~c |  1,883,001    .7094075    .4540359          0          1
c98_hhld_d~r |  1,883,001    .0426776    .2021293          0          1
c98_hhld_m~e |  1,883,001     .480355    .4996141          0          1
c98_hhld_car |  1,883,001    .3550816    .4785382          0          1
-------------+---------------------------------------------------------
   trimestre |  1,883,001    2.497624    1.117098          1          4
     married |  1,593,059    .5195464     .499618          0          1
       etnia |  1,431,463    2.291132    .9704668          0          4
  estudiante |  1,883,001    .0635061     .243871          0          1
     trabajo |  1,883,001    .4440821    .4968635          0          1
-------------+---------------------------------------------------------
 y_hogar_alt |  1,883,001    28125.33    32693.99          0    7289481
  anios_prim |  1,848,281    5.005129    1.924656          0          6
 anios_secun |  1,848,281    2.119509    2.420579          0          6
  anios_terc |  1,864,778    .4804164    1.443628          0         40
  anios_tecn |  1,848,281     .256131    .7879275          0          8
-------------+---------------------------------------------------------
  educ_level |  1,848,281    1.898372     1.01154          1          4
         mes |  1,710,486    6.493169    3.444754          1         12
   trabajo_1 |  1,710,486    .4191785    .4934248          0          1
c01_hhld_c~r |  1,710,486    .5257202    .4993382          0          1
c01_hhld_i~t |  1,710,486    .3633944    .4809772          0          1
-------------+---------------------------------------------------------
c01_hhld_p~e |  1,710,486    .7215955    .4482137          0          1
c01_hhld_c~v |  1,710,486    .5669289    .4955004          0          1
    region_3 |  1,431,463    1.682926     .638033          1          3
    region_4 |  1,431,463    1.683443    .6395034          1          4
     pesomen |  1,316,991    276.1408    110.0983          1       2451
-------------+---------------------------------------------------------
 live_births |    475,328    1.039613    .6913098          0          2
live_birth~r |    475,328    1.412622    1.940563          0         65
       li_06 |  1,874,567    1621.027    582.7457   363.3281       3021
       lp_06 |  1,874,567    16984.56    9365.237   1585.694   132026.8
c06_mat_wa~s |  1,431,463    .9736368    .1602131          0          1
-------------+---------------------------------------------------------
c06_mat_roof |  1,431,463    .5677583    .4953877          0          1
c06_mat_fl~r |  1,431,463    .7912199    .4064371          0          1
c06_b_electr |  1,431,463    .9961228     .062146          0          1
    loc_code |          0
        poor |  1,883,001    .3720444    .4833503          0          1
-------------+---------------------------------------------------------
   indigente |  1,883,001    .0129841    .1132055          0          1
 ind_under14 |  1,883,001    .5156837    .4997541          0          1
work_part_~e |    836,207    .2665452    .4421528          0          1
    semestre |  1,883,001    1.499135    .4999994          1          2
    anio_sem |  1,883,001    97.29061    9.923175         76        113
-------------+---------------------------------------------------------
    anio_qtr |  1,883,001    195.0806    19.85271        152        227
educ_anios~n |    171,265    2.669699    2.002579          0          6
educ_anios~c |    113,035    1.916999    1.827092          0         40
educ_HS_di~a |    109,139    .1157881    .3199721          0          1
educ_some_~e |    112,886    .7242528     .446892          0          1




(note: file ../output/clean_loc_1998_2016.dta not found)
file ../output/clean_loc_1998_2016.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./population.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./population.do 

. * Note: since the locals created in the beginning are used several times in t
> he 
. * code, I did not create different programs (alternative: create globals?)
. 
. * Setting up locals that describe the 6 tables in each worksheet
. local S_all   = 0

. local S_men   = 22

. local S_women = 44

. 
. * Create the cell range for each of the 6 tables in each worksheet
. foreach gender in all men women {
  2.         local S0_`gender' = 8 + `S_`gender''
  3.         local S1_`gender' = `S0_`gender''+2
  4.         local E1_`gender' = `S0_`gender''+2+18
  5.         local cr1_`gender' = "A`S0_`gender'':Z`S0_`gender''"
  6.         local cr2_`gender' = "A`S1_`gender'':Z`E1_`gender''"
  7. }

. 
. * Get names and number of worksheets to be later used as indicators
. import excel "..\..\raw\Departamentos_poblacion_por_sexo_y_edad_1996-2025.xls
> " , describe

                Sheet | Range
  --------------------+--------------------
                 Nota | A1:L35
  Sexo y Departamento | A1:AE74
           Montevideo | A1:BD76
              Artigas | A1:BD76
            Canelones | A1:BD76
          Cerro Largo | A1:BD76
              Colonia | A1:BD76
              Durazno | A1:BD76
               Flores | A1:BD76
              Florida | A1:BD76
            Lavalleja | A1:BD76
            Maldonado | A1:BD76
            Paysandú | A1:BD76
           Río Negro | A1:BD76
               Rivera | A1:BD76
                Rocha | A1:BD76
                Salto | A1:BD76
            San José | A1:BD76
              Soriano | A1:BD76
          Tacuarembó | A1:BD76
       Treinta y Tres | A1:BD76
               Hoja21 | 

. local ws_N = `r(N_worksheet)'-1

. local ws_1 = 3

. 
. forvalues ws = `ws_1'/`ws_N' {
  2.         local ws_`ws'_name = "`r(worksheet_`ws')'"
  3.         local ws_`ws'_nbr  = `ws'
  4.         if `ws'==3 {
  5.                 local ws_`ws'_dpto = 10 //Mvd
  6.         }
  7.         else if inrange(`ws',4,12) { 
  8.                 local ws_`ws'_dpto = `ws'-3 // Alphabetically prior to Mvd
  9.         }
 10.         else {
 11.                 local ws_`ws'_dpto = `ws'-2
 12.         }
 13.         *I wanted to create a label for depar with the local below, but it
> 's hard to add the double quotes
.         *local depar = " `depar' " + " `ws_`ws'_dpto' " + `" `=char(34)' "' +
>  "`ws_`ws'_name'" //+ "`ws_`ws'_name'" 
. }

. 
. * Import the 6 tables from each worksheet and create the relevant variables 
. forvalues ws = `ws_1'/`ws_N' {
  2.         foreach gender in all men women {
  3.                 foreach cr in 1 2 {
  4.                         import excel "..\..\raw\Departamentos_poblacion_po
> r_sexo_y_edad_1996-2025.xls" ///
>                          , clear sheet("`ws_`ws'_name'") cellrange(`cr`cr'_`g
> ender'')
  5.                         
.                         gen depar = `ws_`ws'_dpto'
  6.                         gen gender_all = "`gender'"
  7.                         
.                         if "`cr'" == "1" {
  8.                                 gen age_min    = 0
  9.                                 gen age_max    = 99
 10.                                 gen all_ages   = 1
 11.                         }
 12.                         else {          
 13.                                 qui replace A="90-99" if A=="90 y más"
 14.                                 gen splitat    = strpos(A,"-")  
 15.                                 gen age_min    = substr(A,1,splitat-1)
 16.                                 gen age_max    = substr(A,splitat+1,.)
 17.                                 qui destring age_min age_max, replace
 18.                                 drop splitat
 19.                                 gen all_ages   = 0
 20.                         }
 21.                         
.                         tempfile pop_`ws_`ws'_nbr'_`gender'_`cr'
 22.                         save `pop_`ws_`ws'_nbr'_`gender'_`cr''
 23.                         
.                         di "*******"
 24.                         di "pop_`ws_`ws'_nbr'_`gender'_`cr'"
 25.                         di "*******"
 26.                 }
 27.         }
 28. }
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000001.tmp saved
*******
pop_3_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000002.tmp saved
*******
pop_3_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000003.tmp saved
*******
pop_3_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000004.tmp saved
*******
pop_3_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000005.tmp saved
*******
pop_3_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000006.tmp saved
*******
pop_3_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000007.tmp saved
*******
pop_4_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000008.tmp saved
*******
pop_4_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000009.tmp saved
*******
pop_4_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000a.tmp saved
*******
pop_4_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000b.tmp saved
*******
pop_4_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000c.tmp saved
*******
pop_4_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000d.tmp saved
*******
pop_5_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000e.tmp saved
*******
pop_5_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000f.tmp saved
*******
pop_5_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000g.tmp saved
*******
pop_5_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000h.tmp saved
*******
pop_5_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000i.tmp saved
*******
pop_5_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000j.tmp saved
*******
pop_6_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000k.tmp saved
*******
pop_6_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000l.tmp saved
*******
pop_6_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000m.tmp saved
*******
pop_6_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000n.tmp saved
*******
pop_6_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000o.tmp saved
*******
pop_6_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000p.tmp saved
*******
pop_7_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000q.tmp saved
*******
pop_7_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000r.tmp saved
*******
pop_7_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000s.tmp saved
*******
pop_7_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000t.tmp saved
*******
pop_7_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000u.tmp saved
*******
pop_7_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000v.tmp saved
*******
pop_8_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000w.tmp saved
*******
pop_8_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00000x.tmp saved
*******
pop_8_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000010.tmp saved
*******
pop_8_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000011.tmp saved
*******
pop_8_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000012.tmp saved
*******
pop_8_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000013.tmp saved
*******
pop_9_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000014.tmp saved
*******
pop_9_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000015.tmp saved
*******
pop_9_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000016.tmp saved
*******
pop_9_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000017.tmp saved
*******
pop_9_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000018.tmp saved
*******
pop_9_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000019.tmp saved
*******
pop_10_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001a.tmp saved
*******
pop_10_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001b.tmp saved
*******
pop_10_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001c.tmp saved
*******
pop_10_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001d.tmp saved
*******
pop_10_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001e.tmp saved
*******
pop_10_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001f.tmp saved
*******
pop_11_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001g.tmp saved
*******
pop_11_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001h.tmp saved
*******
pop_11_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001i.tmp saved
*******
pop_11_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001j.tmp saved
*******
pop_11_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001k.tmp saved
*******
pop_11_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001l.tmp saved
*******
pop_12_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001m.tmp saved
*******
pop_12_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001n.tmp saved
*******
pop_12_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001o.tmp saved
*******
pop_12_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001p.tmp saved
*******
pop_12_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001q.tmp saved
*******
pop_12_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001r.tmp saved
*******
pop_13_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001s.tmp saved
*******
pop_13_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001t.tmp saved
*******
pop_13_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001u.tmp saved
*******
pop_13_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001v.tmp saved
*******
pop_13_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001w.tmp saved
*******
pop_13_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00001x.tmp saved
*******
pop_14_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000020.tmp saved
*******
pop_14_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000021.tmp saved
*******
pop_14_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000022.tmp saved
*******
pop_14_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000023.tmp saved
*******
pop_14_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000024.tmp saved
*******
pop_14_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000025.tmp saved
*******
pop_15_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000026.tmp saved
*******
pop_15_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000027.tmp saved
*******
pop_15_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000028.tmp saved
*******
pop_15_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000029.tmp saved
*******
pop_15_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002a.tmp saved
*******
pop_15_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002b.tmp saved
*******
pop_16_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002c.tmp saved
*******
pop_16_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002d.tmp saved
*******
pop_16_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002e.tmp saved
*******
pop_16_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002f.tmp saved
*******
pop_16_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002g.tmp saved
*******
pop_16_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002h.tmp saved
*******
pop_17_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002i.tmp saved
*******
pop_17_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002j.tmp saved
*******
pop_17_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002k.tmp saved
*******
pop_17_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002l.tmp saved
*******
pop_17_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002m.tmp saved
*******
pop_17_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002n.tmp saved
*******
pop_18_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002o.tmp saved
*******
pop_18_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002p.tmp saved
*******
pop_18_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002q.tmp saved
*******
pop_18_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002r.tmp saved
*******
pop_18_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002s.tmp saved
*******
pop_18_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002t.tmp saved
*******
pop_19_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002u.tmp saved
*******
pop_19_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002v.tmp saved
*******
pop_19_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002w.tmp saved
*******
pop_19_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00002x.tmp saved
*******
pop_19_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000030.tmp saved
*******
pop_19_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000031.tmp saved
*******
pop_20_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000032.tmp saved
*******
pop_20_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000033.tmp saved
*******
pop_20_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000034.tmp saved
*******
pop_20_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000035.tmp saved
*******
pop_20_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000036.tmp saved
*******
pop_20_women_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000037.tmp saved
*******
pop_21_all_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000038.tmp saved
*******
pop_21_all_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_000039.tmp saved
*******
pop_21_men_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00003a.tmp saved
*******
pop_21_men_2
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00003b.tmp saved
*******
pop_21_women_1
*******
file C:\Users\diegog\AppData\Local\Temp\3\ST_3d9c_00003c.tmp saved
*******
pop_21_women_2
*******

. 
. * Append all tables
. use `pop_`ws_1'_all_1', clear

. forvalues ws = `ws_1'/`ws_N' {
  2.         foreach gender in all men women {
  3.                 foreach cr in 1 2 {
  4.                         if "`ws_`ws'_nbr'_`gender'_`cr'" == "`ws_1'_all_1"
>  {
  5.                                 continue
  6.                         }
  7.                         else {
  8.                                 append using `pop_`ws_`ws'_nbr'_`gender'_`
> cr''
  9.                         }
 10.                 }
 11.         }
 12. }
(note: variable gender_all was str3, now str5 to accommodate using data's
       values)

. 
. * Check and rename year variables
. isid depar gender_all age_min age_max

. drop A

. local year = 1996

. foreach k in `c(ALPHA)' {
  2.         if "`k'" == "A" {
  3.                 continue
  4.         }
  5.         else {
  6.                 rename `k' pop`year'
  7.                 local year = `year' + 1
  8.         }
  9. }

. 
. * Reshape, aggregate dy depto, and save table
. reshape long pop, i(depar gender_all age_min age_max) j(anio)
(note: j = 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 200
> 9 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1140   ->   28500
Number of variables                  30   ->       7
j variable (25 values)                    ->   anio
xij variables:
            pop1996 pop1997 ... pop2020   ->   pop
-----------------------------------------------------------------------------

. save "..\output\population.dta", replace
(note: file ..\output\population.dta not found)
file ..\output\population.dta saved

. 
. * Collapse to women of fertile age and save table
. gen fertile_age = (gender_all=="women" & age_min>=15 & age_max<45 & all_ages=
> =0)

. collapse (sum) pop if fertile_age==1, by(depar anio age_min age_max)

. drop if inrange(anio,1996,1998) | inrange(anio,2016,2020)
(912 observations deleted)

. 
. save "..\output\population_fertile_age.dta", replace
(note: file ..\output\population_fertile_age.dta not found)
file ..\output\population_fertile_age.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./vital_records.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./vital_records.do 

. clear all

. set more off

. 
. program main    
  1.         append_data
  2.         derived_data
  3. end

. 
. program append_data
  1.         * Note: there is no 1998 data, but there is data for 1996 and 1997
.         forvalues year = 1999/2015 {
  2.                 capture import delimited "..\..\raw\vital_records\Natalida
> d `year'_p.csv", delim(";") clear
  3.                 
.                 *capture rename (civilm  civilp  instm   instp) (mestciv pest
> civ mademay pademay)
.                                                  
.                 qui destring , replace
  4.                 
.                 tempfile temp_`year'
  5.                 save `temp_`year''
  6.         }
  7. 
.         forvalues year = 1999/2014 {
  8.                 append using `temp_`year''
  9.         }
 10. 
.         keep if inrange(anio_parto,1999,2015) //note some births in 2015 are 
> recorded in 2016
 11.         assert !mi(edadm)
 12.         *keep if inrange(edadm,16,45)
.         
.         save "..\temp\births_append.dta", replace
 13. end

. 
. program derived_data
  1.         use "..\temp\births_append.dta", clear
  2.         rename anio_parto anio
  3. 
.         * Assert that corresponding variables are not used at the same time &
>  Gen harmonized vars
.         * Note: issue with mademay == 4 : table anio madeult if mademay == 4
.         assert (mi(civilm) & !mi(mestciv) & !mi(tunion)) | (!mi(civilm) & mi(
> mestciv) & mi(tunion))
  4.         assert (mi(instm) & !mi(mademay) & !mi(madecur) & !mi(madeult)) | 
> (!mi(instm) & mi(mademay) & mi(madecur) & mi(madeult))
  5.         gen married     = (civilm==2 | mestciv==2)                        
>    if civilm!=9 & mestciv!=9
  6.         gen not_married = (married==0)                                    
>    if !mi(married)
  7.         gen partner     = (inlist(civilm,2,3)|mestciv==2|inlist(tunion,1,2
> )) if civilm!=9 & mestciv!=9
  8.         gen no_partner  = (partner==0)                                    
>    if !mi(partner)
  9.         gen single      = (inlist(civilm,1,4,5,6))|(tunion==9|mestciv==2) 
>    if civilm!=9 & mestciv!=9 
 10.         gen     prim_school = (instm==2|((mademay==2 & madeult==6)|(madema
> y==4 & madeult<3)|mademay==3)) if instm!=9 | mademay!=9 | madeult!=9
 11.         gen     high_school = (instm==3|((mademay==4 & madeult==3)|(madema
> y==5 & madeult==1)))           if instm!=9 | mademay!=9 | madeult!=9
 12.         replace high_school = 1 if inrange(anio,2008,2010) & mademay==4 & 
> madeult==6 
 13.         
.         * Birth date
.         drop if mi(fecparto)
 14.         replace fecparto = "jan" + substr(fecparto,4, .) if substr(fecpart
> o, 1, 3) == "ene"
 15.         replace fecparto = "apr" + substr(fecparto,4, .) if substr(fecpart
> o, 1, 3) == "abr"
 16.         replace fecparto = "aug" + substr(fecparto,4, .) if substr(fecpart
> o, 1, 3) == "ago"
 17.         replace fecparto = "dec" + substr(fecparto,4, .) if substr(fecpart
> o, 1, 3) == "dic"
 18.         gen     anio_mon = monthly(fecparto, "MY")
 19.         replace anio_mon = monthly(fecparto, "M20Y")
 20.         assert !mi(anio_mon) if !mi(fecparto)
 21.         format  anio_mon %tm 
 22.         gen     anio_qtr = qofd(dofm(anio_mon))
 23.     format  anio_qtr %tq
 24.         gen     anio_sem = hofd(dofm(anio_mon))
 25.         format  anio_sem %th
 26.         
.         * Pregnancy vars
.         gen recomm_prenatal_numvisits = (totcons>5) if !mi(totcons) & totcons
> !=99
 27.         gen recomm_prenatal_1stvisit  = (semprim<13) if !inlist(semprim,97
> ,99)
 28.         gen no_prenatal_care          = (totcons==0 | semprim==97) if totc
> ons!=99
 29.         gen first_pregnancy           = (numemban==0) if numemban!=99
 30.         gen kids_before               = (first_pregnancy==0) if !mi(first_
> pregnancy)
 31.         gen lowbirthweight            = (peso<2500) if !mi(peso)   & peso<
> 9999
 32.         gen apgar1_low                = (apgar1<7)  if !mi(apgar1) & inran
> ge(apgar1,1,10)
 33.         gen apgar2_low                = (apgar2<7)  if !mi(apgar2) & inran
> ge(apgar2,1,10)
 34.         gen preg_preterm              = (semgest<37) if !mi(semgest) & sem
> gest!=99
 35.         
.         * Add variable dpto coded as in the ECH
.         gen     dpto = depar   if inrange(depar,11,19)
 36.         replace dpto = 1       if depar==10
 37.         replace dpto = depar+1 if inrange(depar,1,9)
 38.         
.         * Labelling
.         lab def not_married               0 "Married"                1 "Not m
> arried"
 39.         lab val not_married               not_married
 40.         lab def no_partner                0 "With partner"           1 "Wi
> thout partner"
 41.         lab val no_partner                no_partner
 42.         lab def prim_school               0 "Less than PS"           1 "PS
>  or more"
 43.         lab val prim_school               prim_school
 44.         lab def high_school               0 "Less than HS"           1 "HS
>  or more"
 45.         lab val high_school               high_school
 46.         lab def no_prenatal_care          1 "No prenatal care"       0 "Pr
> enatal care"
 47.         lab val no_prenatal_care          no_prenatal_care
 48.         lab def lowbirthweight            1 "Low birth weight"       0 "No
> rmal birth weight"
 49.         lab val lowbirthweight            lowbirthweight
 50.         lab def apgar1_low                1 "Low APGAR score"        0 "No
> rmal APGAR score"
 51.         lab val apgar1_low                apgar1_low
 52.         lab def apgar2_low                1 "Low APGAR score"        0 "No
> rmal APGAR score"
 53.         lab val apgar2_low                apgar2_low
 54.         lab def preg_preterm              1 "Pre-term birth"         0 "Fu
> ll-term birth"
 55.         lab val preg_preterm              preg_preterm
 56.         lab def first_pregnancy           0 "Not first pregnancy"    1 "Fi
> rst pregnancy"
 57.         lab val first_pregnancy           first_pregnancy
 58.         lab def recomm_prenatal_numvisits 0 "No prenatal care"       1 "Pr
> enatal care"
 59.         lab val recomm_prenatal_numvisits recomm_prenatal_numvisits
 60.         lab def recomm_prenatal_1stvisit  0 "No prenatal care"       1 "Pr
> enatal care"
 61.         lab val recomm_prenatal_1stvisit  recomm_prenatal_1stvisit
 62.         label_depar
 63. 
.         save "..\output\births_derived.dta", replace
 64. end

. 
. program label_depar
  1.         label var    depar "Mother's residential state"
  2.         label define depar  1 "ARTIGAS" ///
>                                                 2 "CANELONES" ///
>                                                 3 "CERRO LARGO" ///
>                                                 4 "COLONIA" ///
>                                                 5 "DURAZNO" ///
>                                                 6 "FLORES" ///
>                                                 7 "FLORIDA" ///
>                                                 8 "LAVALLEJA" ///
>                                                 9 "MALDONADO" ///
>                                                 10 "MONTEVIDEO" ///
>                                                 11 "PAYSANDU" ///
>                                                 12 "RÍO NEGRO" ///
>                                                 13 "RIVERA" ///
>                                                 14 "ROCHA" ///
>                                                 15 "SALTO" ///
>                                                 16 "SAN JOSÉ" ///
>                                                 17 "SORIANO" ///
>                                                 18 "TACUAREMBÓ" ///
>                                                 19 "TREINTA Y TRES"
  3.         label values depar depar
  4. end

. 
. main
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_000001.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_000002.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_000003.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_000004.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_000005.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_000006.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_000007.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_000008.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_000009.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_00000a.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_00000b.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_00000c.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_00000d.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_00000e.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_00000f.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_00000g.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_5e0c_00000h.tmp saved
(note: variable fecparto was str6, now str7 to accommodate using data's
       values)
(note: variable fecparto was str7, now str8 to accommodate using data's
       values)
(1,247 observations deleted)
(note: file ..\temp\births_append.dta not found)
file ..\temp\births_append.dta saved
(51,908 missing values generated)
(51,908 missing values generated)
(51,908 missing values generated)
(51,908 missing values generated)
(51,908 missing values generated)
(2,651 real changes made)
(28 observations deleted)
(32,731 real changes made)
(31,821 real changes made)
(31,505 real changes made)
(32,843 real changes made)
(285,978 missing values generated)
(285,978 real changes made)
(10,915 missing values generated)
(52,685 missing values generated)
(10,915 missing values generated)
(5,192 missing values generated)
(5,192 missing values generated)
(4,941 missing values generated)
(9,170 missing values generated)
(9,188 missing values generated)
(13,795 missing values generated)
(617,749 missing values generated)
(326,307 real changes made)
(289,693 real changes made)
(note: file ..\output\births_derived.dta not found)
file ..\output\births_derived.dta saved

. 
end of do-file

 make.py ended: 2020-04-01 08:07:17
