
 make.py started: 2020-03-22 08:32:07 C:\Users\diegog\Desktop\Diego\Aborto-Uruguay\derived\ECH\code 




Execute:  StataMP-64 /e do "./homogeneize_geo_vars.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./homogeneize_geo_vars.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main 
  1.     use ../../../base/ECH/output/clean_2001_2015, clear
  2.     
.     convert_01_05_to_06_11_cod
  3.     convert_07_to_06_11_cod
  4.     fill_missing_loc_var, year(2007) loc_var(nomloc) merge_var(loc)
  5.     fill_missing_loc_var, year(2008) loc_var(loc) merge_var(nomloc)
  6.     save ../temp/2001_2011_loc_homo.dta, replace
  7.     
.     homogeneize_loc_to_2012_2014    
  8.     replace ccz = ccz04 if anio == 2012
  9.     drop ccz04 ccz10
 10.     
.     tostring dpto, gen(dpto_string)
 11.     replace dpto_string = "0" + dpto_string if  dpto < 10
 12.     gen loc_code = dpto_string + loc
 13.     drop dpto_string
 14.     
.         destring loc_code, gen(loc_code_destring)
 15.     drop_rural_areas
 16.         drop loc_code_destring loc
 17.     
.         drop if missing(loc_code)
 18.     drop if (missing(anio) | missing(numero) | missing(pers))
 19. 
.     save_data ../temp/clean_loc_2001_2015.dta, key(numero pers anio) replace 
>    
 20. end

. 
. program convert_01_05_to_06_11_cod
  1.     * Montevideo
.     replace loc = "010" if inrange(anio, 2001, 2005) & loc == "0101"
  2. 
.     * Artigas
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "0201"
  3.     replace loc = "021" if inrange(anio, 2001, 2005) & loc == "0202"
  4.     
.     * Canelones
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "0302"
  5.     replace loc = "021" if inrange(anio, 2001, 2005) & loc == "0301"
  6.     replace loc = "023" if inrange(anio, 2001, 2005) & loc == "0303"    
  7.     replace loc = "024" if inrange(anio, 2001, 2005) & loc == "0304"
  8.     replace loc = "422" if inrange(anio, 2001, 2005) & loc == "0305"
  9.     
.     * Cerro Largo
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "0401"
 10.     replace loc = "522" if inrange(anio, 2001, 2005) & loc == "0402"
 11. 
.     * Colonia
.     replace loc = "320" if inrange(anio, 2001, 2005) & loc == "0501"
 12.     replace loc = "321" if inrange(anio, 2001, 2005) & loc == "0502"
 13.     replace loc = "021" if inrange(anio, 2001, 2005) & loc == "0503"    
 14.     replace loc = "022" if inrange(anio, 2001, 2005) & loc == "0504"
 15.     replace loc = "023" if inrange(anio, 2001, 2005) & loc == "0505"
 16. 
.     * Durazno
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "0601"
 17.     replace loc = "421" if inrange(anio, 2001, 2005) & loc == "0602"
 18. 
.     * Flores
.     replace loc = "320" if inrange(anio, 2001, 2005) & loc == "0701"
 19. 
.     * Florida
.     replace loc = "220" if inrange(anio, 2001, 2005) & loc == "0801"
 20.     replace loc = "421" if inrange(anio, 2001, 2005) & loc == "0802"
 21. 
.     * Lavalleja
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "0901"
 22.     replace loc = "522" if inrange(anio, 2001, 2005) & loc == "0902"
 23. 
.     * Maldonado
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "1001"
 24.     replace loc = "021" if inrange(anio, 2001, 2005) & loc == "1002"
 25.     replace loc = "022" if inrange(anio, 2001, 2005) & loc == "1003"    
 26.     replace loc = "023" if inrange(anio, 2001, 2005) & loc == "1004"
 27.     replace loc = "024" if inrange(anio, 2001, 2005) & loc == "1005"
 28. 
.     * Paysandu
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "1101"
 29.     replace loc = "521" if inrange(anio, 2001, 2005) & loc == "1102"
 30. 
.     * Rio Negro
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "1201"
 31.     replace loc = "421" if inrange(anio, 2001, 2005) & loc == "1202"
 32.     
.     *Rivera
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "1301"
 33.     replace loc = "522" if inrange(anio, 2001, 2005) & loc == "1302"
 34.     
.     *Rocha
.     replace loc = "320" if inrange(anio, 2001, 2005) & loc == "1401"
 35.     replace loc = "422" if inrange(anio, 2001, 2005) & loc == "1403"
 36.     replace loc = "521" if inrange(anio, 2001, 2005) & loc == "1404"
 37.     
.     * Salto
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "1501"
 38. 
.     *San Jose
.     replace loc = "021" if inrange(anio, 2001, 2005) & loc == "1601"
 39.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "1602"
 40.     replace loc = "022" if inrange(anio, 2001, 2005) & loc == "1603"
 41. 
.     *Soriano
.     replace loc = "220" if inrange(anio, 2001, 2005) & loc == "1701"
 42.     replace loc = "021" if inrange(anio, 2001, 2005) & loc == "1702"
 43. 
.     *Tacuarembo
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "1801"
 44.     replace loc = "321" if inrange(anio, 2001, 2005) & loc == "1802"
 45. 
.     *Treinta y Tres
.     replace loc = "020" if inrange(anio, 2001, 2005) & loc == "1901"
 46. end

. 
. program convert_07_to_06_11_cod    
  1.     replace loc = substr(loc, 3, 3) if anio == 2007
  2.     
.     * Montevideo
.     replace loc = "010" if anio == 2007 & loc == "020" & dpto == 1
  3. 
.     * Artigas
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 2
  4.     replace loc = "021" if anio == 2007 & loc == "621" & dpto == 2
  5.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 2
  6. 
.     * Canelones
.     replace loc = "020" if anio == 2007 & loc == "121" & dpto == 3
  7.     replace loc = "022" if anio == 2007 & loc == "222" & dpto == 3
  8.     replace loc = "023" if anio == 2007 & loc == "323" & dpto == 3
  9.     replace loc = "000" if anio == 2007 & loc == "528" & dpto == 3
 10.     
.     * Cerro Largo
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 4
 11.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 4
 12. 
.     * Colonia
.     replace loc = "021" if anio == 2007 & loc == "421" & dpto == 5
 13.     replace loc = "023" if anio == 2007 & loc == "323" & dpto == 5
 14.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 5
 15.     
.     * Durazno
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 6
 16.     replace loc = "000" if anio == 2007 & loc == "721" & dpto == 6
 17. 
.     * Flores
.     replace loc = "000" if anio == 2007 & loc == "721" & dpto == 7
 18. 
.     * Florida
.     replace loc = "000" if anio == 2007 & loc == "622" & dpto == 8
 19. 
.     * Lavalleja
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 9
 20.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 9
 21. 
.     * Maldonado
.     replace loc = "020" if anio == 2007 & loc == "320" & dpto == 10
 22.     replace loc = "021" if anio == 2007 & loc == "321" & dpto == 10
 23.     replace loc = "023" if anio == 2007 & loc == "523" & dpto == 10
 24.     replace loc = "024" if anio == 2007 & loc == "524" & dpto == 10
 25.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 10
 26. 
.     * Paysandu
.     replace loc = "020" if anio == 2007 & loc == "120" & dpto == 11
 27.     replace loc = "021" if anio == 2007 & loc == "822" & dpto == 11
 28.     replace loc = "000" if anio == 2007 & loc == "621" & dpto == 11
 29.     
.     * Rio Negro
.     replace loc = "020" if anio == 2007 & loc == "320" & dpto == 12
 30.     replace loc = "000" if anio == 2007 & loc == "621" & dpto == 12
 31.     
.     *Rivera
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 13
 32.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 13
 33.     
.     *Rocha
.     replace loc = "000" if anio == 2007 & loc == "722" & dpto == 14
 34.     
.     * Salto
.     replace loc = "020" if anio == 2007 & loc == "120" & dpto == 15
 35.     replace loc = "000" if anio == 2007 & loc == "522" & dpto == 15
 36. 
.     *San Jose
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 16
 37.     replace loc = "021" if anio == 2007 & loc == "321" & dpto == 16
 38.     replace loc = "022" if anio == 2007 & loc == "421" & dpto == 16
 39.     replace loc = "000" if anio == 2007 & loc == "621" & dpto == 16
 40. 
.     *Soriano
.     replace loc = "021" if anio == 2007 & loc == "321" & dpto == 17
 41.     replace loc = "091" if anio == 2007 & loc == "521" & dpto == 17
 42.     replace loc = "000" if anio == 2007 & loc == "622" & dpto == 17
 43. 
.     *Tacuarembo
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 18
 44.     replace loc = "000" if anio == 2007 & loc == "521" & dpto == 18
 45.     
.     *Treinta y Tres
.     replace loc = "020" if anio == 2007 & loc == "220" & dpto == 19
 46.     replace loc = "000" if anio == 2007 & loc == "790" & dpto == 19
 47. end

. 
. program fill_missing_loc_var
  1.     syntax, year(int) loc_var(str) merge_var(str)
  2.     
.     preserve 
  3.         keep if anio == 2006
  4.         keep anio dpto `loc_var' `merge_var'
  5.         duplicates drop anio dpto loc, force
  6.         replace anio = `year'
  7.         rename `loc_var' `loc_var'2
  8.         save ../temp/loc_2006, replace
  9.     restore    
 10. 
.     merge m:1 anio dpto `merge_var' using ../temp/loc_2006, ///
>         keepusing(`loc_var'2) nogen
 11.     
.     replace `loc_var' = `loc_var'2 if anio == `year'
 12.     drop `loc_var'2
 13. end

. 
. program homogeneize_loc_to_2012_2014
  1.     use ../temp/2001_2011_loc_homo.dta, clear
  2.     
.     merge m:1 dpto loc using ../../../base/Geo_Xwalk/output/loc_xwalk.dta, //
> /
>         keepusing(loc12_14)
  3.     replace loc12_14 = loc if inrange(anio, 2012,2014) 
  4.     drop if missing(loc)    
  5.         
.     replace loc = loc12_14
  6.     drop _merge loc12_14
  7. end

. 
. program drop_rural_areas
  1.     * Artigas
.     drop if dpto == 2 & loc_code_destring == 0231900
  2. 
.      * Canelones
.     drop if dpto == 3 & loc_code_destring == 0303900
  3.     
.     * Cerro Largo
.     drop if dpto == 4 & loc_code_destring == 0431900
  4. 
.     * Colonia
.     drop if dpto == 5 & loc_code_destring == 0532900
  5. 
.     * Durazno
.     drop if dpto == 6 & loc_code_destring == 0633900
  6. 
.     * Flores
.     drop if dpto == 7 & loc_code_destring == 0734900
  7. 
.     * Florida
.     drop if dpto == 8 & loc_code_destring == 0834900
  8. 
.     * Lavalleja
.     drop if dpto == 9 & loc_code_destring == 0934900
  9. 
.     * Maldonado
.     drop if dpto == 10 & loc_code_destring == 1035900
 10. 
.     * Paysandu
.     drop if dpto == 11 & loc_code_destring == 1136900
 11. 
.     * Rio Negro
.     drop if dpto == 12 & loc_code_destring == 1236900
 12.     
.     *Rivera
.     drop if dpto == 13 & loc_code_destring == 1331900
 13.     
.     *Rocha
.     drop if dpto == 14 & loc_code_destring == 1435900
 14.     
.     * Salto
.     drop if dpto == 15 & loc_code_destring == 1536900
 15. 
.     *San Jose
.     drop if dpto == 16 & loc_code_destring == 1632900
 16. 
.     *Soriano
.     drop if dpto == 17 & loc_code_destring == 1732900
 17. 
.     *Tacuarembo
.     drop if dpto == 18 & loc_code_destring == 1833900
 18. 
.     *Treinta y Tres
.     drop if dpto == 19 & loc_code_destring == 1931900
 19. end

. 
. * EXECUTE
. main
(150,049 real changes made)
(4,669 real changes made)
(2,565 real changes made)
(7,111 real changes made)
(17,824 real changes made)
(4,087 real changes made)
(2,064 real changes made)
(926 real changes made)
(3,999 real changes made)
(1,705 real changes made)
(3,444 real changes made)
(1,571 real changes made)
(0 real changes made)
(0 real changes made)
(2,116 real changes made)
(2,743 real changes made)
(749 real changes made)
(2,558 real changes made)
(2,311 real changes made)
(975 real changes made)
(3,882 real changes made)
(0 real changes made)
(6,520 real changes made)
(2,712 real changes made)
(1,093 real changes made)
(0 real changes made)
(0 real changes made)
(7,415 real changes made)
(0 real changes made)
(2,141 real changes made)
(1,788 real changes made)
(7,064 real changes made)
(562 real changes made)
(4,454 real changes made)
(928 real changes made)
(0 real changes made)
(7,936 real changes made)
(3,295 real changes made)
(2,168 real changes made)
(1,102 real changes made)
(3,941 real changes made)
(1,691 real changes made)
(4,455 real changes made)
(1,150 real changes made)
(3,260 real changes made)
(143,185 real changes made)
(57,520 real changes made)
(1,190 real changes made)
(452 real changes made)
(1,293 real changes made)
(3,155 real changes made)
(1,816 real changes made)
(1,171 real changes made)
(999 real changes made)
(1,982 real changes made)
(651 real changes made)
(774 real changes made)
(767 real changes made)
(620 real changes made)
(1,861 real changes made)
(555 real changes made)
(212 real changes made)
(688 real changes made)
(2,024 real changes made)
(272 real changes made)
(2,508 real changes made)
(999 real changes made)
(310 real changes made)
(437 real changes made)
(380 real changes made)
(3,344 real changes made)
(9 real changes made)
(553 real changes made)
(1,295 real changes made)
(486 real changes made)
(3,037 real changes made)
(462 real changes made)
(651 real changes made)
(3,667 real changes made)
(576 real changes made)
(3,077 real changes made)
(1,853 real changes made)
(778 real changes made)
(482 real changes made)
(776 real changes made)
(242 real changes made)
(408 real changes made)
(2,404 real changes made)
(416 real changes made)
(1,777 real changes made)
(250 real changes made)
(1,463,914 observations deleted)

Duplicates in terms of anio dpto loc

(256,765 observations deleted)
(96 real changes made)
(note: file ../temp/loc_2006.dta not found)
file ../temp/loc_2006.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,579,228
        from master                 1,579,213  
        from using                         15  

    matched                           141,562  
    -----------------------------------------
(141,577 real changes made)
(1,463,929 observations deleted)

Duplicates in terms of anio dpto loc

(256,765 observations deleted)
(96 real changes made)
file ../temp/loc_2006.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,578,705
        from master                 1,578,690  
        from using                         15  

    matched                           142,100  
    -----------------------------------------
(142,115 real changes made)
(note: file ../temp/2001_2011_loc_homo.dta not found)
file ../temp/2001_2011_loc_homo.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       384,812
        from master                   384,812  (_merge==1)
        from using                          0  (_merge==2)

    matched                         1,335,993  (_merge==3)
    -----------------------------------------
(380,244 real changes made)
(2,681 observations deleted)
(1,337,880 real changes made)
(120,462 real changes made)
dpto_string generated as str2
(1,204,699 real changes made)
loc_code: all characters numeric; loc_code_destring generated as long
(3,915 observations deleted)
(33,558 observations deleted)
(5,276 observations deleted)
(8,650 observations deleted)
(4,137 observations deleted)
(2,542 observations deleted)
(7,162 observations deleted)
(4,481 observations deleted)
(3,860 observations deleted)
(4,117 observations deleted)
(3,911 observations deleted)
(5,688 observations deleted)
(3,881 observations deleted)
(6,119 observations deleted)
(10,197 observations deleted)
(4,703 observations deleted)
(6,234 observations deleted)
(3,230 observations deleted)
(0 observations deleted)
(30 observations deleted)
(data now sorted by numero pers anio)
  (0 bytes saved)
===============================================================================
> ===================
File: ../temp/clean_loc_2001_2015.dta
Key: numero pers anio
===============================================================================
> ===================
  1596433:41(69643):4249862054:3525302471

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      numero |  1,596,433    7.55e+08    9.75e+08          1   2.02e+09
        pers |  1,596,433    2.387247    1.511477          1         25
        anio |  1,596,433     2008.88    3.884065       2001       2015
        dpto |  1,596,433    5.693009    5.800861          1         19
        secc |  1,527,541    8.878344    16.40364          0         99
-------------+---------------------------------------------------------
        segm |  1,527,541     54.2574    87.38447          0        633
      nomloc |          0
         ccz |  1,596,433    3.970982    5.524501          0         18
         mes |  1,596,433    6.492623    3.443734          1         12
     estrato |  1,596,433    5.526836     2.95546          1         12
-------------+---------------------------------------------------------
      pesoan |  1,596,433    26.42472    13.31516          1       1323
     pesosem |  1,481,961    52.51019    27.28908          3       1345
     pesotri |  1,481,961    105.0327    52.91695          1       1527
      hombre |  1,596,433    .4684694     .499005          0          1
        edad |  1,596,433    36.69952    23.47618          0         99
-------------+---------------------------------------------------------
      ytotal |  1,596,433    8861.964    16718.14          0    7244333
 nbr_above14 |  1,596,433     2.50189    2.117106          0         98
  nbr_people |  1,596,433    3.774374    1.881843          1         25
 nbr_under14 |  1,596,433    .9959622    1.285323          0         13
     y_hogar |  1,596,433    26369.15    32636.53          0    7681180
-------------+---------------------------------------------------------
 piped_water |  1,596,433    .9650953    .1835385          0          1
      toilet |  1,596,433    .9216015    .2687978          0          1
      sewage |  1,596,433    .6011752    .4896567          0          1
       stove |  1,596,433    .9422719    .2332286          0          1
   hot_water |  1,596,433    .8763713    .3291576          0          1
-------------+---------------------------------------------------------
  refrigerat |  1,596,433    .8222074    .3823382          0          1
          tv |  1,596,433    .9584868    .1994739          0          1
         car |  1,596,433    .3518933     .477561          0          1
    computer |  1,596,433    .5094144    .4999115          0          1
    internet |  1,596,433    .3443364    .4751515          0          1
-------------+---------------------------------------------------------
health_ins~e |  1,596,433    2.811395    1.513308          0          5
public_hea~h |  1,596,433    .3230821    .4676539          0          1
      blanco |  1,317,410    .9579015     .200814          0          1
   trimestre |  1,596,433    2.497935    1.116775          1          4
     married |  1,327,608    .5293648    .4991371          0          1
-------------+---------------------------------------------------------
  estudiante |  1,596,433    .0697198    .2546743          0          1
     trabajo |  1,596,433    .4458333    .4970575          0          1
horas_trab~o |  1,596,433    18.34563    23.24192          0        157
     pesomen |  1,202,938     269.108    109.5839          1       2451
       lp_06 |  1,317,410     17780.7    9152.768       3274   103313.2
-------------+---------------------------------------------------------
    loc_code |          0




(note: file ../temp/clean_loc_2001_2015.dta not found)
file ../temp/clean_loc_2001_2015.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./gen_analysis_vars.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./gen_analysis_vars.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main
  1.     use ../temp/clean_loc_2001_2015.dta, clear
  2.     
.     fix_2012_weights, by_vars(loc_code trimestre edad hombre)
  3.     
.     add_cpi_2006
  4.     impute_poverty_lines_pre06, by_vars(trimestre loc_code nbr_above14 nbr
> _people)
  5. 
.     sample_restrictions
  6.     gen_and_modify_vars
  7.     label_vars
  8. 
.     keep numero pers anio anio_sem anio_qtr semestre trimestre mes ///
>         dpto loc_code ccz hombre edad blanco poor public_health married ///
>         single y_hogar nbr_people nbr_under14 piped_water toilet sewage ///
>         stove hot_water refrigerat tv car computer internet ///
>         trabajo estudiante horas_trabajo work_part_time ///
>         young adult fertile infertile kids_before pesoan pesosem pesotri
  9.     order numero pers anio anio_sem anio_qtr semestre trimestre mes ///
>         dpto loc_code ccz hombre edad blanco poor public_health married ///
>         single y_hogar nbr_people nbr_under14 piped_water toilet sewage ///
>         stove hot_water refrigerat tv car computer internet ///
>         trabajo estudiante horas_trabajo work_part_time ///
>         young adult fertile infertile kids_before pesoan pesosem pesotri
 10. 
.     save_data ../temp/clean_loc_2001_2015_with_vars.dta, key(numero pers anio
> ) replace
 11. end

. 
. program fix_2012_weights
  1.     syntax, by_vars(str)
  2.     
.         keep if anio == 2013
  3.         
.     rename (pesotri pesosem) (pesotri2 pesosem2)
  4.     collapse (mean) pesotri2 pesosem2, by(`by_vars')
  5.     gen anio = 2012
  6.         
.     save ../temp/pesos_2012_imputed.dta, replace
  7. 
.     use ../temp/clean_loc_2001_2015.dta, clear
  8.         
.     merge m:1 anio `by_vars' using ../temp/pesos_2012_imputed.dta, ///
>             keepusing(pesosem2 pesotri2) keep(1 3)
  9.     replace pesotri = pesotri2 if _merge == 3
 10.     replace pesosem = pesosem2 if _merge == 3
 11.     drop pesotri2 pesosem2
 12.     
.     save ../temp/clean_loc_2001_2016_fixed_weights.dta, replace
 13. end

. 
. program add_cpi_2006
  1.     use ../../../base/Inflation/output/inflation_by_year.dta, clear 
  2.     merge 1:m anio using ../temp/clean_loc_2001_2016_fixed_weights.dta, no
> gen ///
>         assert(1 3)keep(3)
  3.     save ../temp/clean_loc_2001_2015_cpi.dta, replace
  4. end

. 
. program impute_poverty_lines_pre06
  1.     syntax, by_vars(str)
  2.     keep if anio == 2006
  3.     
.     forval year=2001/2005 {
  4.         replace anio = `year' 
  5.     
.         rename lp_06 lp_06_2
  6.         collapse (mean) lp_06_2, by(`by_vars')
  7.     
.         save ../temp/poverty_`year'_imputed.dta, replace
  8. 
.         use ../temp/clean_loc_2001_2015_cpi.dta, clear
  9. 
.         merge m:1 `by_vars' using ../temp/poverty_`year'_imputed.dta, nogen
 10.         replace lp_06 = lp_06_2 if anio == `year'
 11.     
.         drop lp_06_2
 12.         replace lp_06 = (lp_06 * cpi_2006)/100 if anio == `year'
 13.         save ../temp/clean_loc_2001_2016_fixed.dta, replace
 14.     }
 15. end

. 
. program sample_restrictions
  1.     keep if inrange(edad, 15, 60)
  2. end

. 
. program gen_and_modify_vars
  1.     replace horas_trabajo = . if horas_trabajo > 100
  2.     replace nbr_people = . if (nbr_people < nbr_under14)
  3.     replace nbr_under14 = . if (nbr_people < nbr_under14)
  4.         gen kids_before = (nbr_under14 > 0) if !missing(nbr_under14)
  5. 
.     gen single      = (married==0)            if !mi(married)
  6.         
.     gen poor       = (y_hogar <= lp_06)
  7.     gen ind_under14 = (nbr_under14>0)
  8.     gen work_part_time = (horas_trabajo<32) if !mi(horas_trabajo) & trabaj
> o==1
  9. 
.     assert !mi(edad)
 10.     gen yob = anio - edad
 11.     gen young   = inrange(edad,15,30)
 12.     gen adult   = inrange(edad,31,44)
 13.     gen infertile = inrange(edad,45,60)
 14.     gen fertile = inrange(edad,15,44)
 15.     
.     gen     semestre = 1 if inlist(trimestre, 1, 2)
 16.     replace semestre = 2 if inlist(trimestre, 3, 4)
 17.     gen     anio_sem = yh(anio, semestre)
 18.     format  anio_sem %th
 19.     gen     anio_qtr = yq(anio, trimestre)
 20.     format  anio_qtr %tq
 21. end

. 
. program label_vars
  1.     label var trabajo "Employment"
  2.     label var horas_trabajo "Hours worked"
  3.     label var work_part_time "Part-time work"
  4.     
.     lab def young                 0 "Age: 31-44"             1 "Age: 15-30"
  5.     lab val young                 age_young    
  6. end

. 
. * EXECUTE
. main
(1,474,710 observations deleted)
(note: file ../temp/pesos_2012_imputed.dta not found)
file ../temp/pesos_2012_imputed.dta saved
(note: variable anio was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,492,376
        from master                 1,492,376  (_merge==1)
        from using                          0  (_merge==2)

    matched                           104,057  (_merge==3)
    -----------------------------------------
variable pesotri was int now float
(104,057 real changes made)
variable pesosem was int now float
(104,057 real changes made)
(note: file ../temp/clean_loc_2001_2016_fixed_weights.dta not found)
file ../temp/clean_loc_2001_2016_fixed_weights.dta saved
(note: variable anio was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,596,433  
    -----------------------------------------
(note: file ../temp/clean_loc_2001_2015_cpi.dta not found)
file ../temp/clean_loc_2001_2015_cpi.dta saved
(1,386,529 observations deleted)
(209,904 real changes made)
(note: file ../temp/poverty_2001_imputed.dta not found)
file ../temp/poverty_2001_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       707,586
        from master                   707,586  
        from using                          0  

    matched                           888,847  
    -----------------------------------------
(32,518 real changes made)
(32,518 real changes made)
(note: file ../temp/clean_loc_2001_2016_fixed.dta not found)
file ../temp/clean_loc_2001_2016_fixed.dta saved
(1,540,106 real changes made)
(note: file ../temp/poverty_2002_imputed.dta not found)
file ../temp/poverty_2002_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,596,433  
    -----------------------------------------
(55,555 real changes made)
(55,555 real changes made)
file ../temp/clean_loc_2001_2016_fixed.dta saved
(1,541,064 real changes made)
(note: file ../temp/poverty_2003_imputed.dta not found)
file ../temp/poverty_2003_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,596,433  
    -----------------------------------------
(54,556 real changes made)
(54,556 real changes made)
file ../temp/clean_loc_2001_2016_fixed.dta saved
(1,540,846 real changes made)
(note: file ../temp/poverty_2004_imputed.dta not found)
file ../temp/poverty_2004_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,596,433  
    -----------------------------------------
(54,712 real changes made)
(54,712 real changes made)
file ../temp/clean_loc_2001_2016_fixed.dta saved
(1,542,103 real changes made)
(note: file ../temp/poverty_2005_imputed.dta not found)
file ../temp/poverty_2005_imputed.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,596,433  
    -----------------------------------------
(53,519 real changes made)
(53,519 real changes made)
file ../temp/clean_loc_2001_2016_fixed.dta saved
(681,375 observations deleted)
(88 real changes made, 88 to missing)
(0 real changes made)
(0 real changes made)
(267,629 missing values generated)
(456,753 missing values generated)
(456,753 real changes made)
(data now sorted by numero pers anio)
  variable anio was float now int
  variable anio_sem was float now int
  variable anio_qtr was float now int
  variable semestre was float now byte
  variable poor was float now byte
  variable single was float now byte
  variable horas_trabajo was int now byte
  variable work_part_time was float now byte
  variable young was float now byte
  variable adult was float now byte
  variable fertile was float now byte
  variable infertile was float now byte
  (25,621,624 bytes saved)
===============================================================================
> ===================
File: ../temp/clean_loc_2001_2015_with_vars.dta
Key: numero pers anio
===============================================================================
> ===================
  915058:41(37257):287027348:2230765615

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      numero |    915,058    7.67e+08    9.78e+08          1   2.02e+09
        pers |    915,058    1.989836    1.076937          1         18
        anio |    915,058    2008.927     3.88772       2001       2015
    anio_sem |    915,058    98.35235    7.792123         82        111
    anio_qtr |    915,058    197.2043    15.59203        164        223
-------------+---------------------------------------------------------
    semestre |    915,058    1.499152    .4999996          1          2
   trimestre |    915,058    2.497919    1.116089          1          4
         mes |    915,058    6.493061     3.44095          1         12
        dpto |    915,058    5.577102    5.767955          1         19
    loc_code |          0
-------------+---------------------------------------------------------
         ccz |    915,058    4.020105    5.523373          0         18
      hombre |    915,058    .4729602    .4992686          0          1
        edad |    915,058    36.78708     13.0508         16         60
      blanco |    756,659    .9535749    .2104041          0          1
        poor |    915,058    .4354128    .4958112          0          1
-------------+---------------------------------------------------------
public_hea~h |    915,058    .3023972    .4592966          0          1
     married |    915,058    .5859978    .4925491          0          1
     y_hogar |    915,058     28615.9    33576.33          0    2077094
  nbr_people |    915,058    3.778865    1.729525          1         25
 nbr_under14 |    915,058    .8172313    1.110787          0         13
-------------+---------------------------------------------------------
 piped_water |    915,058    .9697047    .1713989          0          1
      toilet |    915,058    .9304394    .2544052          0          1
      sewage |    915,058    .6098663    .4877803          0          1
       stove |    915,058    .9487989    .2204079          0          1
   hot_water |    915,058    .8910146    .3116211          0          1
-------------+---------------------------------------------------------
  refrigerat |    915,058    .8273552    .3779401          0          1
          tv |    915,058    .9635772    .1873399          0          1
         car |    915,058    .3826424    .4860324          0          1
    computer |    915,058    .5614868    .4962052          0          1
    internet |    915,058    .3983911    .4895671          0          1
-------------+---------------------------------------------------------
     trabajo |    915,058     .707624    .4548544          0          1
  estudiante |    915,058    .0735167    .2609828          0          1
horas_trab~o |    914,970    29.51946    23.41484          0        100
work_part_~e |    647,429    .2529976    .4347299          0          1
       young |    915,058    .3680368    .4822717          0          1
-------------+---------------------------------------------------------
       adult |    915,058    .3294228    .4700039          0          1
     fertile |    915,058    .6974596    .4593582          0          1
   infertile |    915,058    .3025404    .4593582          0          1
      pesoan |    915,058    26.65265    13.14307          1       1323
     pesosem |    910,064    53.00323    26.12901          3       1345
-------------+---------------------------------------------------------
     pesotri |    910,064    106.0854    50.73565          1       1527




(note: file ../temp/clean_loc_2001_2015_with_vars.dta not found)
file ../temp/clean_loc_2001_2015_with_vars.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./assign_treatment.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./assign_treatment.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main
  1.     import_treatment_dates
  2.     assign_treatment
  3.     save_data ../temp/ECH_panel.dta, key(anio numero pers) replace
  4. end

. 
. program import_treatment_dates
  1.     import excel ../../../raw/timeline_implementation.xlsx, clear firstrow
>  cellrange(D1:E14)
  2.     keep if !mi(impl_date)
  3.     
.     bys dpto: egen impl_date_dpto = min(impl_date)
  4.     gen IS_impl_date = impl_date_dpto
  5.     format %td IS_impl_date
  6. 
.     keep dpto IS_impl_date
  7.     duplicates drop
  8.     save_data ../temp/timeline_implementation.dta, key(dpto) replace
  9. 
.     import excel ../../../raw/control_impl_dates.xlsx, clear firstrow
 10.     keep dpto impl_date
 11.     save_data ../temp/timeline_control_implementation.dta, key(dpto) repla
> ce
 12. end

. 
. program assign_treatment
  1.     use ../temp/clean_loc_2001_2015_with_vars.dta, clear
  2.     merge m:1 dpto using ../temp/timeline_implementation.dta, ///
>         keepusing(IS_impl_date)
  3.     gen montevideo = (dpto == 1)        
  4.     gen treated = (_merge == 3 & dpto != 1)
  5.     drop _merge
  6.     merge m:1 dpto using ../temp/timeline_control_implementation.dta, ///
>         keepusing(impl_date)
  7.     replace IS_impl_date = impl_date if _merge == 3
  8.     gen control = (_merge == 3)
  9.     drop impl_date _merge
 10.     gen treated_or_control = (treated == 1 | control == 1)
 11.     
.     relative_time, event_date(IS_impl_date) time(anio_qtr) time_fun(qofd) win
> dow(12)
 12.     relative_time, event_date(IS_impl_date) time(anio_sem) time_fun(hofd) 
> window(6)
 13.     relative_time, event_date(IS_impl_date) time(anio) time_fun(yofd) wind
> ow(4)
 14. 
.     /*gen VTP_impl_date = td(01jan2013)
>     format %td VTP_impl_date*/
. end

. 
. program relative_time
  1.     syntax, event_date(str) time(str) time_fun(str) window(int) 
  2.   
.     gen rel_t_`time' = `time' - `time_fun'(`event_date') if !missing(IS_impl_
> date)
  3.     bysort dpto: gen post_`time' = (`time' >= `time_fun'(`event_date'))   
>  
  4.     replace rel_t_`time' = -1000    if rel_t_`time' < -`window' & !missing
> (IS_impl_date)
  5.     replace rel_t_`time' = 1000 if rel_t_`time' >  `window' & !missing(IS_
> impl_date)
  6.     replace rel_t_`time' = rel_t_`time' + `window' + 1 if ///
>         (rel_t_`time' != -1000 & rel_t_`time' != 1000 & !missing(IS_impl_date
> )) ///
>         
  7.     replace rel_t_`time' = 0 if rel_t_`time' == -1000 & !missing(IS_impl_d
> ate)
  8.     assert !mi(rel_t_`time') if !missing(IS_impl_date)
  9.     tab rel_t_`time', m
 10. end

. 
. 
. * EXECUTE
. main
(3 observations deleted)

Duplicates in terms of all variables

(5 observations deleted)
(data already sorted by dpto)
  variable IS_impl_date was float now int
  (10 bytes saved)
===============================================================================
> ===================
File: ../temp/timeline_implementation.dta
Key: dpto
===============================================================================
> ===================
  5:2(47831):3244004639:1048402393

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        dpto |          5         8.2    6.379655          1         16
IS_impl_date |          5     17373.2    865.7868      16162      18414




(note: file ../temp/timeline_implementation.dta not found)
file ../temp/timeline_implementation.dta saved
(data now sorted by dpto)
  (0 bytes saved)
===============================================================================
> ===================
File: ../temp/timeline_control_implementation.dta
Key: dpto
===============================================================================
> ===================
  4:2(32042):140096628:1429260735

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        dpto |          4        4.75    2.217356          2          7
   impl_date |          4     18079.5    386.2473      17745      18414




(note: file ../temp/timeline_control_implementation.dta not found)
file ../temp/timeline_control_implementation.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       318,808
        from master                   318,808  (_merge==1)
        from using                          0  (_merge==2)

    matched                           612,106  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                       844,945
        from master                   844,945  (_merge==1)
        from using                          0  (_merge==2)

    matched                            72,683  (_merge==3)
    -----------------------------------------
(70,113 real changes made)
(248,695 missing values generated)
(43,613 real changes made)
(356,930 real changes made)
(265,820 real changes made)
(43,613 real changes made)

rel_t_anio_ |
        qtr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     43,613        4.77        4.77
          1 |      7,216        0.79        5.55
          2 |      7,094        0.78        6.33
          3 |      9,015        0.99        7.32
          4 |      9,418        1.03        8.34
          5 |      9,543        1.04        9.39
          6 |      9,351        1.02       10.41
          7 |      8,249        0.90       11.31
          8 |      8,393        0.92       12.23
          9 |      8,473        0.93       13.15
         10 |      8,493        0.93       14.08
         11 |      8,349        0.91       14.99
         12 |      9,088        0.99       15.99
         13 |      9,188        1.00       16.99
         14 |      9,205        1.01       18.00
         15 |      8,917        0.97       18.97
         16 |      9,597        1.05       20.02
         17 |      9,752        1.07       21.09
         18 |      9,476        1.04       22.12
         19 |      9,186        1.00       23.13
         20 |     17,660        1.93       25.06
         21 |     17,934        1.96       27.02
         22 |     17,551        1.92       28.93
         23 |     17,749        1.94       30.87
         24 |     13,660        1.49       32.37
         25 |     13,263        1.45       33.82
       1000 |    356,930       39.01       72.82
          . |    248,695       27.18      100.00
------------+-----------------------------------
      Total |    915,058      100.00
(248,695 missing values generated)
(36,804 real changes made)
(356,076 real changes made)
(273,483 real changes made)
(36,804 real changes made)

rel_t_anio_ |
        sem |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     36,804        4.02        4.02
          1 |     14,276        1.56        5.58
          2 |     18,017        1.97        7.55
          3 |     18,954        2.07        9.62
          4 |     16,577        1.81       11.43
          5 |     16,826        1.84       13.27
          6 |     16,908        1.85       15.12
          7 |     18,398        2.01       17.13
          8 |     17,943        1.96       19.09
          9 |     19,202        2.10       21.19
         10 |     18,547        2.03       23.22
         11 |     35,513        3.88       27.10
         12 |     35,450        3.87       30.97
         13 |     26,872        2.94       33.91
       1000 |    356,076       38.91       72.82
          . |    248,695       27.18      100.00
------------+-----------------------------------
      Total |    915,058      100.00
(248,695 missing values generated)
(20,494 real changes made)
(277,533 real changes made)
(368,336 real changes made)
(20,494 real changes made)

 rel_t_anio |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,494        2.24        2.24
          1 |     15,832        1.73        3.97
          2 |     28,524        3.12        7.09
          3 |     37,510        4.10       11.19
          4 |     33,682        3.68       14.87
          5 |     36,615        4.00       18.87
          6 |     38,165        4.17       23.04
          7 |     70,913        7.75       30.79
          8 |     53,236        5.82       36.61
          9 |     53,859        5.89       42.49
       1000 |    277,533       30.33       72.82
          . |    248,695       27.18      100.00
------------+-----------------------------------
      Total |    915,058      100.00
(data now sorted by anio numero pers)
  variable montevideo was float now byte
  variable treated was float now byte
  variable control was float now byte
  variable treated_or_control was float now byte
  variable rel_t_anio_qtr was float now int
  variable post_anio_qtr was float now byte
  variable rel_t_anio_sem was float now int
  variable post_anio_sem was float now byte
  variable rel_t_anio was float now int
  variable post_anio was float now byte
  (24,706,566 bytes saved)
===============================================================================
> ===================
File: ../temp/ECH_panel.dta
Key: anio numero pers
===============================================================================
> ===================
  915058:52(103343):1784134339:3203127821

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        anio |    915,058    2008.927     3.88772       2001       2015
      numero |    915,058    7.67e+08    9.78e+08          1   2.02e+09
        pers |    915,058    1.989836    1.076937          1         18
    anio_sem |    915,058    98.35235    7.792123         82        111
    anio_qtr |    915,058    197.2043    15.59203        164        223
-------------+---------------------------------------------------------
    semestre |    915,058    1.499152    .4999996          1          2
   trimestre |    915,058    2.497919    1.116089          1          4
         mes |    915,058    6.493061     3.44095          1         12
        dpto |    915,058    5.577102    5.767955          1         19
    loc_code |          0
-------------+---------------------------------------------------------
         ccz |    915,058    4.020105    5.523373          0         18
      hombre |    915,058    .4729602    .4992686          0          1
        edad |    915,058    36.78708     13.0508         16         60
      blanco |    756,659    .9535749    .2104041          0          1
        poor |    915,058    .4354128    .4958112          0          1
-------------+---------------------------------------------------------
public_hea~h |    915,058    .3023972    .4592966          0          1
     married |    915,058    .5859978    .4925491          0          1
     y_hogar |    915,058     28615.9    33576.33          0    2077094
  nbr_people |    915,058    3.778865    1.729525          1         25
 nbr_under14 |    915,058    .8172313    1.110787          0         13
-------------+---------------------------------------------------------
 piped_water |    915,058    .9697047    .1713989          0          1
      toilet |    915,058    .9304394    .2544052          0          1
      sewage |    915,058    .6098663    .4877803          0          1
       stove |    915,058    .9487989    .2204079          0          1
   hot_water |    915,058    .8910146    .3116211          0          1
-------------+---------------------------------------------------------
  refrigerat |    915,058    .8273552    .3779401          0          1
          tv |    915,058    .9635772    .1873399          0          1
         car |    915,058    .3826424    .4860324          0          1
    computer |    915,058    .5614868    .4962052          0          1
    internet |    915,058    .3983911    .4895671          0          1
-------------+---------------------------------------------------------
     trabajo |    915,058     .707624    .4548544          0          1
  estudiante |    915,058    .0735167    .2609828          0          1
horas_trab~o |    914,970    29.51946    23.41484          0        100
work_part_~e |    647,429    .2529976    .4347299          0          1
       young |    915,058    .3680368    .4822717          0          1
-------------+---------------------------------------------------------
       adult |    915,058    .3294228    .4700039          0          1
     fertile |    915,058    .6974596    .4593582          0          1
   infertile |    915,058    .3025404    .4593582          0          1
      pesoan |    915,058    26.65265    13.14307          1       1323
     pesosem |    910,064    53.00323    26.12901          3       1345
-------------+---------------------------------------------------------
     pesotri |    910,064    106.0854    50.73565          1       1527
IS_impl_date |    666,363    16692.53    775.2962      16162      18414
  montevideo |    915,058     .446222    .4970998          0          1
     treated |    915,058    .2053761    .4039764          0          1
     control |    915,058    .0766214    .2659899          0          1
-------------+---------------------------------------------------------
treated_or~l |    915,058    .2819974    .4499723          0          1
rel_t_anio~r |    666,363    541.5021    492.4656          0       1000
post_anio_~r |    915,058    .5683443    .4953073          0          1
rel_t_anio~m |    666,363    537.5915    495.3631          0       1000
post_anio_~m |    915,058    .5770137    .4940336          0          1
-------------+---------------------------------------------------------
  rel_t_anio |    666,363    419.6995     490.269          0       1000
   post_anio |    915,058    .5795491    .4936317          0          1




(note: file ../temp/ECH_panel.dta not found)
file ../temp/ECH_panel.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./create_panels.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./create_panels.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main
  1.     create_main_panels
  2.     create_placebo_men_panels
  3.     create_placebo_infertile_panels
  4. end    

. 
. program create_main_panels
  1.     use ../temp/ECH_panel.dta, clear
  2.     keep if inrange(edad, 15, 44)
  3.     keep if hombre == 0
  4. 
.     preserve
  5.     keep if treated_or_control == 1
  6.     drop treated_or_control control montevideo
  7.     save_data ../output/main_ECH_panel.dta, key(anio pers numero) replace
  8.     restore
  9. 
.     keep if montevideo == 1
 10.     drop treated_or_control treated control montevideo
 11.     save_data ../output/main_ECH_panel_mvd.dta, key(anio pers numero) repl
> ace
 12. end

. 
. program create_placebo_men_panels
  1.     use ../temp/ECH_panel.dta, clear
  2.     keep if inrange(edad, 15, 44)
  3.     keep if hombre == 1
  4. 
.     preserve
  5.     keep if treated_or_control == 1
  6.     drop treated_or_control control montevideo
  7.     save_data ../output/placebo_men_ECH_panel.dta, key(anio pers numero) r
> eplace
  8.     restore
  9. 
.     keep if montevideo == 1
 10.     drop treated_or_control treated control montevideo
 11.     save_data ../output/placebo_men_ECH_panel_mvd.dta, key(anio pers numer
> o) replace    
 12. end

. 
. program create_placebo_infertile_panels
  1.     use ../temp/ECH_panel.dta, clear
  2.     keep if inrange(edad, 45, 60)
  3.     keep if hombre == 0
  4. 
.     preserve
  5.     keep if treated_or_control == 1
  6.     drop treated_or_control control montevideo
  7.     save_data ../output/placebo_infertile_ECH_panel.dta, key(anio pers num
> ero) replace
  8.     restore 
  9. 
.     keep if montevideo == 1
 10.     drop treated_or_control treated control montevideo
 11.     save_data ../output/placebo_infertile_ECH_panel_mvd.dta, key(anio pers
>  numero) replace    
 12. end

. 
. * EXECUTE
. main
(276,842 observations deleted)
(305,585 observations deleted)
(238,989 observations deleted)
(data now sorted by anio pers numero)
  (0 bytes saved)
===============================================================================
> ===================
File: ../output/main_ECH_panel.dta
Key: anio pers numero
===============================================================================
> ===================
  94704:51(77026):2432981046:4243250293

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        anio |     94,704    2009.195    3.816078       2001       2015
        pers |     94,704    2.360819    1.068736          1         18
      numero |     94,704    8.06e+08    9.86e+08         18   2.02e+09
    anio_sem |     94,704    98.88696    7.648955         82        111
    anio_qtr |     94,704     198.275    15.30773        164        223
-------------+---------------------------------------------------------
    semestre |     94,704    1.496484    .4999903          1          2
   trimestre |     94,704    2.494034    1.114543          1          4
         mes |     94,704    6.475122    3.434981          1         12
        dpto |     94,704    6.110629    4.650822          2         16
    loc_code |          0
-------------+---------------------------------------------------------
         ccz |     94,704           0           0          0          0
      hombre |     94,704           0           0          0          0
        edad |     94,704    29.03364    8.956272         15         44
      blanco |     80,693    .9529079    .2118371          0          1
        poor |     94,704    .4961248    .4999876          0          1
-------------+---------------------------------------------------------
public_hea~h |     94,704    .4615011    .4985183          0          1
     married |     94,704     .538161    .4985442          0          1
      single |     94,704     .461839    .4985442          0          1
     y_hogar |     94,704    21125.01    23592.67          0    1279333
  nbr_people |     94,704    4.200044    1.732179          1         20
-------------+---------------------------------------------------------
 nbr_under14 |     94,704    1.195609    1.218828          0         12
 piped_water |     94,704     .955514    .2061733          0          1
      toilet |     94,704    .9003104    .2995872          0          1
      sewage |     94,704    .3678936    .4822348          0          1
       stove |     94,704    .9282924    .2580046          0          1
-------------+---------------------------------------------------------
   hot_water |     94,704    .8517169    .3553822          0          1
  refrigerat |     94,704    .8117925    .3908798          0          1
          tv |     94,704    .9593998    .1973632          0          1
         car |     94,704    .3456137    .4755705          0          1
    computer |     94,704    .5615602    .4961985          0          1
-------------+---------------------------------------------------------
    internet |     94,704    .3391831    .4734346          0          1
     trabajo |     94,704    .5351622    .4987647          0          1
  estudiante |     94,704    .1516303    .3586641          0          1
horas_trab~o |     94,692    19.46464    21.87143          0        100
work_part_~e |     50,670    .3934083    .4885109          0          1
-------------+---------------------------------------------------------
       young |     94,704    .5440847    .4980554          0          1
       adult |     94,704    .4559153    .4980554          0          1
     fertile |     94,704           1           0          1          1
   infertile |     94,704           0           0          0          0
 kids_before |     94,704    .6620417    .4730167          0          1
-------------+---------------------------------------------------------
      pesoan |     94,704    26.91435    14.25137          1       1323
     pesosem |     93,901    53.80161    27.50897          3       1345
     pesotri |     93,901    107.3786    52.52821          1       1527
IS_impl_date |     94,704     17537.4    635.7534      16892      18414
     treated |     94,704     .725302    .4463643          0          1
-------------+---------------------------------------------------------
rel_t_anio~r |     94,704    403.5145    484.4383          0       1000
post_anio_~r |     94,704    .6503104    .4768744          0          1
rel_t_anio~m |     94,704     397.263    485.8859          0       1000
post_anio_~m |     94,704    .6643225    .4722292          0          1
  rel_t_anio |     94,704    282.7584    446.5721          0       1000
-------------+---------------------------------------------------------
   post_anio |     94,704    .6731183    .4690761          0          1




(note: file ../output/main_ECH_panel.dta not found)
file ../output/main_ECH_panel.dta saved
(183,388 observations deleted)
(data now sorted by anio pers numero)
  variable pesoan was int now byte
  (149,476 bytes saved)
===============================================================================
> ===================
File: ../output/main_ECH_panel_mvd.dta
Key: anio pers numero
===============================================================================
> ===================
  149476:50(44097):2145356931:836494779

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        anio |    149,476    2008.516    3.969829       2001       2015
        pers |    149,476    2.321998    1.110231          1         18
      numero |    149,476    6.91e+08    9.56e+08          1   2.02e+09
    anio_sem |    149,476    97.53053    7.954815         82        111
    anio_qtr |    149,476    195.5604    15.91569        164        223
-------------+---------------------------------------------------------
    semestre |    149,476    1.497852    .4999971          1          2
   trimestre |    149,476    2.495076    1.116308          1          4
         mes |    149,476    6.484118    3.441868          1         12
        dpto |    149,476           1           0          1          1
    loc_code |          0
-------------+---------------------------------------------------------
         ccz |    149,476    9.023669    4.862772          1         18
      hombre |    149,476           0           0          0          0
        edad |    149,476    29.17003    8.591031         15         44
      blanco |    117,427    .9467754    .2244819          0          1
        poor |    149,476    .5223782    .4995006          0          1
-------------+---------------------------------------------------------
public_hea~h |    149,476    .2196941    .4140408          0          1
     married |    149,476    .4831478    .4997176          0          1
      single |    149,476    .5168522    .4997176          0          1
     y_hogar |    149,476    30343.77    35714.64          0    2077094
  nbr_people |    149,476    3.877827    1.723012          1         25
-------------+---------------------------------------------------------
 nbr_under14 |    149,476    .9489015    1.148216          0         13
 piped_water |    149,476    .9838837    .1259233          0          1
      toilet |    149,476    .9462255     .225573          0          1
      sewage |    149,476    .7916856    .4061042          0          1
       stove |    149,476    .9699818    .1706379          0          1
-------------+---------------------------------------------------------
   hot_water |    149,476    .9159598    .2774491          0          1
  refrigerat |    149,476    .8283738    .3770565          0          1
          tv |    149,476    .9731663    .1615978          0          1
         car |    149,476    .3524646    .4777393          0          1
    computer |    149,476    .6280607    .4833239          0          1
-------------+---------------------------------------------------------
    internet |    149,476    .4711191    .4991669          0          1
     trabajo |    149,476    .6184404     .485771          0          1
  estudiante |    149,476    .1374535    .3443266          0          1
horas_trab~o |    149,473     23.1198    21.56033          0        100
work_part_~e |     92,439    .3344043    .4717844          0          1
-------------+---------------------------------------------------------
       young |    149,476    .5544101    .4970324          0          1
       adult |    149,476    .4455899    .4970324          0          1
     fertile |    149,476           1           0          1          1
   infertile |    149,476           0           0          0          0
 kids_before |    149,476    .5459003    .4978904          0          1
-------------+---------------------------------------------------------
      pesoan |    149,476    27.39077    10.45482          1        100
     pesosem |    149,476    54.24254    19.77647          5        232
     pesotri |    149,476    109.1234     38.8381          1        600
IS_impl_date |    149,476       16162           0      16162      16162
rel_t_anio~r |    149,476    622.1743    478.9753          0       1000
-------------+---------------------------------------------------------
post_anio_~r |    149,476    .8592215     .347794          0          1
rel_t_anio~m |    149,476    619.5781     482.248          1       1000
post_anio_~m |    149,476    .8697383    .3365923          0          1
  rel_t_anio |    149,476    499.5217    496.8992          2       1000
   post_anio |    149,476    .8697383    .3365923          0          1




(note: file ../output/main_ECH_panel_mvd.dta not found)
file ../output/main_ECH_panel_mvd.dta saved
(276,842 observations deleted)
(332,631 observations deleted)
(219,171 observations deleted)
(data now sorted by anio pers numero)
  (0 bytes saved)
===============================================================================
> ===================
File: ../output/placebo_men_ECH_panel.dta
Key: anio pers numero
===============================================================================
> ===================
  87886:51(77026):2766211147:404481497

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        anio |     87,886    2009.161    3.821446       2001       2015
        pers |     87,886    2.231846    1.291791          1         17
      numero |     87,886    8.00e+08    9.85e+08         28   2.02e+09
    anio_sem |     87,886    98.82141     7.65998         82        111
    anio_qtr |     87,886    198.1437    15.32705        164        223
-------------+---------------------------------------------------------
    semestre |     87,886    1.499647    .5000027          1          2
   trimestre |     87,886    2.500205    1.113083          1          4
         mes |     87,886    6.499397    3.431534          1         12
        dpto |     87,886    6.120975    4.664554          2         16
    loc_code |          0
-------------+---------------------------------------------------------
         ccz |     87,886           0           0          0          0
      hombre |     87,886           1           0          1          1
        edad |     87,886    28.45435    9.028143         15         44
      blanco |     74,591    .9533456     .210899          0          1
        poor |     87,886    .4349953    .4957592          0          1
-------------+---------------------------------------------------------
public_hea~h |     87,886    .3651549    .4814763          0          1
     married |     87,886    .4775391    .4994981          0          1
      single |     87,886    .5224609    .4994981          0          1
     y_hogar |     87,886    23836.33    25003.43          0   646520.7
  nbr_people |     87,886    4.093758    1.778819          1         20
-------------+---------------------------------------------------------
 nbr_under14 |     87,886    1.002435    1.186752          0         11
 piped_water |     87,886    .9501058    .2177276          0          1
      toilet |     87,886    .8948183    .3067892          0          1
      sewage |     87,886    .3604328    .4801288          0          1
       stove |     87,886    .9231618     .266336          0          1
-------------+---------------------------------------------------------
   hot_water |     87,886    .8431377     .363673          0          1
  refrigerat |     87,886    .8090139    .3930803          0          1
          tv |     87,886    .9533259    .2109411          0          1
         car |     87,886    .3547778    .4784487          0          1
    computer |     87,886    .5268757      .49928          0          1
-------------+---------------------------------------------------------
    internet |     87,886    .3283231    .4696057          0          1
     trabajo |     87,886     .753442    .4310096          0          1
  estudiante |     87,886     .121157    .3263114          0          1
horas_trab~o |     87,865    34.28644    23.76427          0        100
work_part_~e |     66,196    .1663394    .3723878          0          1
-------------+---------------------------------------------------------
       young |     87,886     .571479    .4948672          0          1
       adult |     87,886     .428521    .4948672          0          1
     fertile |     87,886           1           0          1          1
   infertile |     87,886           0           0          0          0
 kids_before |     87,886    .5608857    .4962819          0          1
-------------+---------------------------------------------------------
      pesoan |     87,886    27.42749    14.40355          1       1323
     pesosem |     87,117    54.95273    27.95792          3       1345
     pesotri |     87,117    109.6526    53.54233          1       1527
IS_impl_date |     87,886    17528.09    632.3782      16892      18414
     treated |     87,886    .7291719      .44439          0          1
-------------+---------------------------------------------------------
rel_t_anio~r |     87,886    402.6027    484.2395          0       1000
post_anio_~r |     87,886    .6498077    .4770327          0          1
rel_t_anio~m |     87,886    396.5782     485.736          0       1000
post_anio_~m |     87,886    .6635983    .4724808          0          1
  rel_t_anio |     87,886    280.9243    445.6605          0       1000
-------------+---------------------------------------------------------
   post_anio |     87,886    .6727693    .4692049          0          1




(note: file ../output/placebo_men_ECH_panel.dta not found)
file ../output/placebo_men_ECH_panel.dta saved
(169,419 observations deleted)
(data now sorted by anio pers numero)
  variable pesoan was int now byte
  (137,348 bytes saved)
===============================================================================
> ===================
File: ../output/placebo_men_ECH_panel_mvd.dta
Key: anio pers numero
===============================================================================
> ===================
  137348:50(44097):3946587359:4008791026

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        anio |    137,348    2008.529    3.973218       2001       2015
        pers |    137,348    2.230801    1.270076          1         15
      numero |    137,348    6.95e+08    9.57e+08          1   2.02e+09
    anio_sem |    137,348    97.55831    7.963546         82        111
    anio_qtr |    137,348    195.6156    15.93288        164        223
-------------+---------------------------------------------------------
    semestre |    137,348    1.499352    .5000014          1          2
   trimestre |    137,348     2.49767    1.117469          1          4
         mes |    137,348    6.489669     3.44513          1         12
        dpto |    137,348           1           0          1          1
    loc_code |          0
-------------+---------------------------------------------------------
         ccz |    137,348    9.105389    4.857708          1         18
      hombre |    137,348           1           0          1          1
        edad |    137,348    28.62493    8.612458         15         44
      blanco |    107,941    .9459983    .2260221          0          1
        poor |    137,348    .4913941    .4999278          0          1
-------------+---------------------------------------------------------
public_hea~h |    137,348      .18258    .3863232          0          1
     married |    137,348    .4467266    .4971557          0          1
      single |    137,348    .5532734    .4971557          0          1
     y_hogar |    137,348    32475.28    38181.02          0    1342471
  nbr_people |    137,348    3.813634    1.733575          1         25
-------------+---------------------------------------------------------
 nbr_under14 |    137,348    .7903137    1.096351          0         13
 piped_water |    137,348    .9828538    .1298166          0          1
      toilet |    137,348    .9456272    .2267527          0          1
      sewage |    137,348    .7849623      .41085          0          1
       stove |    137,348    .9679791    .1760561          0          1
-------------+---------------------------------------------------------
   hot_water |    137,348     .913599    .2809563          0          1
  refrigerat |    137,348    .8299866    .3756459          0          1
          tv |    137,348    .9697629    .1712396          0          1
         car |    137,348    .3731834     .483652          0          1
    computer |    137,348    .6131069    .4870406          0          1
-------------+---------------------------------------------------------
    internet |    137,348    .4705565    .4991341          0          1
     trabajo |    137,348    .7449617    .4358843          0          1
  estudiante |    137,348    .1253604    .3311283          0          1
horas_trab~o |    137,338    32.98341    23.49818          0        100
work_part_~e |    102,309    .1833759    .3869762          0          1
-------------+---------------------------------------------------------
       young |    137,348    .5793969    .4936577          0          1
       adult |    137,348    .4206031    .4936577          0          1
     fertile |    137,348           1           0          1          1
   infertile |    137,348           0           0          0          0
 kids_before |    137,348    .4572764    .4981732          0          1
-------------+---------------------------------------------------------
      pesoan |    137,348    28.02662    10.61842          1        100
     pesosem |    137,348    55.71184    20.23098          5        192
     pesotri |    137,348    112.0266    39.75185          1        600
IS_impl_date |    137,348       16162           0      16162      16162
rel_t_anio~r |    137,348    622.4328    478.9114          0       1000
-------------+---------------------------------------------------------
post_anio_~r |    137,348    .8592116    .3478044          0          1
rel_t_anio~m |    137,348    619.8375     482.185          1       1000
post_anio_~m |    137,348    .8700163    .3362867          0          1
  rel_t_anio |    137,348    502.0234     496.916          2       1000
   post_anio |    137,348    .8700163    .3362867          0          1




(note: file ../output/placebo_men_ECH_panel_mvd.dta not found)
file ../output/placebo_men_ECH_panel_mvd.dta saved
(618,216 observations deleted)
(136,491 observations deleted)
(116,050 observations deleted)
(data now sorted by anio pers numero)
  (0 bytes saved)
===============================================================================
> ===================
File: ../output/placebo_infertile_ECH_panel.dta
Key: anio pers numero
===============================================================================
> ===================
  44301:51(77026):132886479:2540283947

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        anio |     44,301    2009.326    3.784572       2001       2015
        pers |     44,301    1.701722    .5738185          1         10
      numero |     44,301    8.38e+08    9.92e+08         11   2.02e+09
    anio_sem |     44,301    99.15027    7.588206         82        111
    anio_qtr |     44,301    198.8013    15.18558        164        223
-------------+---------------------------------------------------------
    semestre |     44,301    1.498228    .5000025          1          2
   trimestre |     44,301    2.497257    1.115911          1          4
         mes |     44,301    6.492878    3.439628          1         12
        dpto |     44,301    6.122142    4.644126          2         16
    loc_code |          0
-------------+---------------------------------------------------------
         ccz |     44,301           0           0          0          0
      hombre |     44,301           0           0          0          0
        edad |     44,301    52.21408    4.585303         45         60
      blanco |     38,097    .9528047    .2120592          0          1
        poor |     44,301    .3790659      .48516          0          1
-------------+---------------------------------------------------------
public_hea~h |     44,301    .3956344     .488992          0          1
     married |     44,301    .7197354    .4491335          0          1
      single |     44,301    .2802646    .4491335          0          1
     y_hogar |     44,301    23784.24    25565.91          0   646520.7
  nbr_people |     44,301     3.28672    1.580682          1         20
-------------+---------------------------------------------------------
 nbr_under14 |     44,301    .4154985    .8126944          0         11
 piped_water |     44,301    .9718742     .165334          0          1
      toilet |     44,301    .9335455    .2490777          0          1
      sewage |     44,301    .4049344    .4908849          0          1
       stove |     44,301    .9498883     .218178          0          1
-------------+---------------------------------------------------------
   hot_water |     44,301    .8904991    .3122702          0          1
  refrigerat |     44,301    .8332543    .3727529          0          1
          tv |     44,301    .9637029    .1870306          0          1
         car |     44,301    .3826324    .4860352          0          1
    computer |     44,301    .4804632    .4996238          0          1
-------------+---------------------------------------------------------
    internet |     44,301    .3428139    .4746553          0          1
     trabajo |     44,301    .6258324    .4839127          0          1
  estudiante |     44,301    .0009706    .0311402          0          1
horas_trab~o |     44,298    23.52054    23.03381          0        100
work_part_~e |     27,722    .3764158     .484495          0          1
-------------+---------------------------------------------------------
       young |     44,301           0           0          0          0
       adult |     44,301           0           0          0          0
     fertile |     44,301           0           0          0          0
   infertile |     44,301           1           0          1          1
 kids_before |     44,301    .2825896    .4502636          0          1
-------------+---------------------------------------------------------
      pesoan |     44,301    25.79565    14.13279          1       1323
     pesosem |     43,821    51.60257    26.70252          3       1323
     pesotri |     43,821    103.0369    51.61761          2       1526
IS_impl_date |     44,301    17537.75    634.8931      16892      18414
     treated |     44,301     .726891    .4455614          0          1
-------------+---------------------------------------------------------
rel_t_anio~r |     44,301    417.4824    487.0421          0       1000
post_anio_~r |     44,301    .6633936    .4725543          0          1
rel_t_anio~m |     44,301    411.6901    488.7414          0       1000
post_anio_~m |     44,301    .6777048    .4673606          0          1
  rel_t_anio |     44,301    293.1352    451.4658          0       1000
-------------+---------------------------------------------------------
   post_anio |     44,301    .6868468    .4637813          0          1




(note: file ../output/placebo_infertile_ECH_panel.dta not found)
file ../output/placebo_infertile_ECH_panel.dta saved
(87,634 observations deleted)
(data now sorted by anio pers numero)
  variable pesoan was int now byte
  (72,717 bytes saved)
===============================================================================
> ===================
File: ../output/placebo_infertile_ECH_panel_mvd.dta
Key: anio pers numero
===============================================================================
> ===================
  72717:50(44097):337849054:1279636906

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        anio |     72,717    2008.575    3.982925       2001       2015
        pers |     72,717    1.659406    .6331195          1         11
      numero |     72,717    7.06e+08    9.61e+08          1   2.02e+09
    anio_sem |     72,717    97.64972    7.980447         82        111
    anio_qtr |     72,717    195.7981    15.97022        164        223
-------------+---------------------------------------------------------
    semestre |     72,717    1.499319     .500003          1          2
   trimestre |     72,717    2.497243    1.116099          1          4
         mes |     72,717    6.494492     3.44333          1         12
        dpto |     72,717           1           0          1          1
    loc_code |          0
-------------+---------------------------------------------------------
         ccz |     72,717     8.85097    4.786908          1         18
      hombre |     72,717           0           0          0          0
        edad |     72,717    52.28655    4.570514         45         60
      blanco |     57,083    .9531209    .2113817          0          1
        poor |     72,717    .4158587    .4928728          0          1
-------------+---------------------------------------------------------
public_hea~h |     72,717    .1868751    .3898139          0          1
     married |     72,717    .6636825    .4724522          0          1
      single |     72,717    .3363175    .4724522          0          1
     y_hogar |     72,717    36171.73    42334.36          0    1342471
  nbr_people |     72,717    3.237166    1.520818          1         25
-------------+---------------------------------------------------------
 nbr_under14 |     72,717    .3323294    .7273065          0         13
 piped_water |     72,717    .9901124    .0989445          0          1
      toilet |     72,717    .9673116    .1778209          0          1
      sewage |     72,717    .8348392    .3713282          0          1
       stove |     72,717    .9816687    .1341475          0          1
-------------+---------------------------------------------------------
   hot_water |     72,717    .9404816     .236594          0          1
  refrigerat |     72,717    .8402987    .3663313          0          1
          tv |     72,717    .9777494    .1474986          0          1
         car |     72,717    .4025194    .4904088          0          1
    computer |     72,717    .5914298    .4915729          0          1
-------------+---------------------------------------------------------
    internet |     72,717    .4854436    .4997915          0          1
     trabajo |     72,717    .7001526    .4581941          0          1
  estudiante |     72,717    .0011002    .0331506          0          1
horas_trab~o |     72,713    26.48873      21.987          0        100
work_part_~e |     50,909    .3355595    .4721903          0          1
-------------+---------------------------------------------------------
       young |     72,717           0           0          0          0
       adult |     72,717           0           0          0          0
     fertile |     72,717           0           0          0          0
   infertile |     72,717           1           0          1          1
 kids_before |     72,717    .2308126    .4213557          0          1
-------------+---------------------------------------------------------
      pesoan |     72,717    26.58972    10.15454          1        100
     pesosem |     72,717    52.81652    19.14258          5        232
     pesotri |     72,717    106.2441    37.47111          1        465
IS_impl_date |     72,717       16162           0      16162      16162
rel_t_anio~r |     72,717    628.8812    477.3575          0       1000
-------------+---------------------------------------------------------
post_anio_~r |     72,717    .8595789    .3474258          0          1
rel_t_anio~m |     72,717    626.3497    480.5956          1       1000
post_anio_~m |     72,717    .8700441    .3362572          0          1
  rel_t_anio |     72,717    505.8326     496.906          2       1000
   post_anio |     72,717    .8700441    .3362572          0          1




(note: file ../output/placebo_infertile_ECH_panel_mvd.dta not found)
file ../output/placebo_infertile_ECH_panel_mvd.dta saved

. 
end of do-file

 make.py ended: 2020-03-22 08:33:43
