
 make.py started: 2019-09-09 19:11:33 C:\Users\dgentil1\Desktop\aborto_uru_repo\Aborto-Uruguay\base\Google\code 




Execute:  "C:\Program Files (x86)\Stata14\StataSE-64.exe" /e do "./abortion_misoprostol_google_trends.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401406206058
         Licensed to:  CIS Department
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./abortion_misoprostol_google_trends.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata14\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata14\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main
  1.     import_and_merge_data
  2.         rename date month
  3.     save_data ../output/google_trends.dta, key(month) 
  4. end

. 
. program import_and_merge_data
  1.     foreach c in uruguay brazil {
  2.                 foreach t in abortion misoprostol {
  3.                         import delimited using "../../../raw/google_trends
> _`t'_`c'.csv", clear ///
>                                  rowrange(4:180) colrange(1:2) varnames(3)   
  4.                         gen date = monthly(month,"YM")
  5.                         format %tm date
  6.                         label var date "Month"
  7.                         drop month
  8.                         capture replace `t'`c' = "1" if `t'`c'=="<1"
  9.                         destring `t'`c', replace
 10.                         tempfile `t'_`c'
 11.                         save ``t'_`c''
 12.                 }
 13.         }
 14.         merge 1:1 date using `misoprostol_uruguay', assert(3) nogen
 15.         merge 1:1 date using    `abortion_uruguay', assert(3) nogen
 16.         merge 1:1 date using    `abortion_brazil' , assert(3) nogen
 17. end

. 
. * EXECUTE
. main
(2 vars, 177 obs)
abortionuruguay already numeric; no replace
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000001.tmp saved
(2 vars, 177 obs)
misoprostoluruguay already numeric; no replace
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000002.tmp saved
(2 vars, 177 obs)
abortionbrazil already numeric; no replace
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000003.tmp saved
(2 vars, 177 obs)
misoprostolbrazil already numeric; no replace
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               177  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               177  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               177  
    -----------------------------------------
(data already sorted by month)
  variable month was float now int
  (354 bytes saved)
===============================================================================
> ===================
File: ../output/google_trends.dta
Key: month
===============================================================================
> ===================
  177:5(81949):2839913723:1132095936

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       month |        177         616    51.23963        528        704
misoprosto~l |        177    48.68927    13.07407         29        100
misoprosto~y |        177    24.91525    17.52915          0        100
abortionur~y |        177    18.14124    14.28355          4        100
abortionbr~l |        177     46.9209     17.1144         25        100




file ../output/google_trends.dta saved

. 
. 
end of do-file

 make.py ended: 2019-09-09 19:11:36
