
 make.py started: 2019-09-12 19:26:07 C:\Users\dgentil1\Desktop\aborto_uru_repo\Aborto-Uruguay\base\Mortality_Brazil\code 




Execute:  "C:\Program Files (x86)\Stata14\StataSE-64.exe" /e do "./mortality_brazil.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401406206058
         Licensed to:  CIS Department
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./mortality_brazil.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata14\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata14\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main
  1.     import_brasil_data, file(tot_mortality_w_fertile) geo_var(região)
  2.     import_brasil_data, file(tot_maternal_mortality) geo_var(região)    
  3.     
.     process_brasil_data
  4.     save_data ../output/brasil_mm_data.dta, key(geo_unit anio) replace    
  5. end

. 
. program import_brasil_data
  1.     syntax, file(str) geo_var(str)
  2.  
.     import delimited "../../../raw//`file'.csv", clear ///
>         delimiter (";", collapse) varname(1)
  3.     
.     drop if missing(v2)
  4.     
.     rename `geo_var' geo_unit
  5.     
.     forval i = 2/22 {
  6.         local anio = 1994 + `i'
  7.         local name  "`file'`anio'"
  8.         rename v`i' `name' 
  9.     }
 10.     
.     reshape long `file', i(geo_unit) j(anio)
 11.     
.     drop total
 12.     
.     save "../temp/`file'.dta", replace
 13.  end

.  
. program process_brasil_data
  1.     use "../temp/tot_mortality_w_fertile.dta", clear
  2.     merge 1:1 geo_unit anio using "../temp/tot_maternal_mortality.dta", //
> /
>         assert(3) keep(3) nogen 
  3.     keep if geo_unit == "Total"
  4.     replace geo_unit = "Brasil" if geo_unit == "Total"
  5.     rename (tot_mortality_w_fertile tot_maternal_mortality) ///
>         (mortality_w_fertile maternal_mortality)
  6.     gen mm_ratio = maternal_mortality / mortality_w_fertile
  7.     
.     encode geo_unit, gen(geo_unit_num)
  8. 
.     xtset geo_unit_num anio
  9. 
.     tssmooth ma ma_mm_ratio  = mm_ratio, window(2 1 2)
 10.     label var   ma_mm_ratio "Maternal mortality over fertile women's morta
> lity"
 11.     keep geo_unit anio mm_ratio ma_mm_ratio
 12. end

. 
. *EXECUTE
. main
(23 vars, 7 obs)
(1 observation deleted)
(note: j = 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 200
> 9 2010 2011 2012 2013 2014 2015 2016)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        6   ->     126
Number of variables                  23   ->       4
j variable (21 values)                    ->   anio
xij variables:
tot_mortality_w_fertile1996 tot_mortality_w_fertile1997 ... tot_mortality_w_fer
> tile2016->tot_mortality_w_fertile
-----------------------------------------------------------------------------
(note: file ../temp/tot_mortality_w_fertile.dta not found)
file ../temp/tot_mortality_w_fertile.dta saved
(23 vars, 7 obs)
(1 observation deleted)
(note: j = 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 200
> 9 2010 2011 2012 2013 2014 2015 2016)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        6   ->     126
Number of variables                  23   ->       4
j variable (21 values)                    ->   anio
xij variables:
tot_maternal_mortality1996 tot_maternal_mortality1997 ... tot_maternal_mortalit
> y2016->tot_maternal_mortality
-----------------------------------------------------------------------------
(note: file ../temp/tot_maternal_mortality.dta not found)
file ../temp/tot_maternal_mortality.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               126  
    -----------------------------------------
(105 observations deleted)
(21 real changes made)
       panel variable:  geo_unit_num (strongly balanced)
        time variable:  anio, 1996 to 2016
                delta:  1 unit
The smoother applied was
     (1/5)*[x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2)]; x(t)= mm_ratio
(data now sorted by geo_unit anio)
  variable geo_unit was str22 now str6
  (336 bytes saved)
===============================================================================
> ===================
File: ../output/brasil_mm_data.dta
Key: geo_unit anio
===============================================================================
> ===================
  21:4(55411):990228836:2695192342

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    geo_unit |          0
        anio |         21        2006    6.204837       1996       2016
    mm_ratio |         21    .0260007    .0019504   .0234586   .0314342
 ma_mm_ratio |         21    .0260923    .0011031   .0250474   .0282617




(note: file ../output/brasil_mm_data.dta not found)
file ../output/brasil_mm_data.dta saved

. 
end of do-file

 make.py ended: 2019-09-12 19:26:08
