
 make.py started: 2020-03-22 14:30:12 C:\Users\diegog\Desktop\Diego\Aborto-Uruguay\base\Misoprostol\code 




Execute:  StataMP-64 /e do "./misoprostol.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./misoprostol.do 

. clear all

. set more off

. adopath + ../../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../library/stata/gslab_misc/ado"

. 
. program main
  1.     import_and_process_data
  2.     save_data ../output/misoprostol.dta, key(region year) replace
  3. end

. 
. program import_and_process_data
  1.     import excel using "../../../raw/fernandez_misoprostol.xlsx", ///
>         sheet("Sheet1") firstrow clear
  2.         
.     gen norm_sales2002 = 100
  3.     gen norm_sales2007 = norm_sales2002 + perc
  4.     gen sales_miso_only2002 = (sales_miso_only2007 * norm_sales2002) / nor
> m_sales2007
  5.     gen ug_per_pop2002 = sales_miso_only2002 / world_bank_pop2002
  6.     gen ug_per_pop2007 = sales_miso_only2007 / world_bank_pop2007
  7.     
.     drop world_bank* sales_miso* perc
  8.     
.     reshape long norm_sales ug_per_pop, i(Region) j(year)
  9.     
.     rename Region region
 10.     label var ug_per_pop "Misoprostol (in µg × 10^6) / Population (in mill
> ions)"
 11.     label var year "Year"
 12. end

. 
. *EXECUTE
. main
(note: j = 2002 2007)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        4   ->       8
Number of variables                   5   ->       4
j variable (2 values)                     ->   year
xij variables:
          norm_sales2002 norm_sales2007   ->   norm_sales
          ug_per_pop2002 ug_per_pop2007   ->   ug_per_pop
-----------------------------------------------------------------------------
(data already sorted by region year)
  variable norm_sales was float now int
  (16 bytes saved)
===============================================================================
> ===================
File: ../output/misoprostol.dta
Key: region year
===============================================================================
> ===================
  8:4(38330):2118303780:1268294633

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |          0
        year |          8      2004.5    2.672612       2002       2007
  norm_sales |          8     128.375    94.26246         83        361
  ug_per_pop |          8    3.830279     2.44502   .9323031   7.315043




(note: file ../output/misoprostol.dta not found)
file ../output/misoprostol.dta saved

. 
end of do-file

 make.py ended: 2020-03-22 14:30:12
