
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./append_years.do 

. clear all

. set more off

. adopath + ../../library/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../library/stata/gslab_misc/ado"

. 
. program main_append_years
  1.         append_years
  2. end

. 
. program recode_dummies
  1. syntax, vars(varlist)
  2.         foreach var in `vars' {
  3.                 replace `var'=0 if `var'==2
  4.         }
  5. end

. 
. program append_years
  1.         use ..\temp\clean_1998.dta, clear
  2.         
.         forval year=1999/2016{
  3.             append using ..\temp\clean_`year'.dta
  4.         }
  5.         replace anio = 1998 if anio == 98
  6.         replace anio = 1999 if anio == 99
  7.         replace anio = 2000 if anio == 0
  8.         
.         * asserting basic properties: 
.         * - that there are no missing departamentos in any year
.         * - and the primary keys
.         /*forval year=1999/2016{
>             unique dpto if anio == `year'
>                 local n = r(sum)
>                 assert `n' == 19
>         }
>         
>         isid numero pers anio*/
.         
.         recode_dummies, vars(trabajo estudiante hombre busca_trabajo)
  9.         
.         save_data ..\output\clean_1998_2016, key(numero pers anio) replace
 10. end

. 
. main_append_years
file ..\temp\clean_1998.dta not found
r(601);

end of do-file
r(601);
